Repository: GNOME/jhbuild
Catalog: doc/po/*/LC_MESSAGES/docs.po
Languages: pt_br, sv

source: The original set of conditions is determined on a per-OS basis and can be modified using the ``--conditions=`` commandline argument. The changes made by ``--conditions`` are visible at the time that jhbuildrc is sourced, so you can set other variables based on the current value of the set, but ``--conditions`` will be applied again after any changes made by jhbuildrc.
pt_br: A coleção original de condições é determinado de acordo com o SO e pode ser modificado usando o argumento de linha de comando ``--conditions=``. As alterações feitas por ``--conditions`` são visíveis no momento em que jhbuildrc é carregado, de forma que você possa definir outras variáveis com base no valor atual do conjunto, mas ``--conditions`` serão aplicadas novamente após qualquer alterações feita por jhbuildrc.
sv: Originaluppsättningen av villkor som bestäms på OS-basis och kan modifieras via kommandoradsargumentet ``--conditions=``. Ändringarna som görs via ``--conditions`` syns när jhbuildrc läses in så du kan ställa in andra variabler baserat på det aktuella värdet för uppsättningen men ``--conditions`` kommer att tillämpas igen efter att nya ändringar görs från jhbuildrc.

source: Other Configuration File Structures
pt_br: Outras estruturas do arquivo de configuração
sv: Andra strukturer i konfigurationsfilen

source: In addition to the above variables, there are other settings that can be set in the configuration file:
pt_br: Além das variáveis, há outras configurações que podem ser definidas no arquivo de configuração:
sv: Förutom variablerna ovan finns det andra inställningar som kan finnas i konfigurationsfilen:

source: A dictionary representing the environment. This environment is passed to processes that JHBuild spawns.
pt_br: Um dicionário representando o ambiente. Este ambiente é passado para o processo que chama o JHBuild.
sv: En uppslagsbok som representerar miljön. Denna miljö skickas vidare till processer som JHBuild startar.

source: Some influential environment variables include ``CPPFLAGS``, ``CFLAGS``, ``INSTALL`` and ``LDFLAGS``. For example:
pt_br: Algumas variáveis de ambiente influenciáveis incluem :``CPPFLAGS``, ``CFLAGS``, ``INSTALL`` e ``LDFLAGS``. Por exemplo:
sv: Ett par inflytelserika miljövariabler är ``CPPFLAGS``, ``CFLAGS``, ``INSTALL`` och ``LDFLAGS``. Till exempel:

source: This will add a directory to the ``PATH`` environment variable. ``addpath`` will correctly handle the case when the environment variable is initially empty (having a stray colon at the beginning or end of an environment variable can have unexpected consequences).
pt_br: Isso vai adicionar um diretório à variável de ambiente ``PATH``. ``addpath`` vai lidar corretamente o caso quando a variável de ambiente estiver inicialmente vazia (tendo dois-pontos no começo ou final de uma variável de ambiente pode ter consequências inesperadas).
sv: Detta kommer att lägga till en katalog till miljövariabeln ``PATH``. ``addpath`` kommer att korrekt hantera fallet när miljövariabeln är tom från början (att ha ett extra kolon i början eller slutet på en miljövariabeln kan få oförutsedda konsekvenser).

source: After processing the configuration file, JHBuild will alter some paths based on variables such as ``prefix`` (e.g. adding ``$prefix/bin`` to the start of ``PATH``).
pt_br: Após o processamento do arquivo de configuração, JHBuild vai alterar alguns caminhos baseados em tais ``prefix`` (ex.: adicionar ``$prefix/bin`` ao início de ``PATH``).
sv: Efter att ha behandlat konfigurationsfilen kommer JHBuild att förändra vissa sökvägar baserat på variabler såsom ``prefix`` (t.ex. genom att lägga till ``$prefix/bin`` i början av ``PATH``).

source: The ``prependpath`` function works like ``addpath``, except that the environment variable is modified after JHBuild has made its changes to the environment.
pt_br: A função ``prependpath`` funciona como ``addpath``, exceto que a variável de ambiente é modificada após JHBuild ter feito suas alterações no ambiente.
sv: Funktionen ``prependpath`` fungerar som ``addpath`` förutom att miljövariabeln modifieras efter att JHBuild har gjort sina ändringar i miljön.

source: Getting Started
pt_br: Primeiros passos
sv: Komma igång

source: JHBuild requires a few set up steps to be run before building software. JHBuild requires some prerequisite software, and it is necessary to install prerequisite tools needed to obtain and build the software modules.
pt_br: JHBuild exige algumas etapas de configurações para ser executado antes de compilar softwares. JHBuild tem como pré-requisito alguns softwares e também algumas ferramenta, para obter e compilar os módulos de softwares.
sv: JHBuild kräver att ett antal inställningssteg genomförs innan man bygger programvara. JHBuild förutsätter viss programvara och det är nödvändigt att installera de krävda verktygen för att hämta och bygga programvarumodulerna.

source: Installing JHBuild
pt_br: Instalando JHBuild
sv: Installera JHBuild

source: JHBuild requires a Python runtime. Verify Python >= 3.7 is installed.
pt_br: JHBuild requer um runtime do Python. Verifique se Python >= 3.7 está instalado.
sv: JHBuild kräver en Python-exekveringsmiljö. Verifiera att Python >= 3.7 är installerat.

source: The recommended way to download JHBuild is via the version control system, ``git``. This can be achieved with the following command. It is recommended to run the command from a new directory where all source code will be installed, for example, ``~/jhbuild/checkout``.
pt_br: Uma forma recomendada para baixar JHBuild é por meio do sistema de controle de versão, ``git``. Isso pode ser alcançado com o seguinte comando. É recomendado executar o comando de um novo diretório onde todo código fonte será instalado, por exemplo, ``~/jhbuild/checkout``.
sv: Det rekommenderade sättet att hämta JHBuild är via versionshanteringssystemet ``git``. Detta kan åstadkommas med följande kommando. Det rekommenderas att kommandot körs från en ny katalog där all källkod kommer att installeras, t.ex. ``~/jhbuild/checkout``.

source: This will download JHBuild into a new folder named ``jhbuild`` under the current directory. Now to build and install JHBuild:
pt_br: Isso vai baixar o JHBuild em uma pasta chamada ``jhbuild`` dentro do diretório atual. Agora, para compilar e instalar o JHBuild:
sv: Detta kommer att hämta JHBuild till en ny mapp vid namn ``jhbuild`` under den aktuella katalogen. Bygg och installera nu JHBuild:

source: If gnome-common, yelp-tools and autotools are available, ``autogen.sh`` will configure JHBuild to install via autotools. If gnome-common, yelp-tools and autotools are not available, ``autogen.sh`` will configure JHBuild to install via a plain Makefile. To always use the plain Makefile method pass ``--simple-install`` to ``autogen.sh``.
pt_br: Se gnome-common, yelp-tools e autotools estiverem disponíveis, ``autogen.sh`` vai configurar o JHBuild para instalar via autotools. Se gnome-common, yelp-tools e autotools não estiverem disponíveis, ``autogen.sh`` vai configurar JHBuild para instalar por meio de um Makefile simples. Para sempre usar o método Makefile simples passe ``--simple-install`` para o ``autogen.sh``.
sv: Om gnome-common, yelp-tools och autotools finns tillgängliga så kommer ``autogen.sh`` att konfigurera JHBuild att installera via autotools. Om gnome-common, yelp-tools och autotools inte finns tillgängliga kommer ``autogen.sh`` att konfigurera JHBuild att installera via en vanlig Makefil. För att alltid använda metoden med en vanlig Makefil, ange ``--simple-install`` till ``autogen.sh``.

source: If the above steps complete successfully, a small shell script will be installed in ``~/.local/bin`` to start JHBuild. Add ``~/.local/bin`` to the ``PATH``:
pt_br: Se os passos acima concluírem com sucesso, um pequeno script de shell será instalado em ``~/.local/bin`` para executar JHBuild. Adicione ``~/.local/bin`` no ``PATH``:
sv: Om stegen ovan avslutas framgångsrikt kommer ett litet skalskript att installeras i ``~/.local/bin`` för att starta JHBuild. Lägg till ``~/.local/bin`` i ``PATH``:

source: To permanently add ``~/.local/bin`` to the :envvar:`PATH` variable, run the following command:
pt_br: Para adicionar permanentemente ``~/.local/bin`` à variável :envvar:`PATH`, execute o seguinte comando:
sv: För att permanent lägga till ``~/.local/bin`` till variabeln :envvar:`PATH`, kör följande kommando:

source: Configuring JHBuild
pt_br: Configurando JHBuild
sv: Konfigurera JHBuild

source: JHBuild can be configured via a configuration file. The default location is ``~/.config/jhbuildrc``. If a configuration file does not exist, the defaults are used. The configuration file uses Python syntax. An example is provided, see ``examples/sample.jhbuildrc``. Copy ``examples/sample.jhbuildrc`` to ``~/.config/jhbuildrc`` and customize as required.
pt_br: JHBuild pode ser configurado por um arquivo de configuração. A localização padrão é ``~/.config/jhbuildrc``. Se um arquivo de configuração não existir, o padrão é usado. O arquivo de configuração usa uma sintaxe Python. Um exemplo é fornecido em ``examples/sample.jhbuildrc``. Copie ``examples/sample.jhbuildrc`` para ``~/.config/jhbuildrc`` e personalize da forma que precisar.
sv: JHBuild kan konfigureras via en konfigurationsfil. Standardplatsen är ``~/.config/jhbuildrc``. Om en konfigurationsfil inte existerar kommer standardvärden att användas. Konfigurationsfilen använder Python-syntax. Ett exempel finns, se ``examples/sample.jhbuildrc``. Kopiera ``examples/sample.jhbuildrc`` till ``~/.config/jhbuildrc`` och anpassa efter behov.

source: It will also load any ``jhbuildrc`` files in :envvar:`XDG_CONFIG_DIRS` directories. This is useful for system-wide configuration.
pt_br: Isto também carregará quaisquer arquivos ``jhbuildrc`` nos diretórios :envvar:`XDG_CONFIG_DIRS`. Isto é útil em configurações para todo o sistema.
sv: Det kommer också läsa in alla ``jhbuildrc``-filer i :envvar:`XDG_CONFIG_DIRS`-kataloger. Detta är användbart för systemomfattande konfiguration.

source: The sample configuration will make JHBuild build the meta-gnome-core and meta-gnome-apps-tested modules and dependencies from the ``gnome-apps`` module set. JHBuild will unpack source trees to ``~/jhbuild/checkout/`` and install all files to subdirectories of ``~/jhbuild/install/``. The two directories must be writable.
pt_br: A amostra de configuração fará com que o JHBuild compile os módulos de meta-gnome-core e meta-gnome-apps-tested e as dependências da coleção de módulos ``gnome-apps``. JHBuild vai descompactar as árvores de fontes para ``~/jhbuild/checkout/`` e instalar todos os arquivos em subdiretórios de ``~/jhbuild/install/``. Os dois diretórios devem poder ser escritos.
sv: Exempelkonfigurationsfilen kommer att göra så att JHBuild bygger modulerna meta-gnome-core och meta-gnome-apps-tested och beroenden från moduluppsättningen ``gnome-apps``. JHBuild kommer att packa upp källträden i ``~/jhbuild/checkout/`` och installera alla filer i underkataloger under ``~/jhbuild/install/``. De två katalogerna måste vara skrivbara.

source: Configuration variables are documented in :doc:`config-reference`. The most commonly used variables are:
pt_br: Variáveis de configuração estão documentadas em :doc:`config-reference`. As variáveis normalmente usadas são:
sv: Konfigurationsvariabler finns dokumenterade i :doc:`config-reference`. De vanligast använda variablerna är:

source: A dictionary that can be used to specify an alternative repository location for a particular repository. This configuration variable is useful to a module developer. By default, JHBuild will check out code from repositories using an anonymous repository location. The dictionary keys are short repository names and the values are alternative repository location strings. For example:
pt_br: Um dicionário que pode ser usado para especificar uma localização alternativa de repositório para um repositório particular. Esta variável de configuração é útil para desenvolvedores de módulos. Por padrão, JHBuild vai baixar o código de repositórios usando uma localização anônima de repositório. As chaves de dicionário são nomes curtos de repositórios e os nomes são textos com a localização alternativa do repositório. Por exemplo:
sv: En uppslagsbok som kan användas för att ange en alternativ arkivplats för ett visst arkiv. Denna konfigurationsvariabel är användbar för en modulutvecklare. Som standard kommer JHBuild att checka ut kod från arkiv via en anonym arkivplats. Upplagsverkets nycklar är korta arkivnamn och värdena är alternativa arkivplatssträngar. Till exempel:

source: A string specifying the directory to unpack source trees to. If :ref:`buildroot` is set to ``None``, builds will occur in this directory too. Defaults to ``~/jhbuild/checkout``.
pt_br: Uma string especificando o diretório para o qual deve-se descompilar árvores de fontes. A menos que :ref:`buildroot` esteja especificado para ``None``, as compilações ocorrerão neste diretório também. Padrão é ``~/checkout/gnome``.
sv: En sträng som anger vilken katalog som källkodsträd ska packas upp i. Om :ref:`buildroot` (byggrot) är satt till ``None`` (ingen) kommer också byggen att ske i denna katalog. Standardvärdet är ``~/jhbuild/checkout``.

source: A string containing arguments passed to the ``autogen.sh`` script of all modules. Can be overridden for particular modules using the :ref:`autogenargs` dictionary.
pt_br: Uma string contendo argumentos passados para o script ``autogen.sh`` de todos os módulos. Pode ser sobrescrita por módulos em particular, usando o dicionário :ref:`autogenargs`.
sv: En sträng som innehåller argument som anges till skriptet ``autogen.sh`` för alla moduler. Kan åsidosättas för specifika moduler via uppslagsboken :ref:`autogenargs`.

source: A string containing arguments passed to the ``cmake`` invocation of all modules. Can be overridden for particular modules using the :ref:`cmakeargs` dictionary.
pt_br: Uma string contendo argumentos passados para a chamada de ``cmake`` de todos os módulos. Pode ser sobrescrita por módulos em particular, usando o dicionário :ref:`cmakeargs`.
sv: En sträng som innehåller argument som anges till ``cmake``-anropet för alla moduler. Kan åsidosättas för specifika moduler via uppslagsboken :ref:`cmakeargs`.

source: A string listing additional arguments to be passed to ``make``. JHBuild will automatically append the parallel execution option (``-j``) based upon available CPU cores. Defaults to ``''``.
pt_br: Um texto listando argumentos adicionais a serem passados para o ``make``. JHBuild vai anexar automaticamente a opção de execução paralela (``-j``) baseada nos núcleos de CPU disponíveis. Padrão é ``''``.
sv: En sträng som listar ytterligare argument som ska anges till ``make``. JHBuild kommer automatiskt att lägga till den parallella exekveringsflaggan (``-j``) baserat på antalet tillgängliga CPU-kärnor. Standardvärdet är ``''``.

source: A string containing arguments passed to the :command:`meson` invocation of all modules. Can be overridden for particular modules using the :ref:`mesonargs` dictionary.
pt_br: Uma string contendo argumentos passados para a chamada de :command:`meson` de todos os módulos. Pode ser sobrescrita por módulos em particular, usando o dicionário :ref:`mesonargs`.
sv: En sträng som innehåller argument som anges till :command:`meson`-anropet för alla moduler. Kan åsidosättas för specifika moduler via uppslagsboken :ref:`mesonargs`.

source: A string listing additional arguments to be passed to :command:`ninja`. Defaults to ``''``.
pt_br: Uma string listando argumentos a serem passados para o :command:`ninja`. Por padrão, usa ``''``.
sv: En sträng som listar ytterligare argument som ska skickas till :command:`ninja`. Standardvärdet är ``''``.

source: Build Prerequisites
pt_br: Pré-requisitos de compilação
sv: Byggförutsättningar

source: Before any modules can be built, it is necessary to have certain build tools installed. Common build tools include the GNU Autotools (autoconf, automake, libtool and gettext), The GNU Toolchain (binutils, gcc, g++), make, pkg-config and Python, depending on which modules will be built.
pt_br: Antes que qualquer módulo possa ser compilado, é necessário ter certas ferramentas de compilação instaladas. Ferramentas de compilação comuns incluem o GNU Autotools (autoconf, automake, libtool e gettext), o conjunto de ferramentas GNU (binutils, gcc, g++), make, pkg-config e Python, dependendo de quais módulos serão compilados.
sv: Innan några moduler kan byggas är det nödvändigt att ha vissa byggverktyg installerade. Vanliga byggverktyg inkluderar GNU Autotools (autoconf, automake, libtool och gettext), GNU-verktygskedjan (binutils, gcc, g++), make, pkg-config och Python, beroende på vilka moduler som ska byggas.

source: JHBuild can check the tools are installed using the :ref:`sanitycheck` command:
pt_br: JHBuild pode verificar se as ferramentas estão instaladas usando o :ref:`sanitycheck` command:
sv: JHBuild kan kontrollera att verktygen är installerade via kommandot :ref:`sanitycheck`:

source: If this command displays any messages, please install the required package from your distribution's repository. A list of `package names <http://live.gnome.org/JhbuildDependencies>`__ for different distributions is maintained on the GNOME wiki. Run the ``sanitycheck`` command again after installing the distribution's packages to ensure the required tools are present.
pt_br: Se este comando exibir quaisquer mensagens, por favor instale o pacote necessário do repositório de sua distribuição. Uma lista de `nomes de pacotes <http://live.gnome.org/JhbuildDependencies>`__ para diferentes distribuições é mantida no wiki do GNOME. Execute o comando ``sanitycheck`` novamente após a instalação dos pacotes da distribuição para certificar de que as ferramentas necessárias estão presentes.
sv: Om detta kommando visar några meddelanden, installera paketet som krävs från din distributions arkiv. En lista över `paketnamn <http://live.gnome.org/JhbuildDependencies>`__ för olika distributioner underhålls på GNOMEs wiki. Kör kommandot ``sanitycheck`` på nytt efter att du installerat distributionens paket för att säkerställa att verktygen är installerade.

source: Using JHBuild
pt_br: Usando JHBuild
sv: Att använda JHBuild

source: After set up is complete, JHBuild can be used to build software. To build all the modules selected in the ``~/.config/jhbuildrc`` file, run the following command:
pt_br: Após a configuração ter sido concluída, JHBuild poderá ser usado para compilar softwares. Para compilar todos os módulos selecionados no arquivo ``~/.config/jhbuildrc``, execute o seguinte comando:
sv: Efter att installationen är avslutad kan JHBuild användas för att bygga programvara. För att bygga alla moduler som valts i filen ``~/.config/jhbuildrc``, kör följande kommando:

source: JHBuild will download, configure, compile and install each of the modules. If an error occurs at any stage, JHBuild will present a menu asking what to do. The choices include dropping to a shell to fix the error, rerunning the build from various stages, giving up on the module, or ignore the error and continue.
pt_br: JHBuild vai baixar, configurar, compilar e instalar cada um dos módulos. Se um erro ocorrer em qualquer estágio, o JHBuild vai apresentar um menu perguntando o que deve ser feito. As escolhas incluem entrar em um shell para corrigir o erro, executar novamente a compilação de vários estágios, desistir do módulo ou ignorar o erro e continuar.
sv: JHBuild kommer att hämta, konfigurera, kompilera och installera varje modul. Om ett fel uppstår någonstans kommer JHBuild att visa en meny och fråga vad som ska hända. Alternativen inkluderar att öppna ett skal för att fixa problemet, köra om bygget från olika steg, hoppa över modulen eller ignorera felet och fortsätta.

source: Giving up on a module will cause any modules depending on the module to fail.
pt_br: Desistir do módulo vai levar qualquer módulo que dependa dele a falhar.
sv: Att hoppa över en modul kommer att förorsaka att de moduler som beror på modulen misslyckas.

source: Below is an example of the menu displayed:
pt_br: Logo abaixo está um exemplo do menu exibido:
sv: Nedan finns ett exempel på menyn som visas:

source: It is also possible to build a different set of modules and their dependencies by passing the module names as arguments to the ``build`` command. For example, to build gtk+:
pt_br: Também é possível compilar uma coleção diferente de módulos e suas dependências passando os nomes de módulos para o comando ``build``. Por exemplo, para compilar gtk+:
sv: Det är också möjligt att bygga en annan uppsättning moduler och deras beroenden genom att ange modulnamnen som argument till kommandot ``build``. För att till exempel bygga gtk+:

source: If JHBuild is cancelled part way through a build, it is possible to resume the build at a particular module using the ``--start-at`` option:
pt_br: Se JHBuild for cancelado no meio de uma compilação, é possível resumi-la em um módulo em particular usando a opção ``--start-at``:
sv: Om JHBuild avbryts halvvägs genom ett bygge är det möjligt att återuppta bygget vid en specifik modul via flaggan ``--start-at``:

source: To build one or more modules, ignoring their dependencies, JHBuild provides the ``buildone`` command. For the ``buildone`` command to complete successfully, all dependencies must be previously built and installed or provided by distribution packages.
pt_br: Para compilar um ou mais módulos, ignorando suas dependências, JHBuild tem o comando ``buildone``. Para o comando ``buildone`` concluir com sucesso, todas as dependências devem estar previamente compiladas e instaladas ou fornecidas por pacotes de distribuição.
sv: För att bygga en eller flera moduler, utan deras beroenden, tillhandahåller JHBuild kommandot ``buildone``. För att kommandot ``buildone`` ska kunna avslutas korrekt måste alla beroenden ha byggts och installerats tidigare eller tillhandahållas av distributionspaket.

source: When actively developing a module, you are likely in a source working directory. The ``make`` will invoke the build system and install the module. This will be a key part of your edit-compile-install-test cycle.
pt_br: Quando desenvolvendo ativamente um módulo, você provavelmente o faz no diretório de trabalho dos fontes. O ``make`` vai chamar o sistema de compilação e instalar o módulo. Isso será uma parte chave do ciclo de editar-compilar-instalar-testar.
sv: Under aktiv utveckling av en modul befinner du dig sannolikt i en arbetskatalog för källkoden. ``make`` kommer att starta byggsystemet och installera modulen. Detta kommer att vara en väsentlig del i cykeln redigera-kompilera-installera-testa.

source: To get a list of the modules and dependencies JHBuild will build, and the order they will be built, use the ``list`` command:
pt_br: Para obter uma lista de módulos e dependências que o JHBuild vai compilar e a ordem na qual eles serão compilados, use o comando ``list``:
sv: För att få en lista över modulerna och deras beroenden som JHBuild kommer att bygga, och ordningen de kommer att byggas i, använd kommandot ``list``:

source: To get information about a particular module, use the ``info`` command:
pt_br: Para obter informações sobre um módulo em particular, use o comando ``info``:
sv: För att få information om en viss modul, använd kommandot ``info``:
