Repository: GNOME/jhbuild
Catalog: doc/po/*/LC_MESSAGES/docs.po
Languages: pt_br, sv

source: The ``autogen-sh`` attribute specifies the name of the autogen.sh script to run. The value ``autoreconf`` can be used if your module has no ``autogen.sh`` script equivalent. In that case, JHBuild will run ``autoreconf -fi``, followed by the proper ``configure``. skip-autogen chooses whether or not to run autogen.sh, it is a boolean with an extra ``never`` value to tell JHBuild to never skip running ``autogen.sh``. ``skip-install`` is a boolean attribute specifying whether to skip ``make install`` command on the module. makefile specifies the filename of the makefile to use.
pt_br: O atributo ``autogen-sh`` especifica o nome do script autogen.sh a ser executado. O valor ``autoreconf`` pode ser usado se seu módulo não possuir um script ``autogen.sh`` equivalente. Nesse caso, JHBuild vai executar ``autoreconf -fi``, seguido pelo ``configure`` apropriado. skip-autogen escolhe executar ou não o autogen.sh, sendo ele um boolean com um valor ``never`` extra para informar o JHBuild para nunca pular a execução do ``autogen.sh``. ``skip-install`` é um atributo boolean especificando pular ou não o comando ``make install`` no módulo. ``makefile`` especifica o nome de arquivo do makefile a ser usado.
sv: Attributet ``autogen-sh`` anger namnet på autogen.sh-skriptet som ska köras. Värdet ``autoreconf`` kan användas om modulen inte har någon ``autogen.sh``-skriptekvivalent. I det fallet kommer JHBuild att köra ``autoreconf -fi`` följt av det riktiga ``configure``-kommandot. skip-autogen väljer huruvida autogen.sh ska köras, det är ett booleskt värde med ett extra ``never``-värde som berättar för JHBuild att det aldrig ska hoppa över att köra ``autogen.sh``. ``skip-install`` är ett booleskt attribut som anger huruvida ``make install``-kommandot ska hoppas över för modulen. makefile anger filnamnet på makefilen som ska användas.

source: The ``uninstall-before-install`` specifies any old installed files from the module should before removed before running the install step. This can be used to work around a problem where libtool tries to link one library it is installing against another library it is installing, but because of jhbuild's use of ``DESTDIR``, finds the old installed library instead. The downside of specifying this is that it could cause problems if the user is currently running code that relies on installed files from the module.
pt_br: O ``uninstall-before-install`` especifica quaisquer arquivos antigos instalados do módulo que deveriam ser removidos antes de executar a etapa de instalação. Isso pode ser usado para contornar um problema no qual libtool tenta criar um link de uma biblioteca que ele está instalando com outra que ele está instalando, mas, por causa do jhbuild usar ``DESTDIR``, acaba por encontrar a biblioteca antiga instalada. O lado negativo de se especificar isso é que pode causar problemas se o usuário estiver atualmente executando um código que depende dos arquivos instalados do módulo.
sv: ``uninstall-before-install`` anger att gamla installerade filer från modulen ska tas bort innan installationssteget körs. Detta kan användas för att kringgå ett problem där libtool försöker att länka ett bibliotek som det håller på att installera mot ett annat bibliotek som det installerar, men eftersom jhbuild använder ``DESTDIR`` hittas det gamla installerade biblioteket i stället. Nackdelen med att ange detta är att det kan skapa problem om användaren för närvarande kör kod som beror av de installerade filerna från modulen.

source: The ``supports-non-srcdir-builds`` attribute is used to mark modules that can't be cleanly built using a separate source directory.
pt_br: O atributo ``supports-non-srcdir-builds`` é usado para marcar módulos que não podem ser compilados do zero usando um diretório de fontes separados.
sv: Attributet ``supports-non-srcdir-builds`` används för att markera moduler som inte kan byggas korrekt i en separat källkodskatalog.

source: The ``force-non-srcdir-builds`` attribute is used to mark modules that can't be cleanly built from the source directory, but can be built from outside it.
pt_br: O atributo ``force-non-srcdir-builds`` é usado para marcar módulos que não podem ser compilados do zero usando um diretório de fontes, mas podem ser compilados fora dele.
sv: Attributet ``force-non-srcdir-builds`` används för att markera moduler som inte kan byggas korrekt från källkodskatalogen, men som kan byggas utanför den.

source: The ``autogen-template`` attribute can be used if you need finer control over the autogen command line. It is a python format string, which will be substituted with the following variables: ``srcdir``, ``autogen-sh``, ``prefix``, ``libdir``, and ``autogenargs``. For example, here is the default autogen-template:
pt_br: O atributo ``autogen-template`` pode ser usado se você precisar um controle melhor da linha de comando do autogen. Ele é uma string no formato python, que será substituída pelas seguintes variáveis: ``srcdir``, ``autogen-sh``, ``prefix``, ``libdir`` e ``autogenargs``. Por exemplo, aqui está o autogen-template padrão:
sv: Attributet ``autogen-template`` kan användas om du behöver mer detaljkontroll över kommandoraden för autogen. Det är en python-formaterad sträng i vilken följande variabler kommer att ersättas: ``srcdir``, ``autogen-sh``, ``prefix``, ``libdir`` och ``autogenargs``. Här är till exempel standardvärdet för autogen-template:

source: The ``check-target`` attribute must be specified (with false as value) for modules that do not have a ``make check`` target.
pt_br: O atributo ``check-target`` deve ser especificado (com valor sendo falso) para módulos que não possuem um alvo para ``make check``.
sv: Attributet ``check-target`` måste anges (med värdet false (falskt)) för moduler som inte har ett ``make check``-mål.

source: The ``supports-static-analyzer`` attribute must be specified (with false as value) for modules which don’t support being built under a static analysis tool such as ``scan-build``.
pt_br: O atributo ``supports-static-analyzer`` deve ser especificado (com valor sendo falso) para módulos que não possuem suporte a compilação sob uma ferramenta estática, tal como ``scan-build``.
sv: Attributet ``supports-static-analyzer`` måste anges (med värdet false (falskt))) för moduler som inte har stöd för att byggas under ett statiskt analysverktyg såsom ``scan-build``.

source: The ``supports-unknown-configure-options`` attribute is used to mark modules that will error out if an unknown option is passed to ``configure``. Global configure options will not be used for that module.
pt_br: O atributo ``supports-unknown-configure-options`` é usado para marcar módulos que vão resultar em erro se uma opção desconhecida é passada para ``configure``. Opções de configurações globais não serão usada para aquele módulo.
sv: Attributet ``supports-unknown-configure-options`` används för att markera moduler som kommer att misslyckas med fel om en okänd flagga skickas med till ``configure``. Globala flaggor för configure kommer inte att användas för den modulen.

source: The ``cmake`` element is used to define a module which is built using the CMake build system.
pt_br: O elemento ``cmake`` é usado para definir um módulo que é compilado usando o sistema de compilação do CMake.
sv: Elementet ``cmake`` används för att definiera en modul som byggs via byggsystemet CMake.

source: The ``cmakeargs`` attribute is used to specify additional arguments to pass to ``cmake``.
pt_br: O atributo ``makeargs`` é usado para especificar argumentos adicionais a ser passados para o ``cmake``.
sv: Attributet ``cmakeargs`` används för att ange ytterligare argument som ska skickas till ``cmake``.

source: The ``ninjaargs`` attribute is used to specify additional arguments to pass to ``ninja``.
pt_br: O atributo ``ninjaargs`` é usado para especificar argumentos adicionais a ser passados para o ``ninja``.
sv: Attributet ``ninjaargs`` används för att ange ytterligare argument som ska skickas till ``ninja``.

source: The ``makeargs`` attribute is used to specify additional arguments to pass to ``make``.
pt_br: O atributo ``makeargs`` é usado para especificar argumentos adicionais a ser passados para o ``make``.
sv: Attributet ``makeargs`` används för att ange ytterligare argument som ska skickas till ``make``.

source: The ``cmakedir`` attribute specifies the subdirectory where cmake will run in relation to srcdir.
pt_br: O atributo ``cmakedir`` é usado para especificar o subdiretório no qual o cmake será executado em relação ao srcdir.
sv: Attributet ``cmakedir`` anger underkatalogen där cmake kommer köras i förhållande till srcdir.

source: The ``use-ninja`` attribute is used to mark modules should be built using the Ninja backend for cmake, instead of the Make backend. The default is to use the Ninja backend.
pt_br: O atributo ``use-ninja`` é usado para marcar módulos que devem se compilados usando o backend Ninja para cmake, em vez do backend Make. O padrão é usar o backend Ninja.
sv: Attributet ``use-ninja`` används för att markera moduler som ska byggas via Ninja-bakänden för cmake, i stället för Make-bakänden. Standard är att använda Ninja-bakänden.

source: The ``meson`` element is used to define a module which is configured using the Meson build system and built using the Ninja build tool.
pt_br: O elemento ``meson`` é usado para definir um módulo que é configurado usando o sistema de compilação do Meson e compilado usando a ferramenta de compilação Ninja.
sv: Elementet ``meson`` används för att definiera en modul som konfigureras med byggsystemet Meson och byggs med byggverktyget Ninja.

source: The ``mesonargs`` attribute is used to specify additional arguments to pass to ``meson``.
pt_br: O atributo ``mesonargs`` é usado para especificar argumentos adicionais a ser passados para o ``meson``.
sv: Attributet ``mesonargs`` används för att ange ytterligare argument som ska skickas till ``meson``.

source: The ``distutils`` element is used to define a module which is built using python's distutils.
pt_br: O elemento ``distutils`` é usado para definir um módulo que é compilado usando distutils do python.
sv: Elementet ``distutils`` används för att definiera en modul som byggs med pythons distutils.

source: The ``linux`` element defines a module used to build a linux kernel. In addition, a separate kernel configuration can be chosen using the kconfig subelement.
pt_br: O elemento ``linux`` define um módulo usado para compilar um kernel do linux. Além disso, uma configuração de kernel separada pode ser escolhida usando o subelemento kconfig.
sv: Elementet ``linux`` definierar en modul som används för att bygga en linux-kärna. Därtill kan en separat kärnkonfiguration väljas via underelementet kconfig.

source: The ``perl`` element is used to build perl modules.
pt_br: O elemento ``perl`` é usado para compilar módulos de perl.
sv: Elementet ``perl`` används för att bygga perl-moduler.

source: The ``systemmodule`` element is used to specify modules that must be provided by the system. The module should be installed by your distributions package management system.
pt_br: O elemento ``systemmodule`` é usado para especificar os módulos que deve ser fornecidos pelo sistema. O módulo deveria ser instalado pelo sistema de gerenciamento de pacotes da sua distribuição.
sv: Elementet ``systemmodule`` används för att ange moduler som måste tillhandahållas av systemet. Modulen bör finnas installerad av din distributions pakethanteringssystem.

source: If the system module does not provide a pkg-config file, systemdependencies tag can be used to identify the dependencies. Two values are supported by the ``type`` attribute of the dep tag:
pt_br: Se o módulo do sistema não fornecer um arquivo de pkg-config, a tag systemdependencies pode ser usada para identificar as dependências. Há suporte a dois valores no atributo ``type`` da tag dep:
sv: Om systemmodulen inte tillhandahåller en pkg-config-fil kan en systemdependencies-tagg användas för att identifiera beroendena. Två värden stöds för ``type``-attributet för dep-taggen:

source: ``path`` value. The path is searched for the matching program name.
pt_br: Valor ``path``. O caminho é pesquisado por um nome de programa correspondente.
sv: Värdet ``path``. Sökvägen genomsöks efter ett matchande programnamn.

source: ``c_include`` value. The C include path is searched for the matching header name. name may include a sub-directory. The C include search path can modified by setting ``CPPFLAGS`` within the configuration variables ``cflags`` or :ref:`module_autogenargs`.
pt_br: Valor ``c_include``. O caminho de include C é pesquisado pelo nome de header correspondente. name pode incluir um subdiretório. O caminho de pesquisa de includes C podem ser modificados pela configuração ``CPPFLAGS`` dentro das variáveis de configuração ``cflags`` ou :ref:`module_autogenargs`.
sv: Värdet ``c_include``. C-inkluderingssökvägen genomsöks efter matchande huvudnamn. name får inkludera en underkatalog. C-inkluderingssökvägen kan modifieras genom att sätta ``CPPFLAGS`` inom konfigurationsvariablerna ``cflags`` eller :ref:`module_autogenargs`.

source: If the system module may be installed in different locations or installed with different names by different distributions, altdep tag can be used as subelements of dep tag to specify alternative locations or names. altdep tag support the same attributes as dep tag does.
pt_br: Se o módulo do sistema puder ser instalado em diferentes localizações ou instalado com diferentes nomes por diferentes localizações, a tag altdep pode ser usada como subelementos da tag dep para especificar localizações e nomes alternativos. A tag altdep oferece suporte aos mesmo atributos que a tag dep.
sv: Om systemmodulen kan installeras på olika platser eller installeras under olika namn av olika distributioner kan taggen altdep användas som underelement till dep-taggen för att ange alternativa platser eller namn. Taggen altdep har stöd för samma attribut som taggen dep.

source: The ``waf`` element is used to define a module which is built using the Waf build system.
pt_br: O elemento ``waf`` é usado para definir um módulo que é compilado usando o sistema de compilação do Waf.
sv: Elementet ``waf`` används för att definiera en modul som byggs med byggsystemet Waf.

source: The ``waf-command`` attribute is used to specify the waf command script to use; it defaults to ``waf``.
pt_br: O atributo ``waf-command`` é usado para especificar o script do comando waf a ser usado. Padrão é ``waf``.
sv: Attributet ``waf-command`` används för att ange waf-kommandoskriptet som ska användas; standardvärdet är ``waf``.

source: The ``python-command`` attribute is used to specify the Python executable to use; it defaults to ``python``. This is useful to build modules against version 3 of Python.
pt_br: O atributo ``python-command`` é usado para especificar o executável do Python a ser usado. Padrão é ``python``. Isso é útil para compilar módulos com a versão 3 do Python.
sv: Attributet ``python-command`` används för att ange vilket körbart Python-program som ska användas; standardvärdet är ``python``. Detta är användbart för att bygga moduler med version 3 av Python.

source: The ``testmodule`` element is used to create a module which runs a suite of tests using LDTP or Dogtail.
pt_br: O elemento ``testmodule`` é usado para criar um módulo que executa uma suíte de testes usando LDTP ou Dogtail.
sv: Elementet ``testmodule`` används för att skapa en modul som kör en svit av tester via LDTP eller Dogtail.

source: The ``type`` attribute gives the type of tests to be run in the module. 'dogtail' uses python to invoke all .py files. 'ldtp' invokes 'ldtprunner run.xml'.
pt_br: O atributo ``type`` fornece um tipo de testes para ser executado no módulo. 'dogtail' usa python para chamar todos os arquivos .py. 'ldtp' chama 'ldtprunner run.xml'.
sv: Attributet ``type`` anger typen av tester som ska köras i modulen. ”dogtail” använder python för att anropa alla .py-filer. ”ldtp” anropar ”ldtprunner run.xml”.

source: Unless the :ref:`noxvfb` configuration option is set, an Xvfb server is started to run the tests in.
pt_br: A menos que a opção de configuração :ref:`noxvfb` esteja definida, um servidor Xvfb é iniciado para executar os testes.
sv: Om inte :ref:`noxvfb`-konfigurationsflaggan är inställd kommer en Xvfb-server att startas för att köra testerna i.

source: The ``metamodule`` element defines a module that doesn't actually do anything. The only purpose of a module of this type is its dependencies.
pt_br: O elemento ``metamodule`` define um módulo que, na verdade, nada faz. O único propósito de um módulo deste tipo é suas dependências.
sv: Elementet ``metamodule`` definierar en modul som egentligen inte gör någonting. Det enda syftet med en modul av denna typ är dess beroenden.

source: For example, meta-gnome-desktop depends on all the key components of the GNOME desktop, therefore telling JHBuild to install it actually installs the full desktop.
pt_br: Por exemplo, meta-gnome-desktop depende de todos os componentes chave do ambiente GNOME e, portanto, ao dizer ao JHBuild para instalá-lo, na verdade instala o ambiente inteiro.
sv: Exempelvis beror meta-gnome-desktop på alla nyckelkomponenter i GNOME-skrivbordet, så om du berättar för JHBuild att det ska installeras så installeras den fullständiga skrivbordsmiljön.

source: The ``id`` attribute gives the name of the module. The child elements are handled as for :ref:`autotools`.
pt_br: O atributo ``id`` retorna o nome o módulo. Os elementos são tratados com :ref:`autotools`.
sv: Attributet ``id`` anger namnet på modulen. Barnelementen hanteras som för :ref:`autotools`.

source: Deprecated Elements
pt_br: Elementos obsoletos
sv: Föråldrade element

source: The ``cvsroot`` element is now deprecated - the ``repository`` element should be used instead.
pt_br: O elemento ``cvsroot`` está agora obsoleto - o elemento ``repository`` deveria ser usado em seu lugar.
sv: Elementet ``cvsroot`` är nu föråldrat - elementet ``repository`` bör användas i stället.

source: The ``cvsroot`` element is used to describe a CVS repository.
pt_br: O elemento ``cvsroot`` é usado para descrever um repositório CVS.
sv: Elementet ``cvsroot`` används för att beskriva ett CVS-arkiv.

source: The ``name`` attribute should be a unique identifier for the CVS repository.
pt_br: O atributo ``name`` deveria ser um identificador único do repositório CVS.
sv: Attributet ``name`` bör vara en unik identifierare för CVS-arkivet.

source: The ``default`` attribute says whether this is the default module source for this module set file.
pt_br: O atributo ``default`` informa se este é ou não a fonte padrão do módulo deste arquivo de coleção de módulos.
sv: Attributet ``default`` berättar huruvida detta är standardmodulkällan för denna moduluppsättningsfil.

source: The ``root`` attribute lists the CVS root used for anonymous access to this repository, and the ``password`` attribute gives the password used for anonymous access.
pt_br: O atributo ``root`` lista a raiz CVS usada para um acesso anônimo a este repositório e o atributo ``password`` informa a senha usada para um acesso anônimo.
sv: Attributet ``root`` listar CVS-roten som används för anonym tillgång till detta arkiv, och attributet ``password`` anger lösenordet som ska användas för anonym tillgång.

source: The ``svnroot`` element is now deprecated - the ``repository`` element should be used instead.
pt_br: O elemento ``svnroot`` está agora obsoleto - o elemento ``repository`` deveria ser usado em seu lugar.
sv: Elementet ``svnroot`` är nu föråldrat - elementet ``repository`` bör användas i stället.

source: The ``svnroot`` element is used to describe a Subversion repository.
pt_br: O elemento ``svnroot`` é usado para descrever um repositório Subversion.
sv: Elementet ``svnroot`` används för att beskriva ett Subversion-arkiv.

source: The ``name`` attribute should be a unique identifier for the Subversion repository.
pt_br: O atributo ``name`` deveria ser um identificador único do repositório Subversion.
sv: Attributet ``name`` bör vara en unik identifierare för Subversion-arkivet.

source: The ``href`` attribute lists the base URL for the repository. This will probably be either a ``http``, ``https`` or ``svn`` URL.
pt_br: O atributo ``href`` lista a URL base do repositório. Provavelmente será uma URL de ``http``, ``https`` ou ``svn``.
sv: Attributet ``href`` listar bas-URL:en för arkivet. Detta kommer troligtvis antingen att vara en ``http``-, ``https``- eller ``svn``-URL.

source: Deprecated Module Types
pt_br: Tipos de módulos obsoletos
sv: Föråldrade modultyper

source: This section describes deprecated elements, they may still be used in existing module sets but it is advised not to use them anymore.
pt_br: Esta seção descreve elementos obsoletos. Eles podem estar sendo usados em coleções de módulos existentes, mas é aconselhado não mais usá-los.
sv: Detta avsnitt beskriver föråldrade element, de kanske fortfarande används i existerande moduluppsättningar men det rekommenderas att inte använda dem längre.

source: tarball
sv: tar-arkiv

source: This deprecated element is just a thin wrapper around both autotools module type and tarball repository type.
pt_br: Este elemento obsoleto é apenas uma interface dos tipos de módulo autotools e de repositório tarball.
sv: Detta föråldrade element är bara ett tunt omslag kring både modultypen autotools och arkivtypen tarball.

source: The ``tarball`` element is used to define a module that is to be built from a tarball.
pt_br: O elemento ``tarball`` é usado para definir um módulo que está para ser compilado a partir de um tarball.
sv: Elementet tarball används för att definiera en modul som ska byggas från ett tar-arkiv.

source: The ``id`` and ``version`` attributes are used to identify the module.
pt_br: Os atributos ``id`` e ``version`` são usados para identificar o módulo.
sv: Attributen ``id`` och ``version`` används för att identifiera modulen.

source: The ``source`` element specifies the file to download and compile. The ``href`` attribute is mandatory, while the ``size`` and ``hash``, as well as the obsolete ``md5sum``, attributes are optional. If these last two attributes are present, they are used to check that the source package was downloaded correctly.
pt_br: O elemento ``source`` especifica o arquivo para baixar e compilar. O atributo ``href`` é obrigatório, enquanto os atributos ``size`` e ``hash``, assim como o obsoleto ``md5sum``, são opcionais. Se esses últimos dois atributos estiverem presentes, eles são usados para verificar se o pacote de fontes foi baixado corretamente.
sv: Elementet ``source`` anger filen som ska hämtas och kompileras. Attributet ``href`` är obligatoriskt medan ``size`` och ``hash``, såväl som det föråldrade ``md5sum``-attributet är frivilliga. Om dessa två sista attribut finns med används de för att kontrollera att källpaketet hämtades korrekt.

source: The ``patches`` element is used to specify one or more patches to apply to the source tree after unpacking, the ``file`` attribute gives the patch filename, and the ``strip`` attribute says how many levels of directories to prune when applying the patch.
pt_br: O elemento ``patches`` é usado para especificar um ou mais patches a serem aplicados na árvore de fontes após descompactar, o atributo ``file`` fornece o nome de arquivo do patch e o atributo ``strip`` informa quantos níveis devem ser suprimidos ao aplicar o patch.
sv: Elementet ``patches`` används för att ange en eller flera programfixar som ska appliceras på källträdet efter uppackning, ``file``-attributet ger filnamnet för programfixen och attributet ``strip`` säger hur många nivåer av kataloger som ska tas bort när programfixen appliceras.
