Repository: GNOME/jhbuild
Catalog: doc/po/*/LC_MESSAGES/docs.po
Languages: pt_br, sv

source: Command Reference
pt_br: Referência de comando
sv: Kommandoreferens

source: JHBuild uses a command line syntax similar to tools like CVS:
pt_br: JHBuild usa uma sintaxe de linha de comando similar a ferramentas como CVS:
sv: JHBuild använder en kommandoradssyntax i stil med verktyg som CVS:

source: The global JHBuild options are:
pt_br: As opções globais do JHBuild são:
sv: De globala JHBuild-flaggorna är:

source: ``-f``, ``--file`` <config>
sv: ``-f``, ``--file`` <konfiguration>

source: Use an alternative configuration file instead of the default ``~/.config/jhbuildrc``.
pt_br: Usa um arquivo de configuração alternativo em vez do padrão ``~/.config/jhbuildrc``.
sv: Använd en alternativ konfigurationsfil i stället för standardvärdet ``~/.config/jhbuildrc``.

source: ``-m``, ``--moduleset`` <moduleset>
pt_br: ``-m``, ``--moduleset`` <coleção_de_módulos>
sv: ``-m``, ``--moduleset`` <moduluppsättning>

source: Use a module set other than the module set listed in the configuration file. This option can be a relative path if the module set is located in the JHBuild moduleset folder, or an absolute path if located elsewhere.
pt_br: Usa uma coleção de módulos que não aquela listada no arquivo de configuração. Esta opção pode ser um caminho relativo, se a coleção de módulo estiver localizada na pasta da coleação de módulo do JHBuild, ou um caminho absoluto, se localizado em outro lugar.
sv: Använd en annan moduluppsättning än den moduluppsättning som listas i konfigurationsfilen. Denna flagga kan vara en relativ sökväg om moduluppsättningen finns i JHBuilds moduluppsättningsmapp eller en absolut sökväg om den finns någon annanstans.

source: Do not prompt the user for any input. This option is useful if leaving a build unattended, in order to ensure the build is not interrupted.
pt_br: Não solicita interação do usuário. Esta opção é útil para deixar uma compilação funcionando sozinha, de forma a assegurar que a compilação não seja interrompida.
sv: Fråga inte användaren om något. Denna flagga är användbar om du lämnar ett bygge obevakat, för att säkerställa att bygget inte avbryts.

source: Exit immediately if a module fails to build. This option is primarily useful in noninteractive mode, in order to ensure jhbuild does not continue to build any additional modules.
pt_br: Sai imediatamente se um módulo falhar na compilação. Esta opção é útil principalmente no modo não interativo, de forma a garantir que o jhbuild não continue a compilar qualquer módulo adicional.
sv: Avsluta omedelbart efter att en modul misslyckas med att bygga. Denna flagga är i första hand användbar i icke-interaktivt läge för att säkerställa att jhbuild inte fortsätter att bygga ytterligare moduler.

source: Modify the condition flags to be different than those determined on the basis of the OS and those specified in jhbuildrc. Modifications are specified like ``-wayland`` or ``+docs`` in order to remove or add conditions. Multiple modifications can be separated by a comma like ``--conditions=+docs,-wayland`` or you can split them across multiple ``--conditions`` arguments.
pt_br: Modifica as opções de condição para serem diferentes daquelas determinadas na base do SO e daquelas especificadas no jhbuildrc. Modificações são especificadas como ``-wayland`` ou ``+docs`` com a finalidade de remover ou adicionar condições. Modificações múltiplas podem ser separadas por uma vírgula (e.g.: ``--conditions=+docs,-wayland``) ou você pode dividi-las por múltiplos argumentos de ``--conditions``.
sv: Modifiera villkorsflaggorna till att vara andra än de som bestämts baserat på OS och de som angetts i jhbuildrc. Modifieringar anges som ``-wayland`` eller ``+docs`` för att ta bort eller lägga till villkor. Flera modifieringar kan separeras med ett komma i stil med ``--conditions=+docs,-wayland`` eller så kan du dela upp dem i flera ``--conditions``-argument.

source: Additionally, JHBuild checks the presence, and value, of the following environment variables:
pt_br: Adicionalmente, JHBuild verifica a presença, e valor, das seguintes variáveis de ambiente:
sv: Dessutom kontrollerar JHBuild närvaron av och värdet på följande miljövariabler:

source: By default, JHBuild does not run when using the root user, to avoid destructive operations that may affect the whole system. In certain cases, though, it's acceptable to run JHBuild as root; for instance, inside a container, or in a continuous integration environment. Exporting the :envvar:`JHBUILD_RUN_AS_ROOT` will disable the user id check at startup.
pt_br: Por padrão, JHBuild não executa quando usando o usuário root, para evitar operações destrutivas que podem afetar o sistema como um todo. Em certos casos, porém, é aceitável executar JHBuild como root; por exemplo, dentro de um contêiner ou em um ambiente de integração contínua. Exportar a :envvar:`JHBUILD_RUN_AS_ROOT` vai desabilitar a verificação de id de usuário na inicialização.
sv: Som standard körs JHBuild inte när root-användaren används, för att undvika destruktiva åtgärder som kan påverka hela systemet. I vissa fall är det dock acceptabelt att köra JHBuild som root; exempelvis i en behållare eller i en kontinuerlig integrationsmiljö. Att exportera miljövariabeln :envvar:`JHBUILD_RUN_AS_ROOT` kommer att inaktivera kontrollen av användar-ID vid uppstart.

source: Command specific options are listed below.
pt_br: Opções específicas de comandos são listadas abaixo.
sv: Kommandospecifika flaggor listas nedan.

source: The ``autobuild`` command automatically builds the modules as specified in the configuration file, and then upload the results to JhAutobuild.
pt_br: O comando ``autobuild`` compila automaticamente os módulos especificados no arquivo de configuração e, então, envia os resultados para JhAutobuild.
sv: Kommandot ``autobuild`` bygger automatiskt modulerna så som de angetts i konfigurationsfilen och skickar sedan upp resultaten till JhAutobuild.

source: The ``--autogen``, ``--clean``, ``--distcheck``, ``--skip`` and ``--start-at`` options are processed as per the :ref:`build` command.
pt_br: As opções ``--autogen``, ``--clean``, ``--distcheck``, ``--skip`` e ``--start-at`` são processadas conforme o comando :ref:`build`.
sv: Flaggorna ``--autogen``, ``--clean``, ``--distcheck``, ``--skip`` och ``--start-at`` behandlas på samma sätt som för kommandot :ref:`build`.

source: ``--report-url=reporturl``, ``-r reporturl``
sv: ``--report-url=rapport-url``, ``-r rapport-url``

source: This option specifies the JhAutobuild URL to report to.
pt_br: Esta opção especifica a URL do JhAutobuild para a qual deve relatar.
sv: Denna flagga anger JhAutobuild-URL:en att rapportera till.

source: If specified, JHBuild's output will be more verbose.
pt_br: Se especificada, a saída do JHBuild será mais detalhada.
sv: Om angiven kommer JHBuilds utmatning att vara utförligare.

source: The ``bootstrap`` command installs a set of build utilities. The build utilities include autoconf, automake and similar utilities. The recommended method to install the build utilities is via your distribution's package management system. The ``bootstrap`` should only be used if the build utilities are not provided by your distribution's package management system, for example on ``Mac OS``.
pt_br: O comando ``bootstrap`` instala uma coleção de utilitários de compilação. Os utilitários de compilação incluem autoconf, automake e utilitários similares. O método recomendado para instalar os utilitários de compilação é via sistema de gerenciamento de pacotes da distribuição. O ``bootstrap`` deve ser usado apenas se os utilitários de compilação não forem fornecidos pelo sistema de gerenciamento de pacotes da distribuição, por exemplo no ``Mac OS``.
sv: Kommandot ``bootstrap`` installerar en uppsättning av byggverktyg. Byggverktygen inkluderar autoconf, automake och liknande verktyg. Den rekommenderade metoden att installera byggverktygen är via din distributions pakethanteringssystem. ``bootstrap`` bör bara användas om byggverktygen inte tillhandahålls av din distributions pakethanteringssystem, till exempel på ``Mac OS``.

source: jhbuild bootstrap The ``bootstrap`` command builds modules using the same method as the ``build`` command, but uses the ``bootstrap.modules`` moduleset.
pt_br: O comando ``bootstrap`` compila usando o mesmo método que o comando ``build``, mas usa a coleção de módulos ``bootstrap.modules``.
sv: jhbuild bootstrap Kommandot ``bootstrap`` bygger moduler via samma metod som kommandot ``build`` men använder moduluppsättningen ``bootstrap.modules``.

source: See the :ref:`build` command documentation for available options.
pt_br: Veja a documentação do comando :ref:`build` por opções disponíveis.
sv: Se kommandodokumentationen för :ref:`build` för tillgängliga flaggor.

source: The ``build`` command builds one or more packages, including their dependencies.
pt_br: O comando ``build`` compila um ou mais pacotes, incluindo suas dependências.
sv: Kommandot ``build`` bygger ett eller flera paket samt deras beroenden.

source: jhbuild build [--autogen] [--clean] [--check] [--dist] [--distcheck] [--distclean] [--ignore-suggests] [--no-network] [--skip=module...] [--start-at=module] [--tags=tags] [-D date] [--no-xvfb] [--try-checkout] [--no-poison] [--force] [--build-optional-modules] [--min-age=time] [--nodeps] [module...]
pt_br: jhbuild build [--autogen] [--clean] [--check] [--dist] [--distcheck] [--distclean] [--ignore-suggests] [--no-network] [--skip=module...] [--start-at=módulo] [--tags=tags] [-D date] [--no-xvfb] [--try-checkout] [--no-poison] [--force] [--build-optional-modules] [--min-age=time] [--nodeps] [módulo...]
sv: jhbuild build [--autogen] [--clean] [--check] [--dist] [--distcheck] [--distclean] [--ignore-suggests] [--no-network] [--skip=modul…] [--start-at=modul] [--tags=taggar] [-D datum] [--no-xvfb] [--try-checkout] [--no-poison] [--force] [--build-optional-modules] [--min-age=tid] [--nodeps] [modul…]

source: If no module names are provided on the command line, the :ref:`modules` list from the configuration file will be used.
pt_br: Se nenhum nome de módulo for fornecido na linha de comando, a lista :ref:`modules` do arquivo de configuração será usada.
sv: Om inga modulnamn anges på kommandoraden kommer listan :ref:`modules` från konfigurationsfilen att användas.

source: Always run ``autogen.sh`` before building modules.
pt_br: Sempre executa ``autogen.sh`` antes de compilar módulos.
sv: Kör alltid ``autogen.sh`` innan du bygger moduler.

source: Run ``make clean`` before building modules.
pt_br: Executa ``make clean`` antes de compilar módulos.
sv: Kör ``make clean`` innan du bygger moduler.

source: Run ``make check`` after building modules.
pt_br: Executa ``make check`` após compilar módulos.
sv: Kör ``make check`` efter moduler har byggts.

source: Run ``make dist`` after building modules.
pt_br: Executa ``make dist`` após compilar módulos.
sv: Kör ``make dist`` efter moduler har byggts.

source: Run ``make distcheck`` after building modules.
pt_br: Executa ``make distcheck`` após compilar módulos.
sv: Kör ``make distcheck`` efter moduler har byggts.

source: For git modules, run ``git clean -dfx`` before building modules. For other modules, run ``make distclean`` before building modules.
pt_br: Para módulos git, executa ``git clean -dfx`` antes de compilar módulos. Para os demais, executa ``make distclean`` antes de compilar módulos.
sv: För git-moduler, kör ``git clean -dfx`` innan du bygger modulerna. För andra moduler, kör ``make distclean`` innan du bygger modulerna.

source: This option will delete any uncommitted changes.
pt_br: Esta opção vai excluir quaisquer alterações que não tiverem commit.
sv: Denna flagga kommer att ta bort alla ändringar som inte checkats in.

source: Do not build soft dependencies.
pt_br: Não compila dependências adicionais.
sv: Bygg inte mjuka beroenden.

source: Do not access the network when building modules. This will skip download or update stages in a build. If a module can't be built without network access, the module build will fail.
pt_br: Não acessa a rede ao compilar módulos. Isso vai pular os estágios de baixar e atualizar em uma compilação. Se um módulo não puder ser compilado sem acessar a rede, a compilação do módulo vai falhar.
sv: Använd inte nätverket när moduler byggs. Detta kommer att hoppa över hämtning eller uppdateringsstegen i ett bygge. Om en modul inte kan byggas utan nätverksåtkomst kommer bygget av modulen att misslyckas.

source: ``-s``, ``--skip``\ =<module,...>
pt_br: ``-s``, ``--skip``\ =<módulo,...>
sv: ``-s``, ``--skip``\ =<modul,…>

source: Do not build the listed modules. Used to skip the building of specified dependencies.
pt_br: Não compila os módulos listados. Usada para pular a compilação das dependências especificadas.
sv: Bygg inte de listade modulerna. Används för att hoppa över att bygga specifika beroenden.

source: ``--tags``\ =<tag,...>
sv: ``--tags``\ =<tagg,…>

source: Ignore modules that do not match <tag>. Modules are automatically attributed a tag matching the name of the module's module set.
pt_br: Ignora módulos que não correspondam à <tag>. Os módulos são atribuídos automaticamente a uma tag correspondente ao nome da coleção de módulos do módulo.
sv: Ignorera moduler som inte matchar <tagg>. Moduler får automatiskt en tagg som matchar namnet på modulens moduluppsättning.

source: ``-t``, ``--start-at``\ =<module>
pt_br: ``-t``, ``--start-at``\ =<módulo>
sv: ``-t``, ``--start-at``\ =<modul>

source: Start at the named module rather than at the beginning of the list. This option is useful if the build was interrupted.
pt_br: Inicia no módulo informado, ao invés do primeiro da lista. Esta opção é útil se a compilação foi interrompida.
sv: Börja med den namngivna modulen snarare än i början av listan. Denna flagga är användbar om bygget avbröts.

source: ``-D`` <date>
pt_br: ``-D`` <data>
sv: ``-D`` <datum>

source: If supported by the underlying version control system, update the source tree to the specified date before building. An ISO date format is required, e.g. ``"2009-09-18 02:32Z"``.
pt_br: Se houver suporte pelo sistema de controle de versão em questão, atualiza a árvore de fonte para a data especificada antes de compilar. É necessário um formato de data ISO e.g. ``"2009-09-18 02:32Z"``.
sv: Om det stöds av det underliggande versionshanteringssystemet, uppdatera källkodsträdet till det angivna datumet innan bygget startar. ISO-datumformat krävs, t.ex. ``"2009-09-18 02:32Z"``.

source: Run graphical tests on the actual X server rather than in a simulated Xvfb.
pt_br: Executa testes gráficos no servidor X atual, em vez de em um Xvfb simulado.
sv: Kör grafiska tester på den riktiga X-servern snarare än i en simulerad Xvfb.

source: If the build fails, and if supported by the version control system, force a checkout and run ``autogen.sh`` before retrying the build.
pt_br: Se a compilação falhar, e se houver suporte pelo sistema de controle de versão, força um checkout e executa ``autogen.sh`` antes de tentar compilar novamente.
sv: Om bygget misslyckas och om det stöds av versionshanteringssystemet, tvinga en utcheckning och kör ``autogen.sh`` innan du försöker bygga igen.

source: If one or more of a module's dependencies failed, this option forces JHBuild to try to build the module anyway.
pt_br: Se uma ou mais dependências de um módulo falhar, esta opção força o JHBuild a tentar compilar o módulo mesmo assim.
sv: Om en eller flera av en moduls beroenden misslyckas, tvingar denna flagga JHBuild att försöka bygga modulen ändå.

source: Build the modules even if policy states it is not required.
pt_br: Compila os módulos mesmo se a política define que não é necessário.
sv: Bygg modulerna även om policyn säger att det inte krävs.

source: Modules listed as optional dependencies, may not be required to build the module. This option forces JHBuild to build optional dependencies.
pt_br: Módulos listados como dependências opcionais podem não ser necessários para compilação do módulo. Esta opção força o JHBuild a compilar essas dependências opcionais.
sv: Moduler listade som valfria beroenden, kanske inte behövs för att bygga modulen. Denna flagga tvingar JHBuild att bygga valfria beroenden.

source: ``--min-age``\ =<time>
pt_br: ``--min-age``\ =<tempo>
sv: ``--min-age``\ =<tid>

source: Skip modules installed more recently than the specified relative time. The <time> string format is a number followed by a unit. The following units are supported: seconds (s), minutes (m), hours (h) and days (d). For example, ``--min-age=2h`` will skip modules built less than two hours ago.
pt_br: Pula os módulos instalados mais recentemente do que o tempo especificado. O formato do <time> é um número seguido por uma unidade. Há suporte às seguintes unidades: segundos (s), minutos (m), horas (h) e dias (d). Por exemplo, ``--min-age=2h`` vai ignorar módulos compilados a duas horas atrás.
sv: Hoppa över moduler som installerats senare än det angivna relativa datumet. Strängformatet för <tid> är ett tal åtföljt av en enhet. Följande enheter stöds: sekunder (s), minuter (m), timmar (h) och dagar (d). Till exempel kommer ``--min-age=2h`` att hoppa över moduler som byggts de senaste två timmarna.

source: Ignore missing system dependencies. To ignore a single system dependency add the module to ```skip`` <#cfg-skip>`__.
pt_br: Ignora dependências do sistema em falta. Para ignorar uma única dependência do sistema, adicione o módulo a ```skip`` <#cfg-skip>`__.
sv: Hoppa över saknade systemberoenden. För att ignorera ett enstaka systemberoende lägg till modulen i ```skip`` <#cfg-skip>`__.

source: The ``make`` command is for actively developing on a particular module. It requires the current directory be a source checkout, and does the equivalent of ``buildone -nf $(basename $(pwd))``.
pt_br: O comando ``make`` é para desenvolvimento ativo em um módulo em particular. Ele requer que o diretório atual seja um checkout do código fonte e não equivalente a ``buildone -nf $(basename $(pwd))``.
sv: Kommandot ``make`` används för att aktivt utveckla i en viss modul. Det kräver att den aktuella katalogen innehåller utcheckad källkod och gör detsamma som ``buildone -nf $(basename $(pwd))``.

source: The options are the same as those available for the :ref:`buildone` command.
pt_br: As opções são as mesmas disponíveis para o comando :ref:`buildone`.
sv: Flaggorna är de samma som de som finns tillgängliga för kommandot :ref:`buildone`.

source: The ``buildone`` command is similar to ``build``, but it does not build the dependent modules. It is useful for rebuilding one or more modules.
pt_br: O comando ``buildone`` é similar ao ``build``, mas ele não compila os módulos dependentes. Isso é útil para recompilar um ou mais módulos.
sv: Kommandot ``buildone`` liknar ``build`` men det bygger inte modulberoenden. Det är användbart för att bygga om en eller flera moduler.

source: The ``--autogen``, ``--check``, ``--clean``, ``-d``, ``--distcheck``, ``--distclean``, ``--no-network``, ``-D``, ``-x`` and ``--nodeps`` options are processed as per the :ref:`build` command.
pt_br: As opções ``--autogen``, ``--check``, ``--clean``, ``-d``, ``--distcheck``, ``--distclean``, ``--no-network``, ``-D``, ``-x`` e ``--nodeps`` são processadas conforme o comando :ref:`build`.
sv: Flaggorna ``--autogen``, ``--check``, ``--clean``, ``-d``, ``--distcheck``, ``--distclean``, ``--no-network``, ``-D``, ``-x`` och ``--nodeps`` behandlas på samma sätt som för kommandot :ref:`build`.

source: At least one module must be listed on the command line.
pt_br: Pelo menos um módulo deve estar listado na linha de comando.
sv: Åtminstone en modul måste listas på kommandoraden.

source: The ``checkbranches`` checks the module's branches are defined correctly within the version control system and the branches are consistent with the module set.
pt_br: O ``checkbranches`` verifica se os ramos (branches) dos módulos estão definidos corretamente no sistema de controle de versão e se estão consistentes com a coleção de módulos.
sv: ``checkbranches`` kontrollerar att modulens grenar är korrekt definierade i versionshanteringssystemet och att grenarna stämmer överens med moduluppsättningen.

source: ``--branch``\ =<branch>, ``-b`` <branch>
sv: ``--branch``\ =<gren>, ``-b`` <gren>

source: The branch to check.
pt_br: O ramo a ser verificado.
sv: Grenen som ska kontrolleras.

source: The ``clean`` command cleans the build directories of one or more modules.
pt_br: O comando ``clean`` limpa os diretórios de compilação de um ou mais módulos.
sv: Kommandot ``clean`` tömmer byggkatalogerna för en eller flera moduler.

source: See the :ref:`build` command documentation for a description of available options.
pt_br: Veja a documentação do comando :ref:`build` para uma descrição das opções disponíveis.
sv: Se kommandodokumentationen för :ref:`build` för en beskrivning över tillgängliga flaggor.

source: The ``dot`` command generates a file describing the directed graph formed by the dependencies between a set of modules. This file can then be processed using the `GraphViz <http://www.graphviz.org/>`__ software to produce a diagram.
pt_br: O comando ``dot`` gera um arquivo descrevendo o gráfico direcionado criado pelas dependências entre uma coleção de módulos. Este arquivo pode ser, então, processado usando o software `GraphViz <http://www.graphviz.org/>`__ para produzir um diagrama.
sv: Kommandot ``dot`` genererar en fil som beskriver den riktade grafen över beroenden mellan en uppsättning av moduler. Denna fil kan sedan behandlas av programvaran `GraphViz <http://www.graphviz.org/>`__ för att producera ett diagram.

source: If no module names are provided on the command line, the `modules <#cfg-modules>`__ list from the configuration file will be used.
pt_br: Se nenhum nome de módulo for fornecido na linha de comando, a lista de `módulos <#cfg-modules>`__ do arquivo de configuração será usada.
sv: Om inga modulnamn anges på kommandoraden kommer listan `modules <#cfg-modules>`__ från konfigurationsfilen att användas.

source: The ``--soft-deps`` option adds dotted lines from the modules to the soft dependencies. The ``--clusters`` option groups modules from :ref:`metamodule`'s together.
pt_br: A opção ``--soft-deps`` adiciona linhas pontilhadas dos módulos para as suas dependências. A opção ``--clusters`` agrupa módulos de :ref:`metamodule`.
sv: Flaggan ``--soft-deps`` lägger till streckade linjer från modulerna till de mjuka beroendena. Flaggan ``--clusters`` grupperar moduler från olika :ref:`metamodule` tillsammans.

source: The output of the dot command can be piped to the dot utility to generate a PostScript file:
pt_br: A saída do comando dot pode ser direcionada para o utilitário dot para gerar um arquivo PostScript:
sv: Utdata från dot-kommandot kan skickas vidare till dot-verktyget för att generera en PostScript-fil:

source: Or a PNG image:
pt_br: Ou uma imagem PNG:
sv: Eller en PNG-bild:

source: Sample JHBuild dot output
pt_br: Exemplo de saída do dot do JHBuild
sv: Exempelutmatning från JHBuild dot

source: The ``gui`` command starts a graphical interface to JHBuild which can be used to select modules to build and change some options.
pt_br: O comando ``gui`` inicia uma interface gráfica do JHBuild que pode ser usada para selecionar módulos para compilar e alterar algumas opções.
sv: Kommandot ``gui`` startar ett grafiskt gränssnitt för JHBuild som kan användas för att välja moduler att bygga och ändra ett antal inställningar.

source: The graphical interface is rendered using GTK, so extra support libraries are required.
pt_br: A interface gráfica é renderizada usando GTK, de forma que bibliotecas extras de suporte são necessárias.
sv: Det grafiska gränssnittet renderas med hjälp av GTK så extra stödbibliotek krävs.
