Repository: GNOME/jhbuild
Catalog: doc/po/*/LC_MESSAGES/docs.po
Languages: pt_br, sv

source: To download or update all the software sources without building, use the ``update`` command. The ``update`` command provides an opportunity to modify the sources before building and can be useful if internet bandwidth varies.
pt_br: Para baixar ou atualizar os fontes de softwares sem compilá-los, use o comando ``update``. O comando ``update`` fornece uma oportunidade para modificar os fontes antes de compilar e pode ser útil se a conexão com a Internet ficar variando.
sv: För att hämta eller uppdatera all programvarukällkod utan att bygga, använd kommandot ``update``. Kommandot ``update`` erbjuder en möjlighet att modifiera källkoden innan den byggs och kan vara användbart om bandbredden till internet varierar.

source: Later, JHBuild can build everything without downloading or updating the sources:
pt_br: Posteriormente, JHBuild pode compilar tudo sem baixar ou atualizar os fontes:
sv: Senare kan JHBuild bygga allting utan att hämta ner eller uppdatera källkoden:

source: To run a particular command with the same environment used by JHBuild, use the ``run`` command:
pt_br: Para executar um comando em particular com o mesmo ambiente usado pelo JHBuild, use o comando ``run``:
sv: För att köra ett särskilt kommando med samma miljö som används av JHBuild, använd kommandot ``run``:

source: To start a shell with the same environment used by JHBuild, use the ``shell`` command:
pt_br: Para iniciar um shell com o mesmo ambiente usado pelo JHBuild, use o comando ``shell``:
sv: För att starta ett skal med samma miljö som används av JHBuild, använd kommandot ``shell``:

source: JHBuild Manual
pt_br: Manual do JHBuild
sv: Handbok för JHBuild

source: Introduction
pt_br: Introdução
sv: Introduktion

source: JHBuild is a tool designed to ease building collections of source packages, called “modules”. JHBuild uses “module set” files to describe the modules available to build. The “module set” files include dependency information that allows JHBuild to discover what modules need to be built and in what order.
pt_br: JHBuild é uma ferramenta projetada para facilitar a compilação de coleções de pacotes fontes, chamados de “módulos”. JHBuild usa arquivos de “coleção de módulos”, ou module sets, para descrever os módulos disponíveis para compilação. Os arquivos de “coleção de módulos” incluem informações de dependências que permite ao JHBuild descobrir que módulos são necessários para compilar e em que ordem.
sv: JHBuild är ett verktyg designat för att förenkla byggande av samlingar av källpaket, kallade ”moduler”. JHBuild använder ”moduluppsättnings”-filer för att beskriva modulerna som finns tillgängliga att bygga. ”Moduluppsättnings”-filer inkluderar beroendeinformation som låter JHBuild upptäcka vilka moduler som måste byggas och i vilken ordning.

source: JHBuild was originally written for building `GNOME <http://www.gnome.org>`__, but has since been extended to be usable with other projects. A “module set” file can be hosted on a web server, allowing for build rules independent of the JHBuild project.
pt_br: JHBuild foi escrito originalmente para compilar o `GNOME <http://www.gnome.org>`__, mas ele tem sido estendido para ser usável com outros projetos. Um arquivo de “coleção de módulos” pode ser hospedado em um servidor web, permitindo regras de compilação independente do projeto do JHBuild.
sv: JHBuild skrevs från början för att bygga `GNOME <http://www.gnome.org>`__, men har sedan dess blivit utökat för att vara användbart för andra projekt. En ”moduluppsättnings”-fil kan sparas på en webbserver vilket låter byggregler vara oberoende av JHBuild-projektet.

source: JHBuild can build modules from a variety of sources, including `CVS <http://www.cvshome.org/>`__, `Subversion <http://subversion.tigris.org/>`__, `Bazaar <http://www.bazaar-vcs.org/>`__, `Darcs <http://darcs.net/>`__, `Git <http://git.or.cz/>`__ and `Mercurial <http://www.selenic.com/mercurial/>`__ repositories, as well as Tar and Zip archives hosted on web or FTP sites. JHBuild can build modules using a variety of build systems, including Autotools, CMake, Meson, WAF, Python Distutils and Perl Makefiles.
pt_br: JHBuild pode compilar módulos de uma variedade de fontes, incluindo repositórios `CVS <http://www.cvshome.org/>`__, `Subversion <http://subversion.tigris.org/>`__, `Bazaar <http://www.bazaar-vcs.org/>`__, `Darcs <http://darcs.net/>`__, `Git <http://git.or.cz/>`__ e `Mercurial <http://www.selenic.com/mercurial/>`__, assim como arquivos Tar e Zip hospedados em sites web ou FTP. JHBuild pode compilar módulos usando uma variedade de sistemas de compilação, incluindo Makefiles de Autotools, CMake, Meson, WAF, Python Distutils e Perl.
sv: JHBuild kan bygga moduler från en uppsjö av källor, inklusive `CVS- <http://www.cvshome.org/>`__, `Subversion- <http://subversion.tigris.org/>`__, `Bazaar- <http://www.bazaar-vcs.org/>`__, `Darcs- <http://darcs.net/>`__, `Git- <http://git.or.cz/>`__ och `Mercurial <http://www.selenic.com/mercurial/>`__-arkiv, såväl som Tar- och Zip-arkiv från webb- eller FTP-platser. JHBuild kan bygga moduler via ett antal byggsystem, inklusive Autotools-, CMake-, Meson-, WAF-, Python Distutils- och Perl-Makefiler.

source: JHBuild is not intended as a replacement for the distribution's package management system. Instead, it makes it easy to build software into a separate install prefix without interfering with the rest of the system.
pt_br: JHBuild não tem a intenção de ser uma substituição dos sistemas de gerenciamento de pacotes das distribuições. Em vez disso, ele torna mais fácil compilar software em um prefixo de instalação separado sem interferir no resto do sistema.
sv: JHBuild är inte avsett att vara en ersättare för distributionens pakethanteringssystem. Det gör det i stället enkelt att bygga programvara för ett separat installationsprefix utan att interferera med resten av systemet.

source: JHBuild and GNOME
pt_br: JHBuild e GNOME
sv: JHBuild och GNOME

source: This section provides guidance on building, installing and running GNOME.
pt_br: Esta seção fornece um guia em compilação, instalação e execução do GNOME.
sv: Detta avsnitt tillhandahåller guidning om hur man bygger, installerar och kör GNOME.

source: Building GNOME
pt_br: Compilando GNOME
sv: Bygga GNOME

source: To build GNOME some development packages are required. This includes:
pt_br: Para compilar o GNOME, são necessários pacotes de desenvolvimento. Isso inclui:
sv: För att bygga GNOME krävs ett antal utvecklingspaket. Detta inkluderar:

source: DocBook XML DTD and XSLT stylesheets. These need to be registered in the XML catalog (``/etc/xml/catalog``).
pt_br: DocBook XML DTD e folhas de estilos XSLT. Estas precisam estar registradas no catálogo XML (``/etc/xml/catalog``).
sv: DocBook XML DTD och XSLT-stilmallar. Detta måste registreras i XML-katalogen (``/etc/xml/catalog``).

source: X libraries.
pt_br: Bibliotecas X.
sv: X-bibliotek.

source: ``libsmbclient`` from Samba (used for browsing Windows networks).
pt_br: ``libsmbclient`` do Samba (usado para navegar por redes Windows).
sv: ``libsmbclient`` från Samba (används för att bläddra i Windows-nätverk).

source: ``libbz2`` from bzip2.
pt_br: ``libbz2`` do bzip2.
sv: ``libbz2`` från bzip2.

source: ``libpng``, ``libjpeg`` and ``libtiff`` (used for image loading).
pt_br: ``libpng``, ``libjpeg`` e ``libtiff`` (usados para carregar imagem).
sv: ``libpng``, ``libjpeg`` och ``libtiff`` (använda för bildinläsning).

source: If installing distribution packages, and if applicable for your distribution, install the corresponding “dev” or “devel” packages. A list of `package names <http://live.gnome.org/JhbuildDependencies>`__ for different distributions is maintained on the GNOME wiki.
pt_br: Se instalando pacotes de distribuição, e se aplicável a sua distribuição, instale os pacotes “dev” ou “devel” correspondentes. Uma lista de `nomes de pacotes <http://live.gnome.org/JhbuildDependencies>`__ de diferentes distribuições é mantida no wiki do GNOME.
sv: Om du ska installera distributionspaket och om det gäller för din distribution, installera motsvarande ”dev”- eller ”devel”-paket. En lista över `paketnamn <http://live.gnome.org/JhbuildDependencies>`__ för olika distributioner underhålls på GNOMEs wiki.

source: Running a Single GNOME Application
pt_br: Executando um único aplicativo do GNOME
sv: Kör ett enstaka GNOME-program

source: This section details how to run a single GNOME application. The application will run within the current desktop environment. To run the application within the complete JHBuild GNOME see `Running the GNOME Desktop Environment <#running-gnome>`__.
pt_br: Esta seção detalha como executar um único aplicativo do GNOME. O aplicativo vai executar dentro do ambiente atual. Para executar o aplicativo dentro do GNOME do JHBuild veja `Executando o ambiente GNOME <#running-gnome>`__.
sv: Detta avsnitt beskriver detaljerat hur du kör ett enstaka GNOME-program. Programmet kommer att köras i den aktuella skrivbordsmiljön. För att köra programmet i det fullständiga JHBuild-byggda GNOME se `Köra GNOME-skrivbordsmiljön <#running-gnome>`__.

source: Launch a JHBuild shell. The JHBuild shell has all the necessary environment variables set.
pt_br: Abra um shell do JHBuild. O shell do JHBuild tem todas as variáveis de ambiente necessárias definidas.
sv: Starta ett JHBuild-skal. JHBuild-skalet har alla de nödvändiga miljövariablerna inställda.

source: Verify the correct application will be run. For example:
pt_br: Verifique o aplicativo correto que será executado. Por exemplo:
sv: Bekräfta att rätt program kommer köras. Till exempel:

source: Run the application:
pt_br: Execute o aplicativo:
sv: Kör programmet:

source: Alternatively, run the application using the ``run`` command:
pt_br: Alternativamente, execute o aplicativo usando o comando ``run``:
sv: Kör alternativt programmet med ``run``-kommandot:

source: Running the GNOME Desktop Environment
pt_br: Executando o ambiente GNOME
sv: Köra GNOME-skrivbordsmiljön

source: Create a new user account to run the JHBuild GNOME. Running JHBuild GNOME using a different user account is recommended to avoid problems caused by user settings stored in the home directory. This manual refers to the new account as ``gnomedev``.
pt_br: Crie uma nova conta de usuário para executar o GNOME do JHBuild. Executar o GNOME do JHBuild usando uma conta de usuário diferente é recomendado para evitar problemas causados pelas configurações de usuário armazenadas na pasta pessoal. Este manual chama esta nova conta de usuário de ``gnomedev``.
sv: Skapa ett nytt användarkonto för att köra det JHBuild-byggda GNOME. Att köra JHBuilds GNOME som ett annat användarkonto rekommenderas för att undvika problem som orsakas av att användarinställningarna sparas i hemkatalogen. Denna handbok refererar till det nya kontot som ``gnomedev``.

source: Setup JHBuild on the new ``gnomedev`` account. Copy or soft-link ``~/.config/jhbuildrc`` and ``~/.local/bin/jhbuild`` to ``gnomedev`` home directory.
pt_br: Configure o JHBuild na nova conta ``gnomedev``. Copie ou crie um link simbólico de ``~/.config/jhbuildrc`` e ``~/.local/bin/jhbuild`` para a pasta pessoal do ``gnomedev``.
sv: Ställ in JHBuild för det nya ``gnomedev``-kontot. Kopiera eller mjuklänka ``~/.config/jhbuildrc`` och ``~/.local/bin/jhbuild`` till hemkatalogen för ``gnomedev``.

source: Open a terminal as the user ``gnomedev``. Permanently add ``~/.local/bin`` to the ``PATH`` variable, run the following command:
pt_br: Abra um terminal como o usuário ``gnomedev``. Adicione permanentemente ``~/.local/bin`` para a variável ``PATH``, execute o seguinte comando:
sv: Öppna en terminal som användaren ``gnomedev``. För att permanent lägga till ``~/.local/bin`` till ``PATH``-variabeln, kör följande kommando:

source: Test JHBuild works:
pt_br: Teste se o JHBuild funciona:
sv: Testa att JHBuild fungerar:

source: Setup GNOME to run from the display manager
pt_br: Configurando o GNOME para executar do gerenciador de exibição
sv: Ställ in GNOME att köra från displayhanteraren

source: Build and install JHBuild GNOME.
pt_br: Compile e instale o GNOME do JHBuild.
sv: Bygg och installera GNOME med JHBuild.

source: Enable system services. JHBuild GNOME will use the ``/usr/bin`` system D-Bus daemon and the system services within ``/usr/share/dbus-1/system-services/``. JHBuild GNOME will use the JHBuild session D-Bus daemon and the services within ``~/jhbuild/install//share/dbus-1/services/``. Replace ``~/jhbuild/install`` with GNOME install ``prefix`` in the command below:
pt_br: Habilite os sistemas de serviço. O GNOME do JHBuild vai usar o daemon do D-Bus do sistema em ``/usr/bin`` e os sistemas de serviços dentro de ``/usr/share/dbus-1/system-services/``. O GNOME do JHBuild vai usar o daemon do D-Bus da sessão do JHBuild e os serviços dentro de ``~/jhbuild/install//share/dbus-1/services/``. Substitua ``~/jhbuild/install`` com o prefixo ``prefix`` de instalação do GNOME no comando abaixo:
sv: Aktivera systemtjänster. JHBuilds GNOME kommer att använda systemets D-Bus-demon i ``/usr/bin`` och systemtjänsterna i ``/usr/share/dbus-1/system-services/``. JHBuilds GNOME kommer att använda JHBuild-sessionens D-Bus-demon och tjänsterna i ``~/jhbuild/install//share/dbus-1/services/``. Ersätt ``~/jhbuild/install`` med ``prefix`` för GNOME-installationen i kommandot nedan:

source: Create a GNOME startup script at ``/usr/bin/gnome-jhbuild-session`` with the following, replacing ``~/jhbuild/install`` with GNOME install ``prefix``:
pt_br: Crie um script de inicialização do GNOME em ``/usr/bin/gnome-jhbuild-session`` com o seguinte, substituindo ``~/jhbuild/install`` com o GNOME install ``prefix``:
sv: Skapa ett GNOME-startskript i ``/usr/bin/gnome-jhbuild-session`` med följande, ersätt ``~/jhbuild/install`` med ``prefix`` för GNOME-installationen:

source: Make the file ``/usr/bin/gnome-jhbuild-session`` executable:
pt_br: Torne o arquivo ``/usr/bin/gnome-jhbuild-session`` um executável:
sv: Gör filen ``/usr/bin/gnome-jhbuild-session`` körbar:

source: To add a new session entry in the display manager, create ``/usr/share/xsessions/gnome-jhbuild.desktop`` and enter:
pt_br: Para adicionar uma nova entrada de sessão no gerenciador de exibição, crie ``/usr/share/xsessions/gnome-jhbuild.desktop`` e digite:
sv: För att lägga till en ny sessionspost i displayhanteraren, skapa ``/usr/share/xsessions/gnome-jhbuild.desktop`` och mata in:

source: Restart ``gdm``.
pt_br: Reinicie ``gdm``.
sv: Starta om ``gdm``.

source: Running GNOME from the display manager
pt_br: Executando o GNOME do gerenciador de exibição
sv: Köra GNOME från displayhanteraren

source: To run the JHBuild GNOME, select the GNOME (JHBuild) session at the display manager before entering ``gnomedev`` login credentials. If successful, JHBuild GNOME will be displayed. If unsuccessful, check the log file. The log file will be located at ``~gnomedev/.cache/gdm/session.log`` or ``~gnomedev/.xsession-errors``.
pt_br: Para executar o GNOME do JHBuild, selecione a sessão do GNOME (JHBuild) no gerenciador de exibição antes de digitar as credenciais do ``gnomedev``. Havendo sucesso, GNOME do JHBuild vai ser exibido. Não havendo sucesso, verifique o arquivo de log. O arquivo de log está localizado no ``~gnomedev/.cache/gdm/session.log`` ou ``~gnomedev/.xsession-errors``.
sv: För att köra JHBuilds GNOME, välj GNOME (JHBuild)-sessionen i displayhanteraren innan du matar in inloggningsuppgifterna för ``gnomedev``. Om det lyckas kommer JHBuilds GNOME att visas. Om det misslyckas, kolla loggfilen. Loggfilen kommer att finnas i ``~gnomedev/.cache/gdm/session.log`` eller ``~gnomedev/.xsession-errors``.

source: Static Analysis
pt_br: Análise estática
sv: Statisk analys

source: JHBuild supports running static analysis tools on the code in modules as they’re built. To enable this, set the ``static_analyzer`` configuration variable to ``True`` in the ``.jhbuildrc`` configuration file.
pt_br: O JHBuild permite executar ferramentas de análise estática no código em módulos na medida em que eles são compilados. Para habilitar isso, defina a variável de configuração ``static_analyzer`` para ``True`` no arquivo de configuração ``.jhbuildrc``.
sv: JHBuild har stöd för att köra statiska analysverktyg för koden i modulerna allt eftersom de byggts. För att aktivera detta, ställ in konfigurationsvariabeln ``static_analyzer`` till ``True`` i konfigurationsfilen ``.jhbuildrc``.

source: If enabled, every time a module is built using JHBuild, the build process will be wrapped in a static analyzer, which will generate a report of any problems it finds with the code. These reports are saved as HTML files in subdirectories of ``/tmp/jhbuild_static_analyzer`` (by default; the path can be changed using the ``static_analyzer_outputdir`` configuration variable).
pt_br: Se habilitado, cada vez que um módulo é compilado usando JHBuild, o processo de compilação vai ser interfaceado em um analisador estático, o qual vai gerar um relatório de quaisquer problemas que ele localizar com o código. Esses relatórios são salvos como arquivos HTML em subdiretórios de ``/tmp/jhbuild_static_analyzer`` (por padrão; o caminho pode ser alterado usando a variável de configuração ``static_analyzer_outputdir``).
sv: Om det är aktiverat kommer, varje gång en modul byggts med JHBuild, byggprocessen att omsvepas i en statisk analysator som kommer att generera en rapport för de problem som den hittar i koden. Dessa rapporter sparas som HTML-filer i underkataloger under ``/tmp/jhbuild_static_analyzer`` (som standard; sökvägen kan ändras via konfigurationsvariabeln ``static_analyzer_outputdir``).

source: Static analysis currently only works for modules which use autotools as their build system. It requires the ``scan-build`` program to be installed, although the command it uses can be changed by modifying the ``static_analyzer_template`` configuration variable.
pt_br: Análise estática atualmente funciona apenas para módulos que usam autotools como sistema de compilação. Ele requer que o programa ``scan-build`` esteja instalado, apesar do comando que ele usa poder ser alterado por meio da variável de configuração ``static_analyzer_template``.
sv: Statisk analys fungerar för närvarande bara för moduler som använder autotools som sitt byggsystem. Det kräver att programmet ``scan-build`` är installerat, men kommandot kan ändras genom att modifiera konfigurationsvariabeln ``static_analyzer_template``.

source: Module Set File Syntax
pt_br: Sintaxe de arquivo de coleção de módulos
sv: Syntax för moduluppsättningsfilen

source: JHBuild uses XML files to describe the dependencies between modules. A RELAX-NG schema and Document Type Definition are included with JHBuild in the ``modulesets/`` directory. The RELAX-NG schema can be used to edit module set files using ``nxml-mode`` in Emacs.
pt_br: JHBuild usa arquivos XML para descrever as dependências entre módulo. Um esquema de RELAX-NG e uma definição de tipo de documento são incluídos ao JHBuild no diretório ``modulesets/``. O esquema de RELAX-NG pode ser usado para editar arquivos de coleção de módulos usando ``nxml-mode`` no Emacs.
sv: JHBuild använder XML-filer för att beskriva beroendena mellan moduler. Ett RELAX-NG-schema och en dokumenttypsdefinition inkluderas med JHBuild i katalogen ``modulesets/``. RELAX-NG-schemat kan användas för att redigera moduluppsättningsfiler via ``nxml-mode`` i Emacs.

source: The top-level element in a module set file is ``moduleset`` element. No XML namespace is used. The elements below the top-level come in three types: module sources, include statements and module definitions.
pt_br: O elemento primário em um arquivo da coleção de módulos é o elemento ``moduleset``. Nenhum espaço de nomes XML é usado. Os elementos embaixo deste vem em três tipos: fontes de módulos, declarações de inclusões (include) e definições de módulo.
sv: Toppnivåelementet i en moduluppsättningsfil är elementet ``moduleset``. Ingen XML-namnrymd används. Elementen under toppnivån finns i tre typer: modulkällor, inkluderingssatser och moduldefinitioner.

source: Content in the moduleset file can be conditionally included by use of the ``<if>`` tag to surround the conditional content. It is currently only possible to predicate the inclusion on whether a particular condition flag is set or not, using ``<if condition-set='cond'>`` or ``<if condition-unset='cond'>``. Conditions are set by default on a per-OS basis but can be influenced by way of the ``conditions`` variable in jhbuildrc or the ``--conditions=`` commandline argument.
pt_br: O conteúdo no arquivo de coleção de módulos pode ser incluído condicionalmente usando a tag ``<if>``; para cobrir o conteúdo condicional. Ele é atualmente possível apenas predicar a inclusão se uma opção de condição em particular estiver definida ou não, usando ``<if condition-set='cond'>``; ou ``<if condition-unset='cond'>``. Condições são definidas por padrão com base no SO, mas pode ser influenciado por meio da variável ``--conditions=`` em jhbuildrc ou o argumento de linha de comando ``--conditions=``.
sv: Innehållet i moduluppsättningsfilen kan inkluderas villkorat genom att använda taggen ``<if>`` för att omge det villkorade innehållet. Det är för närvarande endast möjligt att styra inkluderingen med huruvida en flagga är satt eller ej genom ``<if condition-set='cond'>`` eller ``<if condition-unset='cond'>``. Villkoren sätts som standard per OS-basis men kan påverkas genom att ange variabeln ``conditions`` i jhbuildrc eller kommandoradsargumentet ``--conditions=``.

source: Module Sources
pt_br: Fontes de módulo
sv: Modulkällor

source: Rather than listing the full location of every module, a number of "module sources" are listed in the module set, and then referenced by name in the module definitions. As well as reducing the amount of redundant information in the module set, it makes it easy for a user to specify an alternative source for those modules (for CVS and Subversion, it is common for developers and users to use different repository access methods).
pt_br: Em vez de listar a localidade completa de cada módulo, um número de “fontes de módulo” está listado na coleção de módulos e, então, referenciada pelo nome nas definições de módulo. Além de reduzir a quantidade de informação redundante na coleção de módulos, isso deixa mais fácil para o usuário especificar uma fonte alternativa para aqueles módulos (para CVS e Subversion, é comum para desenvolvedores e usuários usarem diferentes métodos de acesso a repositório).
sv: Snarare än att lista den fullständiga platsen för varje modul listas ett antal ”modulkällor” i moduluppsättningen och de refereras sedan till vid namn i moduldefinitionerna. Detta reducerar mängden redundant information i moduluppsättningen och gör det enklare för en användare att ange en alternativ källa för de modulerna (för CVS och Subversion är det vanligt för utvecklare och användare att använda olika åtkomstmetoder för arkiv).

source: The ``repository`` element is used to describe all types of repository. The ``branch`` element is used inside module definition to specify additional settings.
pt_br: O elemento ``repository`` é usado para descrever todos os tipos de repositórios. O elemento ``branch`` é usado dentro da definição do módulo para especificar configurações adicionais.
sv: Elementet ``repository`` används för att beskriva alla typer av arkiv. Elementet ``branch`` används inuti moduldefinitioner för att ange ytterligare inställningar.

source: The ``name`` attribute is a unique identifier for the repository.
pt_br: O atributo ``name`` é um identificador único do repositório.
sv: Attributet ``name`` är en unik identifierare för arkivet.
