Repository: GNOME/jhbuild
Catalog: doc/po/*/LC_MESSAGES/docs.po
Languages: pt_br, sv

source: The ``default`` attribute specifies whether this repository is the default source for this module set.
pt_br: O atributo ``default`` especifica este repositório no fonte padrão desta coleção de módulos.
sv: Attributet ``default`` anger huruvida detta arkiv är standardkällan för denna moduluppsättning.

source: The ``type`` attribute specifies the type of repository. It can be one of: ``bzr``, ``cvs``, ``darcs``, ``fossil``, ``git``, ``hg``, ``mnt``, ``svn``, ``tarball``. Other attributes depend on the type, as well as the branch used inside module definitions. Those are described below in the repository type sub-sections.
pt_br: O atributo ``type`` especifica o tipo de repositório. Ele pode ser: ``bzr``, ``cvs``, ``darcs``, ``fossil``, ``git``, ``hg``, ``mnt``, ``svn`` ou ``tarball``. Outros atributos dependem do type, além do branch usado dentro das definições de módulo. Aqueles descritos embaixo das subseções de tipos de repositório.
sv: Attributet ``type`` anger arkivtypen. Den kan vara en av: ``bzr``, ``cvs``, ``darcs``, ``fossil``, ``git``, ``hg``, ``mnt``, ``svn``, ``tarball``. Andra attribut beror på typen, såväl som grenen som används i moduldefinitioner. Dessa beskrivs nedan i underkapitlen om arkivtyper.

source: The ``developer-href-example`` attribute is used to specify the format of the URL for the repository used by developers. This is informational only.
pt_br: O atributo ``developer-href-example`` é usado para especificar o formato da URL do repositório usado por desenvolvedores. Serve apenas como informação.
sv: Attributet ``developer-href-example`` används för att ange formatet för URL:en för arkivet som används av utvecklare. Detta är endast för information.

source: The ``branch`` element is used inside module definitions.
pt_br: O elemento ``branch`` é usado dentro das definições de módulo.
sv: Elementet ``branch`` används inuti moduldefinitioner.

source: All attributes have sensible defaults and depend on the module and repository definitions. Common attributes are described here.
pt_br: Todos os atributos possuem padrões sensíveis e dependem das definições do módulo e repositório. Atributos comuns são descritos aqui.
sv: Alla attribut har vettiga standardvärden och beror på modul- och arkivdefinitionerna. Vanliga attribut beskrivs här.

source: The ``repo`` attribute is used to specify non-default repository name.
pt_br: O atributo ``repo`` é usado para especificar um nome de repositório não padronizado.
sv: Attributet ``repo`` används för att ange arkivnamn som inte är standard.

source: The ``module`` attribute is used to specify module name to checkout from the repository. Defaults to module id.
pt_br: O atributo ``module`` é usado para especificar um nome de módulo para baixar do repositório. Padrão é a identificação (id) do módulo.
sv: Attributet ``module`` används för att ange modulnamn som ska checkas ut från arkivet. Standardvärdet är modul-ID:t.

source: The ``checkoutdir`` attribute is used to specify the checkout directory name. Defaults to module id.
pt_br: O atributo ``checkoutdir`` é usado para especificar o nome do diretório no qual será realizado checkout. Padrão é a identificação (id) do módulo.
sv: Attributet ``checkoutdir`` används för att ange katalognamnet där utcheckning ska ske. Standardvärdet är modul-ID:t.

source: Other attributes are described below
pt_br: Outros atributos são descritos abaixo
sv: Andra attribut beskrivs nedan

source: This repository type is used to define a Bazaar repository. It is recommended to have Bazaar 1.16 or higher.
pt_br: Este tipo de repositório é usado para definir um repositório Bazaar. É recomendado ter Bazaar 1.16 ou outra versão mais nova.
sv: Denna arkivtyp används för att definiera Bazaar-arkiv. Det rekommenderas att Bazaar 1.16 eller senare används.

source: Additional attributes are: ``trunk-template`` (defaults to ``"%(module)s"``) and ``branches-template`` (defaults to ``"%(module)s/%(branch)s``"). These attributes are used to specify templates for constructing URL. A ``branch`` element in the module definitions can specify branch and user attributes. These values will be substituted in the templates. If either of those are defined branches-template is used, otherwise trunk-template is used. This way you can override repository to build modules from your personal branch or build many modules from a repository with non-standard layout.
pt_br: São atributos adicionais: ``trunk-template`` (padrão é ``"%(module)s"``) e ``branches-template`` (padrão é ``"%(module)s/%(branch)s``"). Estes atributos são usados para especificar modelos para construção de URL. Um elemento ``branch`` nas definições do módulo pode especificar atributos branch e user. Estes valores serão substituídos nos modelos. Se um deles for definido, branches-template é usado. Do contrário, trunk-template é usado. Desta forma, você pode sobrescrever um repositório para compilar módulos do seu ramo pessoal ou compilar muitos módulos de um repositório com uma disposição não padronizada.
sv: Ytterligare attribut är: ``trunk-template`` (standardvärdet är ``"%(module)s"``) och ``branches-template`` (standardvärdet är ``"%(module)s/%(branch)s``"). Dessa attribut används för att ange mallar för konstruktion av URL:er. Ett ``branch``-element i moduldefinitionen kan ange branch- och user-attribut. Dessa värden kommer att ersättas i mallarna. Om någotdera av dem är definierade används branches-template, annars används trunk-template. På detta sätt kan du åsidosätta arkiven som används för att bygga moduler från din personliga gren eller bygga många moduler från ett arkiv med icke-standardiserad layout.

source: An addition ``branch`` element accepts ``revspec`` attribute to anchor on a particular revision. Any valid ``bzr revspec`` is accepted, for example ``date:yesterday, -5, tag:0.1`` to get first revision since yesterday, 5 commits behind the tip or tag "0.1". See ``bzr help revisionspec`` for all possible values.
pt_br: Um elemento ``branch`` adicional aceita um atributo ``revspec`` para ancorar em uma revisão em particular. Qualquer ``bzr revspec`` válido é aceito. Por exemplo, use ``date:yesterday, -5, tag:0.1`` para obter a primeira revisão a partir de ontem, 5 commits atrás da tip ou tag “0.1”. Veja ``bzr help revisionspec`` para todos os valores possíveis.
sv: Ett extra ``branch``-element accepterar attributet ``revspec`` för att ankra vid en viss revision. Vilken giltig ``bzr revspec`` som helst accepteras, till exempel ``date:yesterday, -5, tag:0.1`` för att få första revisionen sedan igår, 5 incheckningar bakom toppen eller taggen ”0.1”. Se ``bzr help revisionspec`` för alla möjliga värden.

source: For example repository with template attributes defined:
pt_br: Por exemplo, um repositório com atributos template definidos:
sv: Ett exempel med ett arkiv som har template-attribut definierade:

source: Example ``branch`` elements for the above repository:
pt_br: Exemplo de elementos ``branch`` para o repositório acima:
sv: Exempel med ``branch``-element för ovanstående arkiv:

source: This repository type is used to define a CVS repository.
pt_br: Este tipo de repositório é usado para definir um repositório CVS.
sv: Denna arkivtyp används för att definiera ett CVS-arkiv.

source: The ``password`` attribute is used to specify the password to the repository.
pt_br: O atributo ``password`` é usado para especificar a senha do repositório.
sv: Attributet ``password`` används för att ange lösenordet för arkivet.

source: The ``cvsroot`` attribute is used to specify the root of the repository.
pt_br: O atributo ``cvsroot`` é usado para especificar a raiz do repositório.
sv: Attributet ``cvsroot`` används för att ange roten för arkivet.

source: Additional attributes are: ``revision``, ``update-new-dirs`` and ``override-checkoutdir``.
pt_br: Atributos adicionais são: ``revision``, ``update-new-dirs`` e ``override-checkoutdir``.
sv: Ytterligare attribut är: ``revision``, ``update-new-dirs`` och ``override-checkoutdir``.

source: This repository type is used to define a Darcs repository.
pt_br: Este tipo de repositório é usado para definir um repositório Darcs.
sv: Denna arkivtyp används för att definiera ett Darcs-arkiv.

source: This repository type is used to define a Git repository.
pt_br: Este tipo de repositório é usado para definir um repositório Git.
sv: Denna arkivtyp används för att definiera ett Git-arkiv.

source: It allows the following attributes on the ``branch`` element:
pt_br: Ele permite os seguintes atributos no elemento ``branch``:
sv: Den tillåter följande attribut för ``branch``-elementet:

source: The ``revision`` attribute is used to specify a local or remote-tracking branch to switch to in the update phase. It defaults to 'master'. It is possible to override this attribute with the ``branches`` configuration variable. The switch will only be performed, if the current branch is tracking a remote branch, to not disturb your own work.
pt_br: O atributo ``revision`` é usado para especificar um ramo local ou remoto que pode ser selecionado na fase de atualização. Padrão é “master”. É possível sobrescrever este atributo com a variável de configuração ``branches``. A seleção será realizada apenas se o ramo atual estiver seguindo um ramo remoto, para não atrapalhar o seu próprio trabalho.
sv: Attributet ``revision`` används för att ange en lokal eller fjärrspårande gren att växla till i uppdateringsfasen. Standardvärdet är ”master”. Det är möjligt att åsidosätta detta attribut med konfigurationsvariabeln ``branches``. Växlingen kommer endast att utföras om den aktuella grenen spårar en fjärrgren för att inte förstöra ditt eget arbete.

source: The ``tag`` attribute is used to specify a revision to unconditionally check out in the update phase. It overrides the ``revision`` attribute.
pt_br: O atributo ``tag`` é usado para especificar uma revisão para baixar incondicionalmente na fase de atualização. Ele substitui o atributo ``revision``.
sv: Attributet ``tag`` används för att ange en revision att ovillkorligen checka ut i uppdateringsfasen. Det åsidosätter attributet ``revision``.

source: This repository type is used to define a Mercurial repository.
pt_br: Este tipo de repositório é usado para definir um repositório Mercurial.
sv: Denna arkivtyp används för att definiera ett Mercurial-arkiv.

source: This repository type is used to define a Monotone repository.
pt_br: Este tipo de repositório é usado para definir um repositório Monotone.
sv: Denna arkivtyp används för att definiera ett Monotone-arkiv.

source: The ``server`` attribute is used to specify the repository server.
pt_br: O atributo ``server`` é usado para especificar o servidor do repositório.
sv: Attributet ``server`` används för att ange arkivservern.

source: The ``database`` attribute is used to specify the database to use for the repository.
pt_br: O atributo ``database`` é usado para especificar o banco de dados a ser usado pelo repositório.
sv: Attributet ``database`` används för att ange databasen som ska användas för arkivet.

source: The ``defbranch`` attribute is used specify the branch of the repository to use.
pt_br: O atributo ``defbranch`` é usado para especificar o ramo do repositório a ser usado.
sv: Attributet ``defbranch`` används för att ange grenen i arkivet som ska användas.

source: This repository type is used to define a Subversion repository.
pt_br: Este tipo de repositório é usado para definir um repositório.
sv: Denna arkivtyp används för att definiera ett Subversion-arkiv.

source: It allows a revision on the ``branch`` element. This attribute defines the branch to checkout or, if it is a number, a specific revision to checkout.
pt_br: Ele permite uma ``revision`` no elemento ``branch``. Este atributo define o ramo para fazer checkout ou, se for um número, uma revisão específica para fazer checkout.
sv: Den tillåter en revision på elementet ``branch``. Detta attribut definierar grenen som ska checkas ut eller, om det är ett nummer, en specifik revision att checka ut.

source: It is possible to specify custom ``svn`` layout using trunk-template (defaults to "%(module)s/trunk"), branches-template (defaults to "%(module)s/branches/%(branch)s") and tags-template (defaults to "%(module)s/tags/%(tag)s")
pt_br: É possível especificar uma disposição ``svn`` diferente usando trunk-template (padrão é "%(module)s/trunk"), branches-template (padrão é "%(module)s/branches/%(branch)s") and tags-template (padrão é "%(module)s/tags/%(tag)s")
sv: Det är möjligt att ange en anpassad ``svn``-layout via trunk-template (standardvärdet är "%(module)s/trunk"), branches-template (standardvärdet är "%(module)s/branches/%(branch)s") och tags-template (standardvärdet är "%(module)s/tags/%(tag)s")

source: This repository type is used to define a fake system repository. A system repository is required to create any :ref:`systemmodule`.
pt_br: Este tipo de repositório é usado para definir um repositório de sistema falso. Um repositório de sistema é necessário para criar qualquer :ref:`systemmodule`.
sv: Denna arkivtyp används för att definiera ett falskt systemarkiv. Ett systemarkiv krävs för att skapa en :ref:`systemmodule`.

source: Tarballs
sv: Tar-arkiv

source: This repository type is used to define a tarball repository.
pt_br: Este tipo de repositório é usado para definir um repositório de tarball.
sv: Denna arkivtyp används för att definiera ett arkiv med tar-arkiv.

source: The ``module`` attribute specifies the file to download and compile, the ``version`` attribute specifies the module version.
pt_br: O atributo ``module`` especifica o arquivo para baixar e compilar, o atributo ``version`` especifica a versão do módulo.
sv: Attributet ``module`` anger filen som ska hämtas och kompileras medan attributet ``version`` anger modulversionen.

source: The size and hash, as well as the obsolete md5sum, attributes are optional. If these attributes are present, they are used to check that the source package was downloaded correctly.
pt_br: Os elementos size e hash, assim como o obsoleto md5sum, são opcionais. Se esses atributos estiverem presentes, eles são usados para verificar se o pacote de fontes foi baixado corretamente.
sv: Attributen size och hash såväl som det föråldrade attributet md5sum är valfria. Om dessa attribut finns används de för att kontrollera att källkodspaketen hämtats korrekt.

source: The ``rename-tarball`` can be used to rename the tarball file when downloading, in case the original name conflicts with another module.
pt_br: O atributo ``rename-tarball`` pode ser usado para renomear o arquivo tarball ao baixar, no caso do nome original conflitar com outro módulo.
sv: ``rename-tarball`` kan användas för att byta namn på tar-arkivfilen vid hämtning, ifall det ursprungliga namnet står i konflikt med en annan modul.

source: Any number of ``patch`` elements may be nested inside the ``branch`` element. These patches are applied, in order, to the source tree after unpacking. The ``file`` attribute gives the patch filename, and the ``strip`` attribute says how many levels of directories to prune when applying the patch.
pt_br: Qualquer número de elementos de ``patch`` pode ser acrescentado dentro do elemento ``branch``. Esses patches são aplicados, em ordem, na árvore de fontes após o desempacotamento. O atributo ``file`` fornece o nome do arquivo de patch e o atributo ``strip`` informa quantos níveis devem ser suprimidos ao aplicar o patch.
sv: Ett godtyckligt antal ``patch``-element kan nästlas inuti ``branch``-elementet. Dessa programfixar appliceras i sekvens på källkodsträdet efter uppackning. Attributet ``file`` anger filnamnet för programfixen och attributet ``strip`` anger hur många nivåer av kataloger som ska tas bort när programfixen appliceras.

source: For module sets shipped with JHBuild, the patch files are looked up in the ``jhbuild/patches/`` directory; for module sets referred by URI, the patch files are looked for in the same directory as the moduleset file, or in its ``patches/`` subdirectory. It is also possible for the file attribute to specify a URI, in which case it will be downloaded from that location.
pt_br: Para coleções de módulos disponibilizados com o JHBuild, os arquivos de patch são buscados no diretório ``jhbuild/patches/``; para coleções de módulos relacionados por URI, os arquivos de patch são obtidos no mesmo diretório do arquivo de coleção de módulos ou em seu subdiretório ``patches/``. Também é possível que o atributo file especifique uma URI, caso em que o patch será baixado desta localização.
sv: För moduluppsättningar som följer med JHBuild letas programfixfiler upp i katalogen ``jhbuild/patches/``; för moduluppsättningar som refereras till via URI kommer programfixfiler att letas efter i samma katalog som moduluppsättningsfilen eller i dess underkatalog ``patches/``. Det är också möjligt för attributet file att ange en URI, i vilket fall den kommer att hämtas från den platsen.

source: A tarball ``branch`` element may also contain quilt elements which specify nested branch to import.
pt_br: Um elemento ``branch`` de tarball também pode conter elementos quilt, que especificam branch aninhados para importar.
sv: Ett ``branch``-element för ett tar-arkiv får också innehålla quilt-element vilka anger nästlad branch som ska importeras.

source: Including Other Module Sets
pt_br: Incluindo outras coleções de módulos
sv: Inkludering av andra moduluppsättningar

source: JHBuild allows one module set to include the contents of another by reference using the ``include`` element.
pt_br: JHBuild permite que uma coleção de módulos inclua os conteúdos de outra por referência usando o elemento ``include``.
sv: JHBuild tillåter en moduluppsättning att inkludera innehållet från en annan genom att referera till den via ``include``-elementet.

source: The href is a URI reference to the module set to be included, relative to the file containing the ``include`` element.
pt_br: O href é uma referência de URI à coleção de módulos a serem incluídos, relativo ao arquivo contendo o elemento ``include``.
sv: href är en URI-referens till moduluppsättningen som ska inkluderas, relativt till filen som innehåller ``include``-elementet.

source: Only module definitions are imported from the referenced module set - module sources are not. Multiple levels of includes are allowed, but include loops are not (there isn't any code to handle loops at the moment).
pt_br: Apenas definições de módulos são importadas da coleção de módulos referenciada - fontes de módulos não são. Múltiplos níveis de inclusões são permitidas, mas loops de inclusão não são (não código algum para lidar com loops no presente momento).
sv: Endast moduldefinitioner importeras från den refererade moduluppsättningen - modulkällor importeras inte. Flera nivåer av inkluderingar tillåts, men inkluderingsloopar tillåts inte (det finns ingen kod som hanterar loopar för tillfället).

source: Module Definitions
pt_br: Definições de módulo
sv: Moduldefinitioner

source: There are various types of module definitions that can be used in a module set file, and the list can easily be extended. Only the most common ones will be mentioned here.
pt_br: Há vários tipos de definições de módulos que podem ser usados em um arquivo de coleção de módulos, e a lista pode ser facilmente estendida. Apenas aqueles mais comuns que são mencionados aqui.
sv: Det finns olika typer av moduldefinitioner som kan användas i en moduluppsättningsfil och listan kan enkelt utökas. Endast de vanligaste kommer att nämnas här.

source: They are all basically composed of a ``branch`` element describing how to get the module and ``dependencies``, ``suggests`` and ``after`` elements to declare the dependencies of the module.
pt_br: As definições são basicamente todas compostas de um elemento ``branch`` descrevendo como obter o módulo e elementos ``dependencies``, ``suggests`` e ``after`` para declarar as dependências do módulo.
sv: De består alla i grunden av ett ``branch``-element som beskriver hur man hämtar modulen samt ``dependencies``-, ``suggests``- och ``after``-element för att deklarera beroendena för modulen.

source: Any modules listed in the ``dependencies`` element will be added to the module list for ``jhbuild build`` if it isn't already included, and make sure the dependent modules are built first.
pt_br: Quaisquer módulos listados no elemento ``dependencies`` serão adicionados à lista de módulos de ``jhbuild build``, se eles já não estiverem inclusos, e confirmados de que módulos dependentes serão compilados primeiro.
sv: Moduler som listas i elementet ``dependencies`` kommer att läggas till i modullistan för ``jhbuild build`` om den inte redan finns där och säkerställa att de beroende modulerna byggs först.

source: After generating the modules list, the modules listed in the suggests element will be used to further sort the modules list (although it will not pull any additional modules). This is intended for cases where a module has an optional dependency on another module.
pt_br: Após gerar a lista de módulos, os módulos listados no elemento ``suggests`` serão usados para posterior organização da lista de módulos (apesar de que ela não vai obter nenhum módulos adicionais). Isso foi destinado para casos em que um módulo possui uma dependência opcional em outro módulo.
sv: Efter att ha genererat modullistan kommer moduler som listas i suggests-elementet att användas för att vidare sortera modullistan (även om inga ytterligare moduler dras in). Detta är avsett för fall när en modul har valfria beroenden på en annan modul.

source: The ``autotools`` element is used to define a module which is compiled using the GNU Autotools build system.
pt_br: O elemento ``autotools`` é usado para definir um módulo que é compilado usando o sistema de compilação do GNU Autotools.
sv: Elementet ``autotools`` används för att definiera en modul som ska kompileras via byggsystemet GNU Autotools.

source: The autogenargs and makeargs and ``makeinstallargs`` attributes are used to specify additional arguments to pass to ``autogen.sh``, ``make`` and ``make install`` respectively.
pt_br: Os atributos ``autogenargs``, ``makeargs`` e ``makeinstallargs`` são usados para especificar argumentos adicionais a serem passados para o ``autogen.sh``, ``make`` e ``make install``, respectivamente.
sv: Attributen autogenargs och makeargs och ``makeinstallargs`` används för att ange ytterligare argument som skickas till ``autogen.sh``, ``make`` respektive ``make install``.
