Repository: GNOME/jhbuild
Catalog: doc/po/*/LC_MESSAGES/docs.po
Languages: pt_br, sv

source: A dictionary mapping module names to dictionaries with extra environment variables to pass when executing commands for the module.
pt_br: Um dicionário mapeando os nomes de módulos em dicionários com variáveis de ambiente extras a serem passadas ao executar comandos do módulo.
sv: En uppslagsbok som mappar modulnamn till ordböcker med extra miljövariabler som skickas till exekverande kommandon för modulen.

source: Dictionary mapping module names to boolean values indicating whether static analysis should be performed while building that module. This allows the global :ref:`static_analyzer` configuration option to be overridden.
pt_br: Dicionário mapeando nomes de módulos para valores booleanos indicando se a análise estática deveria ser realizada enquanto compila aquele módulo. Isso permite que a opção de configuração global :ref:`static_analyzer` seja sobrescrita.
sv: Uppslagsbok som mappar modulnamn till booleska värden som indikerar huruvida statisk analys ska genomföras medan modulen byggs. Detta låter det globala konfigurationsalternativet :ref:`static_analyzer` åsidosättas.

source: A list of strings specifying the modules to build. The list of modules actually built will be recursively expanded to include all the dependencies unless the :ref:`buildone` command is used. Defaults to ``['meta-gnome-desktop']``.
pt_br: Uma lista de textos especificando módulos para compilar. A lista de módulos realmente compilada será expandida recursivamente para incluir todas as dependências, a menos que o comando :ref:`buildone` seja usado. Padrão é ``['meta-gnome-desktop']``.
sv: En lista av strängar som anger vilka moduler som ska byggas. Listan av moduler som faktiskt byggts kommer att expanderas rekursivt till att inkludera alla beroenden om inte kommandot :ref:`buildone` används. Standardvärdet är ``['meta-gnome-desktop']``.

source: A string or list of strings specifying the name(s) of the module set(s) to use. This can either be the filename of a moduleset included with JHBuild (excluding the path and extension), or a full HTTP URL to an externally managed moduleset. HTTP URL modulesets are cached locally. If a module with the same name is present in more than one moduleset, the last set listed takes priority. Modulesets provided with JHBuild are updated to match the current GNOME development release.
pt_br: Um texto ou uma lista de textos especificando os nomes das coleções de módulos a serem usados. Pode ser o nome do arquivo de uma coleção de módulos inclusa no JHBuild (excluindo o caminho e extensão) ou uma URL de HTTP completa para uma coleção de módulos gerenciada externamente. Coleções de módulos de URL de HTTP são mantidas no cache localmente. Se um módulo com o mesmo nome estiver presente em mais de uma coleção de módulos, a última coleção listada terá prioridade. As coleções de módulos fornecidas com o JHBuild são atualizadas para corresponder à versão de desenvolvimento atual do GNOME.
sv: En sträng eller lista av strängar som anger namn(en) för de moduluppsättningar som ska användas. Detta kan antingen vara filnamnet för en moduluppsättning inkluderad med JHBuild (exklusive sökvägen och filändelsen), eller en fullständig HTTP URL till en externt hanterad moduluppsättning. HTTP-URL-moduluppsättningar cachas lokalt. Om en modul med samma namn finns i mer än en moduluppsättning kommer den senast listade att ha högre prioritet. Moduluppsättningar som tillhandahålls av JHBuild uppdateras för att matcha aktuell GNOME-utvecklingsversion.

source: A string specifying the directory containing the modulesets to use. Defaults to the ``modulesets/`` directory in JHBuild sources.
pt_br: Uma string especificando o diretório contendo as coleções de módulos a serem usadas. Padrão é o diretório ``modulesets/`` nos fontes do JHBuild.
sv: En sträng som anger katalogen som innehåller moduluppsättningarna som ska användas. Standardvärdet är katalogen ``modulesets/`` i JHBuild-källkoden.

source: Run builds under the ``SCHED_IDLE`` priority on Linux, ``nice`` on other Unix. This can dramatically improve desktop interactivity for parallel builds while having only a negligible impact on build throughput.
pt_br: Executa compilações sob a prioridade ``SCHED_IDLE`` no Linux, ``nice`` em outros Unix. Isso pode melhorar drasticamente a interatividade de computador para compilações paralelas enquanto se tem apenas um impacto insignificante no rendimento da compilação.
sv: Kör byggen under prioriteten ``SCHED_IDLE`` i Linux och ``nice`` för andra Unix:ar. Detta kan dramatiskt förbättra skrivbordsinteraktiviteten för parallella byggen medan de har försumbar inverkan på bygghastighet.

source: A string listing additional arguments to be passed to ``ninja``. Defaults to ``''``.
pt_br: Uma string listando argumentos a serem passados para o ``ninja``. Padrão é ``''``.
sv: En sträng som listar ytterligare argument som ska skickas till ``ninja``. Standardvärdet är ``''``.

source: A boolean value, if set to ``True`` JHBuild will not build modules, but just download and unpack the sources. The default value is ``False``.
pt_br: Um valor em boolean, se definido como ``True``, o JHBuild não vai compilar módulos, e sim apenas baixar e desempacotar os fontes. Padrão é ``False``.
sv: Ett booleskt värde som om det är inställt på ``True`` (sant) kommer JHBuild inte att bygga moduler utan enbart hämta och packa upp källkoden. Standardvärdet är ``False`` (falskt).

source: A boolean value specifying whether to access the network. This affects checking out or updating CVS modules, downloading tarballs and updating module sets. Setting this to ``True`` is equivalent to passing the ``--no-network`` option. Defaults to ``False``.
pt_br: Um valor em boolean especificando se deve-se acessar a rede. Isso afeta a obtenção ou atualização de módulos de CVS, download de tarballs e atualização de coleções de módulos. Definir isso como ``True`` é equivalente a passar a opção ``--no-network``. Padrão é ``False``.
sv: Ett booleskt värde som anger huruvida nätverksåtkomst är tillåten. Detta påverkar utcheckning eller uppdatering av CVS-moduler, hämtning av tar-arkiv och uppdatering av moduluppsättningar. Att ställa in denna på ``True`` (sant) är ekvivalent med att ange flaggan ``--no-network``. Standardvärdet är ``False`` (falskt).

source: A boolean value specifying whether to emit notifications using the notification daemon. If set to ``False``, notifications are emitted. Defaults to ``True``.
pt_br: Um valor em boolean especificando se deve-se emitir notificações usando o daemon de notificação. Se definido como ``False``, notificações são emitidas. Padrão é ``True``.
sv: Ett booleskt värde som anger huruvida aviseringar ska skickas ut via aviseringsdemonen. Om denna är inställd på ``False`` (falskt) kommer aviseringar att skickas ut. Standardvärdet är ``True`` (sant).

source: A boolean value, if set to ``True`` JHBuild attempts to build modules even if one or more of the module's dependencies failed to build. This option is equivalent to the ``--no-poison`` argument. The default value is ``False``.
pt_br: Um valor em boolean, se definido como ``True``, JHBuild tenta compilar módulos mesmo se uma ou mais dependências do módulo não compilarem com sucesso. Esta opção é equivalente ao argumento ``--no-poison``. O valor padrão é ``False``.
sv: Ett booleskt värde som om det är inställt på ``True`` (sant) kommer att få JHBuild att försöka bygga moduler även om en eller flera av modulens beroenden misslyckas med att bygga. Detta alternativ är ekvivalent med flaggan ``--no-poison``. Standardvärdet är ``False`` (falskt).

source: A boolean value specifying whether to show an icon in the system tray using Zenity. If set to ``False``, an icon is shown. Defaults to ``True``.
pt_br: Um valor em boolean especificando se deve-se mostrar um ícone na área de notificação usando o Zenity. Se definido como ``False``, um ícone é mostrado. Padrão é ``True``.
sv: Ett booleskt värde som anger huruvida en ikon ska visas i systemfältet med hjälp av Zenity. Om detta är inställt på ``False`` (falskt) kommer en ikon att visas. Standardvärdet är ``True`` (sant).

source: A boolean value, if set to ``True`` JHBuild will run any graphical tests on the real X server, rather than using ``Xvfb``. This option is equivalent to passing ``--no-xvfb``. The default value is ``False``.
pt_br: Um valor em boolean, se definido como ``True``, JHBuild vai executar quaisquer testes gráficos no servidor X real, em vez de usar ``Xvfb``. Esta opção é equivalente a passar ``--no-xvfb``. O valor padrão é ``False``.
sv: Ett booleskt värde som om det är inställt på ``True`` (sant) kommer att få JHBuild att köra grafiska tester på den riktiga X-servern snarare än att använda ``Xvfb``. Denna flagga är ekvivalent med att ange ``--no-xvfb``. Standardvärdet är ``False`` (falskt).

source: A boolean value, if set to ``True`` JHBuild will not build dependency modules if corresponding system packages are installed and sufficient version. Defaults to ``True``.
pt_br: Um valor em boolean, se definido como ``True``, JHBuild não vai compilar módulos de dependências se os pacotes de sistema correspondentes estiverem instalados em uma versão suficiente. Padrão é ``True``.
sv: Ett booleskt värde som om det är inställt på ``True`` (sant) kommer att få JHBuild att inte bygga modulberoenden om motsvarande systempaket finns installerade och i tillräckligt ny version. Standardvärdet är ``True`` (sant).

source: A string specifying the prefix to install modules to. ``prefix`` must be an absolute path. This directory must be writable. Defaults to ``'~/jhbuild/install/'``.
pt_br: Um texto especificando o prefixo no qual serão instalados os módulos. ``prefix`` deve ser um caminho absoluto. Deve haver permissão de escrita para este diretório. Padrão é ``'~/jhbuild/install/'``.
sv: En sträng som anger prefixet att installera moduler i. ``prefix`` måste vara en absolut sökväg. Denna katalog måste vara skrivbar. Standardvärdet är ``'~/jhbuild/install/'``.

source: A boolean value specifying whether to pretty format the subprocess output. Only CVS output supports pretty printing. Disable if the pretty printing causes problems. Defaults to ``True``.
pt_br: Um valor em boolean especificando se deve-se embelezar o formato da saída do subprocesso. Apenas saídas CVS têm suporte a embelezamento da saída. Desabilite se isso causar problemas. Padrão é ``True``.
sv: Ett booleskt värde som anger huruvida underprocessers utmatning ska formateras snyggt. Endast CVS-utmatning har stöd för snygg formatering. Inaktivera om snygg formatering förorsakar problem. Standardvärdet är ``True`` (sant).

source: A string displayed before JHBuild executes a command. ``%(command)s`` in the string will be replaced with the command about to be executed. ``%(cwd)s`` in the string will be replaced with the current working directory. Defaults to ``'%(command)s'``.
pt_br: Uma string exibida antes do JHBuild executar um comando. ``%(command)s`` na string vai ser substituído com o comando a ser executado. ``%(cwd)s`` na string será substituída com o diretório de trabalho atual. Padrão é ``'%(command)s'``.
sv: En sträng som visas innan JHBuild kör ett kommando. ``%(command)s`` i strängen kommer att ersättas med kommandot som ska köras. ``%(cwd)s`` i strängen kommer att ersättas med aktuell arbetskatalog. Standardvärdet är ``'%(command)s'``.

source: A boolean value specifying whether to display a progress bar during :ref:`quiet_mode`. Defaults to ``True``.
pt_br: Um valor em boolean especificando se deve-se exibir uma barra de progresso durante o :ref:`quiet_mode`. Padrão é ``True``.
sv: Ett booleskt värde som anger huruvida en förloppsindikator ska visas i :ref:`quiet_mode`. Standardvärdet är ``True`` (sant).

source: A boolean value, if set to ``True`` disables the output of running commands. Defaults to ``False``.
pt_br: Um valor em boolean, se definido como ``True``, desabilita a saída dos comandos em execução. Padrão é ``False``.
sv: Ett booleskt värde som om det är inställt på ``True`` (sant) inaktiverar utmatningen av kommandon som körs. Standardvärdet är ``False`` (falskt).

source: A dictionary specifying an alternative repository location for a particular repository. This configuration variable is useful to a module developer. By default, JHBuild will check out code from repositories using an anonymous repository location. The dictionary keys are short repository names and the values are the alternative repository location strings. For example:
pt_br: Um dicionário especificando uma localização alternativa do repositório para um repositório em particular. Esta variável de configuração é útil para desenvolvedor de módulos. Por padrão, JHBuild vai baixar o código dos repositórios usando um local de repositório anônimo. As chaves de dicionário são nomes curtos de repositórios e os nomes são textos com a localização alternativa do repositório. Por exemplo:
sv: En uppslagsbok som anger en alternativ arkivplats för ett visst arkiv. Denna konfigurationsvariabel är användbar för en modulutvecklare. Som standard kommer JHBuild att checka ut kod från arkiv via en anonym arkivplats. Uppslagsboksnycklarna är korta arkivnamn och värdena är strängar med de alternativa arkivplatserna. Till exempel:

source: A boolean value specifying if JHBuild should prefer smaller version control downloads. Equivalent to ``git clone --depth 1`` or ``bzr co --light``. Defaults to ``False``.
pt_br: Um valor boolean especificando se o JHBuild deve preferir downloads menores de controle de versão. Equivalente a ``git clone --depth 1`` ou ``bzr co --light``. Padrão é ``False``.
sv: Ett booleskt värde som anger huruvida JHBuild ska föredra mindre hämtningar för versionshantering. Ekvivalent med ``git clone --depth 1`` eller ``bzr co --light``. Standardvärdet är ``False`` (falskt).

source: A list of modules to skip. This ``--skip`` command line option extends the list. This list is empty by default. If the list contains the special value ``'*'``, JHBuild will skip all modules not explicitly listed in the ``modules`` variable. This may be useful if you want to build modules without their implicit dependencies.
pt_br: Uma lista de módulos para pular. Esta opção de linha de comando ``--skip`` estende a lista. Esta lista está vazia, por padrão. Se a lista contém um valor especial ``"*"``, JHBuild vai pular todos os módulos não listados explicitamente na variável ``modules``. Isso pode ser útil se você deseja compilar módulos sem suas dependências implícitas.
sv: En lista över moduler som ska hoppas över. Denna kommandoradsflagga, ``--skip``, utökar listan. Denna lista är tom som standard. Om listan innehåller det speciella värdet ``'*'`` kommer JHBuild att hoppa över alla moduler som inte uttryckligen listas i variabeln ``modules``. Detta kan vara användbart om du vill bygga moduler utan deras implicita beroenden.

source: A boolean value: if set to ``True``, run a static analysis tool on each module as it’s being built. Defaults to ``False``.
pt_br: Um valor booleano, se definido como ``True``, executa uma ferramenta de análise estática em cada módulo enquanto está sendo compilado. Padrão é ``False``.
sv: Ett booleskt värde som om det är inställt på ``True`` (sant) kör ett statiskt analysverktyg för varje modul medan den byggs. Standardvärdet är ``False`` (falskt).

source: Root directory below which static analysis reports will be saved (if :ref:`static_analyzer` is ``True``). Defaults to ``/tmp/jhbuild_static_analyzer``.
pt_br: Diretório raiz abaixo no qual relatórios de análise estática serão salvos (se :ref:`static_analyzer` for ``True``). Padrão é ``/tmp/jhbuild_static_analyzer``.
sv: Rotkatalogen under vilken statiska analysrapporter kommer att sparas (om :ref:`static_analyzer` är ``True`` (sant)). Standardvärdet är ``/tmp/jhbuild_static_analyzer``.

source: Command template for the static analyzer. This has the parameters ``outputdir`` (the value of the :ref:`static_analyzer_outputdir` configuration variable) and ``module`` (the name of the module currently being built) substituted into it ``printf``-style. The resulting command is used as a prefix to ``make`` when building a module. Defaults to ``scan-build``.
pt_br: Modelo de comando para analisador estático. Ele possui os parâmetros ``outputdir`` (o valor da variável de configuração :ref:`static_analyzer_outputdir`) e ``module`` (o nome do módulo sendo compilado atualmente) substituído por um estilo ``printf``. O comando resultante é usado como um prefixo para ``make`` ao compilador um módulo. Padrão é ``scan-build``.
sv: Kommandomall för den statiska analysatorn. Denna får enligt ``printf``-stil parametrarna ``outputdir`` (värdet från konfigurationsvariabeln :ref:`static_analyzer_outputdir`) och ``module`` (namnet på modulen som byggs för närvarande) ersatta. Det resulterande kommandot används som prefix till ``make`` när en modul byggs. Standardvärdet är ``scan-build``.

source: A string if set, and if supported by the underlying version control system, JHBuild will update the source tree to the specified date before building. An ISO date format is required, e.g. ``'yyyy-mm-dd'``. Defaults to ``None``.
pt_br: Uma string que, se definida e se houver suporte por seu sistema de controle de versão, JHBuild vai atualizar a árvore de fontes na data especificada antes de compilar. Uma data no formato ISO é necessária, ex.: ``'yyyy-mm-dd'``. Padrão é ``None``.
sv: En sträng som om den är satt och om det stöds av det underliggande versionshanteringssystemet kommer att få JHBuild att uppdatera källkodsträdet till det angivna datumet innan bygge. Ett datum enligt ISO-format krävs, t.ex. ``'yyyy-mm-dd'``. Standardvärdet är ``None`` (inget).

source: A string specifying which program to use for subversion support. This can be ``svn``, ``git-svn`` or ``bzr``. Defaults to ``svn``.
pt_br: Uma string especificando qual programa deve ser usado para ter suporte a subversion. Pode ser ``svn``, ``git-svn`` ou ``bzr``. Padrão é ``svn``.
sv: En sträng som anger vilket program som ska användas för subversion-stöd. Denna kan vara ``svn``, ``git-svn`` eller ``bzr``. Standardvärdet är ``svn``.

source: A list of strings specifying the system library paths. This is used when setting the default values of some environment variables, such as ``PKG_CONFIG_PATH``.
pt_br: Uma lista de strings especificando os caminhos das bibliotecas de sistema. Isso é usado ao definir os valores padrão de algumas variáveis de ambiente, tais como ``PKG_CONFIG_PATH``.
sv: En lista av strängar som anger systembibliotekssökvägar. Dessa används när standardvärdet för vissa miljövariabler ställs in, till exempel ``PKG_CONFIG_PATH``.

source: A string if set, tarballs will be downloaded to the specified directory instead of :ref:`checkoutroot`. This is useful if you have multiple JHBuild environments or regularly clear out :ref:`checkoutroot` and want to reduce bandwidth usage. Defaults to ``'~/.cache/jhbuild/downloads'``.
pt_br: Uma string que, se definida, faz tarballs serem baixados para o diretório especificado em vez do :ref:`checkoutroot`. Isso é útil se você tiver múltiplos ambientes de JHBuild ou regularmente limpa :ref:`checkoutroot` e deseja reduzir o uso da conexão com a Internet. O padrão é ``'~/cache/jhbuild/downloads'``.
sv: En sträng som om den är inställd kommer att få tar-arkiv att hämtas till den angivna katalogen i stället för :ref:`checkoutroot`. Detta är användbart om du har flera JHBuild-miljöer eller regelbundet rensar ur :ref:`checkoutroot` och vill reducera använd bandbredd. Standardvärdet är ``'~/.cache/jhbuild/downloads'``.

source: A string specifying the directory to store ``jhbuild tinderbox`` output. This string can be overridden by the ``--output`` option. Defaults to ``None``, so either the command line option must be used or this variable must be set in the configuration file.
pt_br: Uma string especificando o diretório para armazenar a saída de ``jhbuild tinderbox``. Esta string pode ser sobrescrita pela opção ``--output``. Padrão é ``None``, de forma que a opção de linha de comando deve ser usada ou esta variável deve estar definida no arquivo de configuração.
sv: En sträng som anger vilken katalog som används för att lagra ``jhbuild tinderbox``-utmatning. Denna sträng kan åsidosättas av flaggan ``--output``. Standardvärdet är ``None`` (ingen), så antingen måste kommandoradsflaggan eller denna variabel användas i konfigurationsfilen.

source: A boolean value, if set to ``True`` JHBuild will automatically try to solve failures by 1) running ``autogen.sh`` again, and 2) checking out a newer version of a module from version control. This setting is equivalent to passing the ``--try-checkout`` option.
pt_br: Um valor em boolean, se definido como ``True``, JHBuild vai automaticamente tentar resolver falhas 1) executando ``autogen.sh`` novamente e 2) baixando uma versão mais nova de um módulo a partir do controle de versão. Esta configuração é equivalente à opção ``--try-checkout``.
sv: Ett booleskt värde som om det är inställt på ``True`` (sant) får JHBuild att automatiskt försöka lösa fel genom att 1) köra ``autogen.sh`` igen eller 2) checka ut en nyare version av en modul från versionshanteringssystemet. Denna inställning är ekvivalent med att ange flaggan ``--try-checkout``.

source: A boolean value that specifies to use modulesets that were checked out along the JHBuild source code; instead of downloading them on-the-fly from GNOME version control system. Defaults to ``False``.
pt_br: Um valor em boolean que especifica que devem ser usadas coleções de módulos que foram baixados junto com o código fonte do JHBuild; em vez de baixá-los em tempo de execução do sistema de controle de versão do GNOME. Padrão é ``False``.
sv: Ett booleskt värde som anger att de moduluppsättningar som checkats ut samtidigt med JHBuild-källkoden ska användas, i stället för att hämta dem i farten från GNOMEs versionshanteringssystem. Standardvärdet är ``False`` (falskt).

source: A string listing arguments to pass to ``Xvfb`` if running graphical tests.
pt_br: Uma string listando argumentos a serem passados para o ``Xvfb``, se executando testes gráficos.
sv: En sträng som listar argument som ska skickas till ``Xvfb`` om grafiska tester ska köras.

source: A set of condition (strings) that can influence the modules that are built and the options that are used for building them. You should use ``conditions.add()`` and ``conditions.discard()`` to modify the list if you want to make changes.
pt_br: Uma coleção de condições (textos) que podem influenciar os módulos que são compilados e as opções que são usadas para compilá-los. Você deveria usar ``conditions.add()`` e ``conditions.discard()`` para modificar a lista se você quiser fazer alterações.
sv: En mängd villkor (strängar) som kan påverka modulerna som byggs och flaggorna som används för att bygga dem. Du bör använda ``conditions.add()`` och ``conditions.discard()`` för att modifiera listan om du vill göra ändringar.
