Repository: GNOME/jhbuild
Catalog: doc/po/*/LC_MESSAGES/docs.po
Languages: pt_br, sv

source: The ``info`` command displays information about one or more modules.
pt_br: O comando ``info`` exibe informações sobre um ou mais módulos.
sv: Kommandot ``info`` visar information om en eller flera moduler.

source: The command displays the module name, type, dependencies, dependent packages, the source directory, and the time it was last installed with JHBuild. If available, information specific to the module type such as the CVS repository or download URL will also be displayed.
pt_br: O comando exibe o nome do módulo, tipo, dependências, pacotes dependentes, o diretório de fontes e o horário em que foi instalado pela última vez com JHBuild. Se disponível, informações específicas do tipo do módulo, como o repositório de sistema de controle de versão (VCS) ou a URL de download, também serão exibidas.
sv: Kommandot visar modulnamnet, typen, beroenden, paket som beror på denna modul, källkodskatalogen och tiden den senast installerades med JHBuild. Om tillgängligt kommer också information specifik för modultypen såsom CVS-arkiv eller hämtnings-URL att visas.

source: If there is no module specified the command will display information about all the modules defined in the module set.
pt_br: Se nenhum módulo for especificado, o comando vai exibir informações sobre todos os módulos definidos na coleção de módulos.
sv: Om det inte finns någon modul angiven kommer kommandot att visa information om alla de moduler som finns definierade i moduluppsättningen.

source: If the ``--installed`` option is specified, the output will be filtered to include only installed packages. This resulting output only contains modules that were actually built and installed by jhbuild. The output does not include system dependencies.
pt_br: Se a opção ``--installed`` for especificada, a saída será filtrada para incluir apenas pacotes instalados. A saída resultante contém apenas módulos que foram realmente compilados e instalados pelo jhbuild. A saída não inclui dependências do sistema.
sv: Om flaggan ``--installed`` anges kommer utmatningen att filtreras så att den bara inkluderar installerade paket. Denna utmatning kommer endast att innehålla moduler som faktiskt byggts och installerats av jhbuild. Utmatningen inkluderar inte systemberoenden.

source: If the ``--installed`` option is specified together with one or more module names, then only the installed modules (not including system dependencies) are printed out. If at least one module is not installed, then the command will exit with a return value of 1.
pt_br: Se a opção ``--installed`` for especificada junto com um ou mais nomes de módulos, então apenas os módulos instalados (não incluindo dependências do sistema) são mostradas. Se pelo menos um módulo não estiver instalado, então o comando vai sair com um valor de retorno de 1.
sv: Om flaggan ``--installed`` angetts tillsammans med ett eller flera modulnamn så kommer bara de installerade modulerna (exklusive systemberoenden) att skrivas ut. Om åtminstone en modul inte är installerad kommer kommandot att avslutas med returvärdet 1.

source: The ``list`` command displays the expanded list of modules the ``build`` command would build.
pt_br: O comando ``list`` exibe a lista expandida de módulos que o comando ``build`` compilaria.
sv: Kommandot ``list`` skriver ut den expanderade listan över moduler som kommandot ``build`` hade byggt.

source: The ``--skip``, ``--start-at``, ``--tags``, and ``--ignore-suggests`` options are processed as per the :ref:`build` command.
pt_br: As opções ``--skip``, ``--start-at``, ``--tags`` e ``--ignore-suggests`` são processadas conforme o comando :ref:`build`.
sv: Flaggorna ``--skip``, ``--start-at``, ``--tags`` och ``--ignore-suggests`` behandlas på samma sätt som för kommandot :ref:`build`.

source: List all the modules from the module set regardless of the build dependencies.
pt_br: Lista todos os módulos da coleção de módulos independentemente das dependências de compilação.
sv: Lista alla modulerna från en moduluppsättning oavsett byggberoenden.

source: If a module is set to a branch, show the branch name with the module name.
pt_br: Se um módulo está definido em um ramo, mostra o nome do ramo com o nome do módulo.
sv: Om en modul är inställd på en gren, visa grennamnet med modulnamnet.

source: This option forces JHBuild to list optional dependencies.
pt_br: Esta opção força o JHBuild a listar todas as dependências opcionais.
sv: Denna flagga tvingar JHBuild att lista valfria beroenden.

source: The ``rdepends`` command displays the reverse dependencies of a module.
pt_br: O comando ``rdepends`` exibe as dependências inversas de um módulo.
sv: Kommandot ``rdepends`` visar de omvända beroendena för en modul.

source: Show dependency path next to modules.
pt_br: Mostra um caminho de dependência ao lado dos módulos.
sv: Visa beroendesökvägen intill modulerna.

source: Limit display to modules directly depending on specified module.
pt_br: Limita a exibição a módulos dependendo diretamente do módulo especificado.
sv: Begränsa utskriften till moduler som direkt beror på den angivna modulen.

source: The ``run`` command runs the specified command using the same environment that JHBuild uses when building modules.
pt_br: O comando ``run`` executa o comando especificado usando o mesmo ambiente que o JHBuild usa ao compilar módulos.
sv: Kommandot ``run`` kör det angivna kommandot i samma miljö som JHBuild använder för att bygga moduler.

source: If using JHBuild to build GNOME, this command can be useful in X startup scripts.
pt_br: Se usando o JHBuild para compilar o GNOME, este comando pode ser útil em scripts de inicialização do X.
sv: Om JHBuild används för att bygga GNOME kan detta kommando vara användbart i uppstartsskripten för X.

source: ``--in-builddir``\ =<module>
pt_br: ``--in-builddir``\ =<módulo>
sv: ``--in-builddir``\ =<modul>

source: Run the command in the build directory of the specified module.
pt_br: Executa o comando no diretório de compilação do módulo especificado.
sv: Kör kommandot i byggkatalogen för den angivna modulen.

source: ``--in-checkoutdir``\ =<module>
pt_br: ``--in-checkoutdir``\ =<módulo>
sv: ``--in-checkoutdir``\ =<modul>

source: Run the command in the source directory of the specified module.
pt_br: Executa o comando no diretório fonte do módulo especificado.
sv: Kör kommandot i källkodskatalogen för den angivna modulen.

source: The ``sanitycheck`` command performs a number of checks to verify the build environment is okay.
pt_br: O comando ``sanitycheck`` realiza as verificações para confirmar que o ambiente de compilação está correto.
sv: Kommandot ``sanitycheck`` utför ett antal kontroller för att verifiera att byggmiljön är OK.

source: Some of the checks include:
pt_br: Algumas verificações incluem:
sv: Dessa kontroller inkluderar:

source: The checkout and install prefixes are writable.
pt_br: Os prefixos de checkout e instalação têm permissão de escrita.
sv: Att utchecknings- och installationsprefixen är skrivbara.

source: The required build tools are installed.
pt_br: As ferramentas necessárias para compilação estão instaladas.
sv: Att de byggverktyg som krävs är installerade.

source: Some commonly used macros are available in the search paths of the ``aclocal`` commands associated with the various versions of ``automake``.
pt_br: Algumas macros comumente usadas estão disponíveis nos caminhos de pesquisa dos comandos de ``aclocal`` associados com as várias versões do ``automake``.
sv: Att vissa vanliga makron är tillgängliga i sökvägarna för ``aclocal``-kommandona förknippade med de olika versionerna av ``automake``.

source: The XML catalog contains the DocBook DTD and stylesheets.
pt_br: O catálogo XML contém o DocBook DTD e as folhas de estilos.
sv: XML-katalogen innehåller DocBook DTD och stilmallar.

source: The ``shell`` command starts the user's shell with the same environment as JHBuild uses when building modules.
pt_br: O comando ``shell`` inicia o shell do usuário com o mesmo ambiente que o JHBuild usa ao compilar módulos.
sv: Kommandot ``shell`` startar användarens skal med samma miljö som JHBuild använder för att bygga moduler.

source: This command is equivalent to the following:
pt_br: O comando é equivalente a:
sv: Detta kommando är ekvivalent med följande:

source: The ``UNDER_JHBUILD`` environment variable will be set to "true" when this shell is active. You can use the presence of that variable to customize your shell's prompt to indicate that you indeed are under a jhbuild-controlled shell. For example, you may want to put this in your ``.bashrc``:
pt_br: A variável de ambiente ``UNDER_JHBUILD`` será definida para “true” quando este shell estiver ativo. Você pode usar a presença desta variável para personalizar o prompt do shell para indicar que você realmente está dentro de um shell controlado pelo jhbuild. Por exemplo, você pode querer colocar isso em seu ``.bashrc``:
sv: Miljövariabeln ``UNDER_JHBUILD`` kommer att vara satt till ”true” (sant) när detta skal är aktivt. Du kan använda närvaron av den variabeln för att anpassa ditt skals prompt för att indikera att du faktiskt är i ett jhbuild-kontrollerat skal. Till exempel kan du vilja lägga följande i din ``.bashrc``:

source: This will make your bash shell display ``[jhbuild]`` before your normal prompt, making it easier to see which shells are under a jhbuild environment.
pt_br: Isso vai fazer com que o shell do bash exiba ``[jhbuild]`` antes do seu prompt normal, deixando mais fácil ver qual shell está em baixo de um ambiente do jhbuild.
sv: Detta kommer att få ditt bash-skal att visa ``[jhbuild]`` innan din normala prompt vilket gör det enklare att se vilka skal som körs i en jhbuild-miljö.

source: The ``sysdeps`` command displays:
pt_br: O comando ``sysdeps`` exibe:
sv: Kommandot ``sysdeps`` visar:

source: a list of installed system packages which will be used during the build. JHBuild will not build these modules and opt to use the system package instead.
pt_br: uma lista de pacotes de sistemas instalados que serão usados durante a compilação. JHBuild não vai compilar esses módulos e, em vez disso, opta por usar o pacote do sistema.
sv: en lista över installerade systempaket som kommer att användas under bygget. JHBuild kommer inte att bygga dessa moduler utan väljer att använda systempaketen i stället.

source: a list of required packages. To begin a build the packages must be provided by your system.
pt_br: uma lista de pacotes necessários. Para começar uma compilação, os pacotes devem ser fornecidos pelo seus sistema.
sv: en lista över paket som krävs. För att påbörja ett bygge måste paketen tillhandahållas av ditt system.

source: a list of optional packages. The corresponding system package was not found or too old. JHBuild will build the module. Optional packages will not be displayed if ```partial_build`` <#cfg-partial-build>`__ is ``False``.
pt_br: uma lista de pacotes opcionais. O pacote de sistema correspondente não foi encontrado ou é muito antigo. JHBuild vai compilar o módulo. Pacotes opcionais não serão exibidos se ```partial_build`` <#cfg-partial-build>`__ for ``False``.
sv: en lista över valfria paket. Motsvarande systempaket hittades inte eller var för gamla. JHBuild kommer att bygga modulen. Valfria paket kommer inte att visas om ```partial_build`` <#cfg-partial-build>`__ är ``False`` (falsk).

source: This option installs system packages which are dependencies of the moduleset. The installation method depends on your distribution. System packages are installed using PackageKit, if available. For distributions using APT such as ``Debian`` and ``Ubuntu``, this option requires apt-file to be installed.
pt_br: Esta opção instala pacotes de sistema que são dependências da coleção de módulos. Este método de instalação depende de sua distribuição. Pacotes de sistema são instalados usando PackageKit, se disponível. Para distribuições usando APT como o ``Debian`` e ``Ubuntu``, esta opção requer apt-file para ser instalada.
sv: Denna flagga installerar systemberoenden som är beroenden från moduluppsättningen. Installationsmetoden beror på din distribution. Systempaket installeras via PackageKit om tillgängligt. För distributioner som använder APT såsom ``Debian`` och ``Ubuntu`` kräver denna flagga att apt-file är installerat.

source: The ``tinderbox`` command is similar to ``build``, but writes all terminal output to HTML files suitable for publishing on a website. It can be used to set up systems similar to Mozilla's Tinderbox, or Debian's Buildd.
pt_br: O comando ``tinderbox`` é similar ao ``build``, mas escreve todas as saídas do terminal em arquivos HTML para publicação em um site. Isso pode ser usado para instalar sistemas similares ao Tinderbox do Mozilla ou o Buildd do Debian.
sv: Kommandot ``tinderbox`` liknar ``build`` men skriver all terminalutmatning till HTML-filer som är lämpliga för publicering på en webbplats. Det kan användas för att ställa in system liknande Mozillas Tinderbox eller Debians Buildd.

source: The ``--autogen``, ``--clean``, ``--distclean``, ``--no-network``, ``--skip``, ``--start-at``, ``-D``, ``-C``, ``-N``, ``-f`` and ``--nodeps`` options are processed as per the :ref:`build` command.
pt_br: As opções ``--autogen``, ``--clean``, ``--distclean``, ``--no-network``, ``--skip``, ``--start-at``, ``-D``, ``-C``, ``-N``, ``-f`` e ``--nodeps`` são processadas conforme o comando :ref:`build`.
sv: Flaggorna ``--autogen``, ``--clean``, ``--distclean``, ``--no-network``, ``--skip``, ``--start-at``, ``-D``, ``-C``, ``-N``, ``-f`` och ``--nodeps`` behandlas på samma sätt som för kommandot :ref:`build`.

source: ``-o``, ``--output``\ =<directory>
pt_br: ``-o``, ``--output``\ =<diretório>
sv: ``-o``, ``--output``\ =<katalog>

source: The directory to write the HTML files. JHBuild will create an index (``index.html``) and a HTML file for each module.
pt_br: O diretório no qual serão escritos os arquivos HTML. JHBuild vai criar um índice (``index.html``) e um arquivo HTML para cada módulo.
sv: Katalogen som HTML-filer skrivs till. JHBuild kommer att skapa ett index (``index.html``) och en HTML-fil för varje modul.

source: The ``uninstall`` command uninstalls one or more modules.
pt_br: O comando ``uninstall`` desinstala um ou mais módulos.
sv: Kommandot ``uninstall`` avinstallerar en eller flera moduler.

source: The ``update`` command is similar to ``build``, but only performs the download or update stage for modules without building them.
pt_br: O comando ``update`` é similar ao ``build``, mas realiza apenas os estágios de baixar e atualizar para módulos, sem compilá-los.
sv: Kommandot ``update`` liknar ``build`` men utför bara hämtnings- eller uppdateringssteget för moduler utan att bygga dem.

source: The ``--skip``, ``--start-at``, ``--tags``, ``--ignore-suggests`` and ``-D`` options are processed as per the :ref:`build` command.
pt_br: As opções ``--skip``, ``--start-at``, ``--tags``, ``--ignore-suggests`` e ``-D`` são processadas conforme o comando :ref:`build`.
sv: Flaggorna ``--skip``, ``--start-at``, ``--tags``, ``--ignore-suggests`` och ``-D`` behandlas på samma sätt som för kommandot :ref:`build`.

source: The ``updateone`` command is similar to ``update``, but it does not update the dependent modules. It is useful for updating one or more modules.
pt_br: O comando ``updateone`` é similar ao ``update``, mas ele não atualiza os módulos dependentes. É útil para atualizar um ou mais módulos.
sv: Kommandot ``updateone`` liknar ``update`` men det uppdaterar inte modulberoenden. Det är användbart för att uppdatera en eller flera moduler.

source: The ``-D`` option is processed as per the :ref:`build` command.
pt_br: A opção ``-D`` é processada conforme o comando :ref:`build`.
sv: Flaggan ``-D`` behandlas på samma sätt som för kommandot :ref:`build`.

source: Configuration File Reference
pt_br: Referência de arquivo de configuração
sv: Referensmanual för konfigurationsfil

source: The ``~/.config/jhbuildrc`` file uses standard Python syntax. The file is run, and the resulting variables defined in the namespace are used to control how JHBuild acts. A set of default values are inserted into the namespace before running the user's configuration file.
pt_br: O arquivo ``~/.config/jhbuildrc`` usa uma sintaxe padrão do Python. O arquivo é executado e as variáveis resultantes definidas no espaço de nomes são usadas para controlar como o JHBuild age. Um conjunto de valores padrões são inseridos no espaço de nomes antes de executar o arquivo de configuração do usuário.
sv: Filen ``~/.config/jhbuildrc`` använder Pythons standardsyntax. Filen körs och variablerna som definieras i namnrymden används för att kontrollera hur JHBuild beter sig. En uppsättning av standardvärden infogas i namnrymden innan användarens konfigurationsfil körs.

source: Boolean configuration variables are set using syntax as demonstrated in the following example:
pt_br: Variáveis de configuração em Boolean são definas usando uma sintaxe como demonstrado no exemplo a seguir:
sv: Booleska konfigurationsvariabler ställs in enligt den syntax som visas i följande exempel:

source: String configuration variables are set using syntax as demonstrated in the following example:
pt_br: Variáveis de configuração em string são definidas usando uma sintaxe como demonstrado no exemplo a seguir:
sv: Konfigurationsvariabler som är strängar ställs in via en syntax som visas i följande exempel:

source: List configuration variables are set using syntax as demonstrated in the following example:
pt_br: Variáveis de configuração em lista são definidas usando uma sintaxe como demonstrada no exemplo a seguir:
sv: Konfigurationsvariabler som är listor ställs in via en syntax som visas i följande exempel:

source: Dictionary configuration variables are set using syntax as demonstrated in the following example:
pt_br: Variáveis de configuração de dicionário são definidas usando uma sintaxe como demonstrada no exemplo a seguir:
sv: Konfigurationsvariabler som är ordböcker ställs in via en syntax som visas i följande exempel:

source: Configuration Variables
pt_br: Variáveis de configuração
sv: Konfigurationsvariabler

source: A boolean value if set to ``True``, always run ``autogen.sh``. This is equivalent to passing ``--autogen`` option to JHBuild. Defaults to ``False``.
pt_br: Um valor em boolean que, se definida como ``True``, sempre executa ``autogen.sh``. Este comando é equivalente a passar a opção ``--autogen`` para o JHBuild. Padrão é ``False``.
sv: Ett booleskt värde som om inställt på ``True`` (sant) alltid kommer att köra ``autogen.sh``. Detta är ekvivalent med att ange flaggan ``--autogen`` till JHBuild. Standardvärdet är ``False`` (falskt).

source: A string containing arguments passed to the ``autogen.sh`` script of all modules. Can be overridden for particular modules using the :ref:`module_autogenargs` dictionary.
pt_br: Uma string contendo argumentos passados para o script ``autogen.sh`` de todos os módulos. Pode ser sobrescrita por módulos em particular, usando o dicionário :ref:`module_autogenargs`.
sv: En sträng som innehåller argument som anges till skriptet ``autogen.sh`` för alla moduler. Kan åsidosättas för specifika moduler via uppslagsboken :ref:`module_autogenargs`.

source: A dictionary specifying which branch to use for specific modules. This is useful if you are making some changes on a branch of a module and want JHBuild to build that branch instead of the one listed in the module set.
pt_br: Um dicionário especificando qual ramo deve ser usado para módulos específicos. Isso é útil se você está fazendo algumas alterações em um ramo de um módulo e deseja JHBuild compilar este ramo em vez daquele listado na coleção de módulos.
sv: En uppslagsbok som anger vilken gren som används för specifika moduler. Detta är användbart om du gör ändringar på en viss gren för en modul och vill att JHBuild ska använda den grenen i stället för den som listats i moduluppsättningen.

source: The definition of branches depends on the module VCS:
pt_br: A definição de ramos depende do sistema de controle de versão (VCS) do módulo:
sv: Definitionen av grenar beror på VCS-modulen:

source: CVS: revision. E.g. ``'BRANCH-PROJECT-0_8'``
pt_br: CVS: revisão. E.g. ``'BRANCH-PROJECT-0_8'``
sv: CVS: revision. T.ex. ``'GREN-PROJEKT-0_8'``

source: Bazaar: URI of module branch. E.g. ``'http://bzr.example.net/project/gnome-2-28'``
pt_br: Bazaar: URI do ramo do módulo. Ex.: ``'http://bzr.exemplo.net/projeto/gnome-2-28'``
sv: Bazaar: URI:n för modulgrenen. T.ex. ``'http://bzr.example.net/projekt/gnome-2-28'``

source: Git: tuple, with first part being an optional repository (or the None value) and the second part the name of the branch. E.g. ``('git://git.example.net/project', 'gnome-2-28')``
pt_br: Git: tupla, com a primeira parte sendo um repositório opcional (ou o valor “None”) e a segunda parte do nome do ramo. Ex.: ``('git://git.exemplo.net/projeto', 'gnome-2-28')``
sv: Git: en tupel, där första delen är ett valfritt arkiv (eller värdet None (inget)) och andra delen är grenens namn. T.ex. ``('git://git.example.net/projekt', 'gnome-2-28')``

source: Subversion: URI of module branch. E.g. ``'svn://svn.example.net/project/gnome-2-28'``
pt_br: Subversion: URI do ramo do módulo. Ex.: ``'svn://svn.exemplo.net/projeto/gnome-2-28'``
sv: Subversion: URI:n för modulgrenen. T.ex. ``'svn://svn.example.net/projekt/gnome-2-28'``

source: A ``printf`` style formatting pattern used to generate build directory names. This is only used when using separate source and build trees. The ``%s`` in the format string will be replaced with ``checkoutdir``. Defaults to ``'%s'``.
pt_br: Um padrão de formatação de estilo do ``printf`` usado para gerar nomes de diretórios de compilação. Isso é usado apenas ao usar árvores de fontes e compilação separados. O ``%s`` na string de formatação será substituído com ``checkoutdir``. Padrão é ``'%s'``.
sv: Ett formateringsmönster i ``printf``-stil som används för att generera namn för byggkataloger. Detta används bara när separata källkods- och byggträd används. ``%s`` i formateringssträngen kommer att ersättas med ``checkoutdir``. Standardvärdet är ``'%s'``.

source: A string specifying the parent directory to place build trees. Defaults to ``~/.cache/jhbuild/build``. Setting the value to ``None`` causes builds to be performed within the source trees.
pt_br: Uma string especificando o diretório pai para colocar as árvores de compilação. Padrão é ``~/.cache/jhbuild/build``. Definir esse valor para ``None`` faz com que as compilações sejam realizadas dentro das árvores de fontes.
sv: En sträng som anger den överordnade katalogen som byggträd placeras i. Standardvärdet är ``~/.cache/jhbuild/build``. Att ställa in värdet till ``None`` (ingen) får byggen att utföras i källkodsträden.

source: A string specifying which buildscript to use. The recommended setting is the default, ``terminal``. In particular, do not set to ``gtk``.
pt_br: Uma string especificando qual buildscript deve ser usado. A configuração recomendada é a padrão, ``terminal``. Em particular, não defina para ``gtk``.
sv: En sträng som ange vilket byggskript som ska användas. Den rekommenderade inställningen är standardvärdet, ``terminal``. Bör framför allt inte ställas in till ``gtk``.
