Repository: GNOME/jhbuild
Catalog: doc/po/*/LC_MESSAGES/docs.po
Languages: pt_br, sv

source: A string specifying which modules to build. The three possible options are ``all``, to build all modules requested, ``updated`` to build only modules which have changed, or ``updated-deps`` to build modules which have changed or which have dependencies which have changed. Defaults to ``updated-deps``.
pt_br: Uma string especificando quais módulos devem ser compilados. As três opções possíveis são: ``all`` para compilar todos os módulos solicitados; ``updated`` para compilar apenas os módulos que você alterou; ou ``updated-deps`` para compilar módulos que você alterou ou que possuem dependências que foram alteradas. Padrão é ``updated-deps``.
sv: En sträng som anger vilka moduler som ska byggas. De tre möjliga alternativen är ``all``, för att bygga alla moduler som begärs, ``updated`` för att endast bygga de moduler som har ändrats eller ``updated-deps`` för att bygga moduler som har ändrats eller som har beroenden som har ändrats. Standardvärdet är ``updated-deps``.

source: A string specifying the directory to unpack source trees to. Unless ``buildroot`` is set, builds will occur in this directory too. Defaults to ``~/checkout/gnome``.
pt_br: Uma string especificando o diretório para o qual deve-se descompilar árvores de fontes. A menos que ``buildroot`` esteja especificado, as compilações ocorrerão neste diretório também. Padrão é ``~/checkout/gnome``.
sv: En sträng som anger vilken katalog som källkodsträd ska packas upp i. Om inte ``buildroot`` (byggrot) har satts kommer byggen också att ske i denna katalog. Standardvärdet är ``~/checkout/gnome``.

source: A string specifying how the checkout is performed for directories in version control. Defaults to ``update``. This can be set per module using :ref:`module_checkout_mode`. Possible values are ``update`` (update checkout directory), ``clobber`` (wipe out directory before checking out the sources), ``export`` (wipe out directory then create a tarball of the sources containing any patches) and ``copy`` (checkout in a directory different from the one it will build).
pt_br: Uma string especificando como o checkout é realizado para diretórios em controle de versão. Padrão é ``update``. Isso pode ser definido por módulo usando :ref:`module_checkout_mode`. Possíveis valores são ``update`` (atualiza o diretório de checkout), ``clobber`` (limpa o diretório antes de buscar os fontes), ``export`` (limpa o diretório e, então, cria um tarball de fontes contendo quaisquer patches) e ``copy`` (realiza o checkout em um diretório diferente daquele que será compilado).
sv: En sträng som anger hur utcheckningen görs för kataloger under versionshantering. Standardvärdet är ``update``. Detta kan ställas in för varje modul via :ref:`module_checkout_mode`. Möjliga värden är ``update`` (uppdatera katalog med utcheckning i), ``clobber`` (töm katalog innan källkod checkas ut), ``export`` (töm katalogen, skapa sedan ett tar-arkiv av källkoden samt eventuella programfixar) och ``copy`` (checka ut i en annan katalog än den som kommer att byggas).

source: A string containing arguments passed to the ``cmake`` invocation of all modules. Can be overridden for particular modules using the :ref:`module_cmakeargs` dictionary. Defaults to ``''``.
pt_br: Uma string contendo argumentos passados para a chamada de ``cmake`` de todos os módulos. Pode ser sobrescrita por módulos em particular, usando o dicionário :ref:`module_cmakeargs`. Padrão é ``''``.
sv: En sträng som innehåller argument som anges till ``cmake`-anropet för alla moduler. Kan åsidosättas för specifika moduler via uppslagsboken :ref:`module_cmakeargs`. Standardvärdet är ``''``.

source: A string specifying the directory to copy to, if the copy :ref:`checkout_mode` is in use. Defaults to the checkout directory.
pt_br: Uma string especificando o diretório para onde será copiado, se a cópia :ref:`checkout_mode` estiver em uso. Padrão é o diretório de checkout.
sv: En sträng som anger vilken katalog som ska kopieras till om värdet copy används för :ref:`checkout_mode`. Standardvärdet är utcheckningskatalogen.

source: A string specifying the directory to export to, if the export :ref:`checkout_mode` is in use. Defaults to the checkout directory.
pt_br: Uma string especificando o diretório para onde será exportado, se a exportação :ref:`checkout_mode` estiver em uso. Padrão é o diretório de checkout.
sv: En sträng som anger vilken katalog som ska kopieras till om värdet export används för :ref:`checkout_mode`. Standardvärdet är utcheckningskatalogen.

source: A string specifying which program to use for CVS support. This can be ``git-cvsimport``, or ``cvs``. Defaults to ``cvs``.
pt_br: Uma string especificando qual programa deve ser usado para dar suporte a CVS. Pode ser ``git-cvsimport`` ou ``cvs``. Padrão é ``cvs``.
sv: En sträng som anger vilket program som ska användas för CVS-stöd. Detta kan vara ``git-cvsimport`` eller ``cvs``. Standardvärdet är ``cvs``.

source: A boolean value (default ``True``) which controls if ``--disable-Werror`` will be passed to automake builds. Many packages use this flag as a way to disable fatal compiler warnings. The value of ``True`` is selected as a reasonable default for those using jhbuild as a means to get an up-to-date version of software packages without being side-tracked by build failures in other people's modules. Setting this value to ``False`` may make sense for those using jhbuild as part of a continuous integration or testing system.
pt_br: Um valor booleano (padrão ``True``) que controla se ``--disable-Werror`` vai ser passado para as compilações de automake. Muitos pacotes usam esta sinalização como uma forma de desabilitar aviso do compilador caso sejam fatais (encerra compilação). O valor de ``True`` está selecionado como um padrão razoável para aqueles usando jhbuild com a finalidade de obter uma versão atualizada de pacotes de software sem ser atrasados por falhas na compilação de módulos de outras pessoas. Configurar este valor para ``False`` pode fazer sentido para aqueles usando jhbuild como parte de um sistema de teste ou integração contínua.
sv: Ett booleskt värde (standardvärdet är ``True`` (sant)) som styr om ``--disable-Werror`` kommer att skickas till automake-byggen. Många paket använder denna flagga som ett sätt att inaktivera ödesdigra kompilatorvarningar. Värdet ``True`` är valt som ett rimligt standardvärde för de som använder jhbuild som ett sätt att få en uppdaterad version av programvarupaket utan att komma in på sidospår på grund av byggfel i andras moduler. Att ställa in detta värde till ``False`` (falskt) kan vara vettigt för de som använder jhbuild som en del av ett kontinuerligt integrations- eller testsystem.

source: A string specifying a local mirror directory. JHBuild will create local mirrors of repositories at the specified directory. The mirrors can be shared by multiple repository groups, saving space and time because hard-links will be used for local clones. The commands ``update`` and ``updateone`` will create the mirrors and fetch new commits from the online repositories. This option is only supported by Git and Bazaar repositories.
pt_br: Uma string especificando um diretório de espelho local. JHBuild vai criar espelhos locais de repositórios no diretório especificado. Os espelhos podem ser compartilhados por grupos de múltiplos diretórios, economizando espaço e tempo, porque hard-links serão usados por clones locais. Os comandos ``update`` e ``updateone`` vão criar os espelhos e obter novos commits dos repositórios online. Esta opção tem suporte apenas em repositórios Git e Bazaar.
sv: En sträng som anger en lokal katalog för spegling. JHBuild kommer att skapa lokala speglingar av arkiv i den angivna katalogen. Speglingarna kan delas av flera arkivgrupper vilket sparar utrymme och tid eftersom hårda länkar kommer att användas för lokala kloner. Kommandona ``update`` och ``updateone`` kommer att skapa speglingar och hämta nya incheckningar från arkiven på nätet. Detta alternativ stöds endast av Git- och Bazaar-arkiv.

source: A boolean value specifying whether to exit immediately when a module fails to build. This is primarily useful in noninteractive mode, in order to prevent additional modules from building after one fails. Setting this value to ``True`` is equivalent to passing the ``--exit-on-error`` option. Defaults to ``False``.
pt_br: Um valor em boolean especificando se deve-se sair imediatamente quando um módulo falhar na compilação. Isso é útil principalmente no modo não interativo, de forma a evitar que módulos adicionais sejam compilados após um falhar. Definir isso como ``True`` é equivalente a passar a opção ``--exit-on-error``. Padrão é ``False``.
sv: Ett booleskt värde som anger huruvida bygget ska avslutas omedelbart när en modul misslyckas med att bygga. Detta är framför allt användbart i icke-interaktivt läge för att förhindra ytterligare moduler från att bygga efter att en misslyckas. Att ställa in detta värde till ``True`` (sant) är ekvivalent med att ange flaggan ``--exit-on-error``. Standardvärdet är ``False`` (falskt).

source: A list of strings specifying, in precedence order, the list of extra prefixes. JHBuild sets many environment variables (such as ``LD_LIBRARY_PATH``, ``PKG_CONFIG_PATH`` and ``XDG_DATA_DIRS``) based on the ``prefix`` variable. Adding directories to ``extra_prefixes`` will cause these prefixes to be included as well, at a lower precedence than the JHBuild ``prefix``, but at a higher precedence than system directories. This variable is empty by default except on systems that install software in ``/usr/local``, in which case it contains this directory.
pt_br: Uma lista de strings especificando, por ordem de precedência, a lista de prefixos extras. JHBuild define muitas variáveis de ambiente (tais como ``LD_LIBRARY_PATH``, ``PKG_CONFIG_PATH`` e ``XDG_DATA_DIRS``) baseadas na variável ``prefix``. Adicionar diretórios a ``extra_prefixes`` vai resultar em esses prefixos serem incluídos também, em uma precedência menor do que o ``prefix`` do JHBuild, mas em uma precedência mais alta do que os diretórios do sistema. Essa variável está vazia por padrão, exceto em sistemas que instalam softwares em ``/usr/local``, caso em que ela contém esse diretório.
sv: En lista av strängar som anger i precedensordning listan över extra prefix. JHBuild ställer in många miljövariabler (såsom ``LD_LIBRARY_PATH``, ``PKG_CONFIG_PATH`` och ``XDG_DATA_DIRS``) baserat på variabeln ``prefix``. Att lägga till kataloger till ``extra_prefixes`` kommer att förorsaka att dessa prefix också kommer att inkluderas, vid en lägre precedens än den för JHBuilds ``prefix``, men vid en högre precedens än systemkatalogerna. Denna variabel är tom som standard förutom på system som installerar programvara i ``/usr/local`` i vilket fall den innehåller denna katalog.

source: A tuple specifying a help website name and URL. The website is displayed in the tinderbox html for failed modules. ``%(module)s`` in the URL will be replaced with the module name. To disable, set ``help_website`` to ``None``. Defaults to ``('Gnome Live!', 'http://live.gnome.org/JhbuildIssues/%(module)s')``.
pt_br: Uma tupla especificando o nome do site e URL de ajuda. O site é exibido no html de tinderbox para módulos que falharem. ``%(module)s`` na URL será substituído com o nome do módulo. Para desabilitar, defina ``help_website`` para ``None``. Padrão é ``('Gnome Live!', 'http://live.gnome.org/JhbuildIssues/%(module)s')``.
sv: En tupel som anger namn och URL för en hjälpwebbplats. Webbplatsen visas i tinderbox-html för misslyckade moduler. ``%(module)s`` i URL:en kommer att ersättas med modulnamnet. För att inaktivera ställ in ``help_website`` till ``None`` (ingen). Standardvärdet är ``('Gnome Live!', 'http://live.gnome.org/JhbuildIssues/%(module)s')``.

source: A string specifying a program to use as replacement for ``/usr/bin/install``.
pt_br: Uma string especificando um programa a ser usado como substituto para ``/usr/bin/install``.
sv: En sträng som anger vilket program som ska användas som ersättning för ``/usr/bin/install``.

source: A boolean value specifying whether to ignore soft dependencies when calculating the dependency tree. Defaults to ``False``.
pt_br: Um valor em boolean especificando se deve-se ignorar dependências ao se calcular a árvore de dependência. Padrão é ``False``.
sv: Ett booleskt värde som anger huruvida mjuka beroenden ska hoppas över när beroendeträdet beräknas. Standardvärdet är ``False`` (falskt).

source: A boolean value specifying whether to interact with the user. Setting this value to ``False`` is equivalent to passing the ``--no-interact`` option. Defaults to ``True``.
pt_br: Um valor em boolean especificando se deve-se interagir com o usuário. Definindo este valor para ``False`` é equivalente a passar a opção ``--no-interact``. Padrão é ``True``.
sv: Ett booleskt värde som anger huruvida bygget ska interagera med användaren. Om detta värde ställs in på ``False`` (falskt) är det ekvivalent med att ange flaggan ``--no-interact``. Standardvärdet är ``True`` (sant).

source: A string listing additional arguments to be passed to :command:`make`. JHBuild will automatically append the parallel execution option (``-j``) based upon available CPU cores. Defaults to ``''``.
pt_br: Um texto listando argumentos adicionais a serem passados para o :command:`make`. JHBuild vai anexar automaticamente a opção de execução paralela (``-j``) baseada nos núcleos de CPU disponíveis. Padrão é ``''``.
sv: En sträng som listar ytterligare argument som ska anges till :command:`make`. JHBuild kommer automatiskt att lägga till den parallella exekveringsflaggan (``-j``) baserat på antalet tillgängliga CPU-kärnor. Standardvärdet är ``''``.

source: A boolean value specifying whether to run :command:`make check` after :command:`make`. Defaults to ``False``.
pt_br: Um valor em boolean especificando se deve-se executar :command:`make check` após :command:`make`. Padrão é ``False``.
sv: Ett booleskt värde som anger huruvida :command:`make check` ska köras efter :command:`make`. Standardvärdet är ``False`` (falskt).

source: A boolean value specifying whether failures when running :command:`make check` should be advisory only and not cause a build failure. Defaults to ``False``.
pt_br: Um valor em boolean especificando se as falhas ao executar :command:`make check` deveriam ser avisos e não causar uma falha de compilação. Padrão é ``False``.
sv: Ett booleskt värde som anger huruvida fel vid körning av :command:`make check` endast ska vara rådgivande och inte orsakar byggfel. Standardvärdet är ``False`` (falskt).

source: A boolean value specifying whether to run :command:`make clean` before :command:`make`. Defaults to ``False``.
pt_br: Um valor boolean especificando se deve-se executar :command:`make clean` antes de :command:`make`. Padrão é ``False``.
sv: Ett booleskt värde som anger huruvida :command:`make clean` ska köras före :command:`make`. Standardvärdet är ``False`` (falskt).

source: A boolean value specifying whether to run :command:`make dist` after :command:`make`. Defaults to ``False``. This setting is equivalent to passing the ``--dist`` option.
pt_br: Um valor em boolean especificando se deve-se executar :command:`make dist` após :command:`make`. Padrão é ``False``. Esta configuração é equivalente a passar a opção ``--dist``.
sv: Ett booleskt värde som anger huruvida :command:`make dist` ska köras efter :command:`make`. Standardvärdet är ``False`` (falskt). Denna inställning är ekvivalent med att ange flaggan ``--dist``.

source: A boolean value specifying whether to run ``make distcheck`` after :command:`make`. Defaults to ``False``. This setting is equivalent to passing the ``--distcheck`` option.
pt_br: Um valor em boolean especificando se deve-se executar ``make distcheck`` após :command:`make`. Padrão é ``False``. Esta configuração é equivalente a passar a opção ``--distcheck``.
sv: Ett booleskt värde som anger huruvida ``make distcheck`` ska köras efter :command:`make`. Standardvärdet är ``False`` (falskt). Denna inställning är ekvivalent med att ange flaggan ``--distcheck``.

source: A string containing arguments passed to the :command:`meson` invocation of all modules. Can be overridden for particular modules using the ``module_mesonargs`` dictionary. Defaults to ``''``.
pt_br: Uma string contendo argumentos passados para a chamada de :command:`meson` de todos os módulos. Pode ser sobrescrita por módulos em particular, usando o dicionário ``module_mesonargs``. Padrão é ``''``.
sv: En sträng som innehåller argument som anges till :command:`meson`-anropet för alla moduler. Kan åsidosättas för specifika moduler via uppslagsboken ``module_mesonargs``. Standardvärdet är ``''``.

source: A dictionary mapping module names to strings specifying the arguments to be passed to ``autogen.sh``. The setting in :ref:`module_autogenargs` is used instead of the global :ref:`autogenargs` setting. If a particular module isn't listed in the dictionary, the global :ref:`autogenargs` will be used.
pt_br: Um dicionário mapeando os nomes de módulos em strings especificando os argumentos a serem passados para o ``autogen.sh``. A configuração em :ref:`module_autogenargs` é usada, em vez da configuração global :ref:`autogenargs`. Se um módulo particular não está listado no diretório, a global :ref:`autogenargs` será usada.
sv: En uppslagsbok som mappar modulnamn till strängar som anger argumenten som ska skickas till ``autogen.sh``. Inställningen i :ref:`module_autogenargs` används i stället för den globala :ref:`autogenargs`-inställningen. Om en viss modul inte listas i uppslagsboken kommer den globala :ref:`autogenargs` att användas.

source: A dictionary specifying which checkout mode to use for modules. This overrides the global :ref:`checkout_mode` setting.
pt_br: Um dicionário especificando quais modos de checkout devem ser usados para os módulos. Isso sobrescreve a configuração global :ref:`checkout_mode`.
sv: En uppslagsbok som anger vilket utcheckningsläge som ska användas för moduler. Detta åsidosätter den globala inställningen :ref:`checkout_mode`.

source: A dictionary mapping module names to strings specifying the arguments to be passed to :command:`cmake`. The setting in :ref:`module_cmakeargs` is used instead of the global :ref:`cmakeargs` setting. If a particular module isn’t listed in the dictionary, the global :ref:`cmakeargs` will be used.
pt_br: Um dicionário mapeando os nomes de módulos em strings especificando os argumentos a serem passados para o :command:`cmake`. A configuração em :ref:`module_cmakeargs` é usada, em vez da configuração global :ref:`cmakeargs`. Se um módulo particular não está listado no diretório, a global :ref:`cmakeargs` será usada.
sv: En uppslagsbok som mappar modulnamn till strängar som anger argumenten som ska skickas till :command:`cmake`. Inställningen i :ref:`module_cmakeargs` används i stället för den globala :ref:`cmakeargs`-inställningen. Om en viss modul inte listas i uppslagsboken kommer den globala :ref:`cmakeargs` att användas.

source: A dictionary mapping module names to strings specifying the arguments to pass to :command:`make`. The setting in :ref:`module_makeargs` replaces the value of :ref:`makeargs`. If a particular module isn't listed in the dictionary, the global :ref:`makeargs` will be used.
pt_br: Um dicionário mapeando os nomes de módulos em strings especificando os argumentos a serem passados para :command:`make`. A configuração em :ref:`module_makeargs` substitui o valor de :ref:`makeargs`. Se um módulo em particular não está listado no dicionário, a global :ref:`makeargs` será usada.
sv: En uppslagsbok som mappar modulnamn till strängar som anger argument som ska skickas till :command:`make`. Inställningen :ref:`module_makeargs` ersätter värdet från :ref:`makeargs`. Om en viss modul inte finns listad i uppslagsboken kommer den globala :ref:`makeargs` att användas.

source: A dictionary mapping module names to boolean values specifying whether to run ``make check`` after ``make``. The setting in :ref:`module_makecheck` replaces the value of :ref:`makecheck`. If a particular module isn't listed in the dictionary, the global :ref:`makecheck` will be used.
pt_br: Um dicionário mapeando os nomes de módulos em valores boolean especificando se deve-se executar ``make check`` após ``make``. A configuração em :ref:`module_makecheck` substitui o valor de :ref:`makecheck`. Se um módulo em particular não estiver listado no dicionário, a global :ref:`makecheck` será usada.
sv: En uppslagsbok som mappar modulnamn till booleska värden som anger huruvida ``make check`` ska köras efter ``make``. Inställningen :ref:`module_makecheck` ersätter värdet från :ref:`makecheck`. Om en viss modul inte finns listad i uppslagsboken kommer den globala :ref:`makecheck` att användas.

source: A dictionary mapping module names to strings specifying the arguments to be passed to ``meson``. The setting in :ref:`module_mesonargs` is used instead of the global :ref:`mesonargs` setting. If a particular module isn’t listed in the dictionary, the global :ref:`mesonargs` will be used.
pt_br: Um dicionário mapeando os nomes de módulos em strings especificando os argumentos a serem passados para o ``meson``. A configuração em :ref:`module_mesonargs` é usada, em vez da configuração global :ref:`mesonargs`. Se um módulo particular não está listado no diretório, a global :ref:`mesonargs` será usada.
sv: En uppslagsbok som mappar modulnamn till strängar som anger argumenten som ska skickas till ``meson``. Inställningen i :ref:`module_mesonargs` används i stället för den globala :ref:`mesonargs`-inställningen. Om en viss modul inte listas i uppslagsboken kommer den globala :ref:`mesonargs` att användas.

source: A dictionary mapping module names to strings specifying the arguments to pass to ``ninja``. The setting in :ref:`module_ninjaargs` replaces the value of :ref:`ninjaargs`. If a particular module isn't listed in the dictionary, the global :ref:`ninjaargs` will be used.
pt_br: Um dicionário mapeando os nomes de módulos em strings especificando os argumentos a serem passados para ``ninja``. A configuração em :ref:`module_ninjaargs` substitui o valor de :ref:`ninjaargs`. Se um módulo em particular não está listado no dicionário, a global :ref:`ninjaargs` será usada.
sv: En uppslagsbok som mappar modulnamn till strängar som anger argument som ska skickas till ``ninja``. Inställningen i :ref:`module_ninjaargs` ersätter värdet från :ref:`ninjaargs`. Om en viss modul inte finns listad i uppslagsboken kommer den globala :ref:`ninjaargs` att användas.

source: A dictionary mapping module names to boolean values. If a module is set to ``True``, JHBuild will attempt to build dependent modules even if the specified module failed. The setting in :ref:`module_nopoison` replaces the value of :ref:`nopoison`. If a particular module isn't listed in the dictionary, the global :ref:`nopoison` will be used.
pt_br: Um dicionário mapeando os nomes de módulos em valores boolean. Se um módulo estiver definido como ``True``, JHBuild vai tentar compilar módulos dependentes mesmo se um módulo especificado falhar. A configuração em :ref:`module_nopoison` substitui o valor de :ref:`nopoison`. Se um módulo em particular não estiver listado no dicionário, a global :ref:`nopoison` será usada.
sv: En uppslagsbok som mappar modulnamn till booleska värden. Om en modul är inställd på ``True`` (sant) kommer JHBuild att försöka att bygga modulberoenden även om den angivna modulen misslyckades. Inställningen i :ref:`module_nopoison` ersätter värdet från :ref:`nopoison`. Om en viss modul inte listas i uppslagsboken kommer den globala :ref:`nopoison` att användas.
