Repository: GNOME/jhbuild
Catalog: doc/po/*/LC_MESSAGES/docs.po
Languages: pt_br, sv

source: The other attributes and the ``dependencies``, ``suggests`` and ``after`` elements are processed as for :ref:`autotools`.
pt_br: Os outros atributos e os elementos ``dependencies``, ``suggests`` e ``after`` são processados conforme :ref:`autotools`.
sv: De andra attributen och elementen ``dependencies``, ``suggests`` och ``after`` behandlas som för :ref:`autotools`.

source: System
pt_br: Sistema
