Repository: GNOME/jhbuild
Catalog: po/*.po
Languages: bg, el, eo, hi, ru, uz

source: Call to undefined command
bg: Извикване на недефинирана команда
el: Κλήση σε μη ορισμένη εντολή
eo: Voko al nedifinita komando
hi: अपरिभाषित कमांड को कॉल
ru: Вызов неопределённой команды
uz: Aniqlanmagan buyruqqa qo'ng'iroq qiling

source: file not in cache, but not allowed to check network
bg: файлът не е в кеша, но не е позволено да се проверява мрежата
el: το αρχείο δεν είναι στη λανθάνουσα μνήμη, αλλά δεν επιτρέπεται ο έλεγχος του δικτύου
eo: dosiero ne estas en kaŝmemoro, kaj ne rajtas kontroli la reton
hi: फाइल कैशे में नहीं है, लेकिन नेटवर्क की जांच करने की अनुमति नहीं है
ru: файла нет в кэше, но проверка сети запрещена
uz: fayl keshda emas, lekin tarmoqni tekshirishga ruxsat berilmagan

source: package %s has files with embedded new lines
bg: пакетът „%s“ има файлове с вградени нови редове
el: το πακέτο %s έχει αρχεία με ενσωματωμένες αλλαγές γραμμής
eo: pako %s havas dosierojn kun ingluitaj linisaltoj
hi: पैकेज %s में नई पंक्तियों वाली फाइलें हैं
ru: пакет %s имеет файлы со встроенными символами новой строки
uz: %s paketida yangi qatorlar kiritilgan fayllar mavjud

source: no manifest for '%s', can't uninstall. Try building again, then uninstalling.
bg: няма манифест за „%s“, не може да се деинсталира. Опитайте да изградите отново, а след това да деинсталирате.
eo: neniu manifesta por '%s', ne eblas malinstali. Provu rekonstrui, poste malinstali.
hi: '%s' के लिए कोई मैनिफ़ेस्ट नहीं है, अस्थापित नहीं किया जा सकता। फिर से निर्माण करने का प्रयास करें, फिर अस्थापित करें।
ru: нет манифеста для «%s», удаление невозможно. Попробуйте выполнить сборку ещё раз, а затем удалить.
uz: “%s” uchun manifest yoʻq, oʻchirib boʻlmaydi. Qayta qurishga urinib ko'ring, keyin o'chirib tashlang.

source: Failed to delete %(file)r: %(msg)s
bg: Неуспешно изтриване на „%(file)r“: %(msg)s
el: Αποτυχία διαγραφής του %(file)r: %(msg)s
eo: Malsukcesis forigi %(file)r: %(msg)s
hi: %(file)r को हटाने में विफल: %(msg)s
ru: Не удалось удалить %(file)r: %(msg)s
uz: %(file)r oʻchirib tashlanmadi: %(msg)s

source: No suitable root privilege command found; you should install "sudo" or "pkexec" (or the system package that provides it)
bg: Липсва подходяща команда с привилегии на основен потребител. Трябва да инсталирате „sudo“ или „pkexec“ (или системния пакет, който ги предоставя)
el: Δεν βρέθηκε κατάλληλη εντολή για δικαιώματα υπερχρήστη· θα πρέπει να εγκαταστήσετε το "sudo" ή το "pkexec" (ή το πακέτο συστήματος που το παρέχει)
eo: Ne troviĝis taŭga komando por radik-privilegioj; vi devus instali "sudo" aŭ "pkexec" (aŭ la sisteman pakon kiu provizas ĝin)
hi: कोई उपयुक्त रूट विशेषाधिकार कमांड नहीं मिला; आपको "sudo" या "pkexec" (या इसे प्रदान करने वाला सिस्टम पैकेज) स्थापित करना चाहिए
ru: Не найдено подходящей команды для получения прав root; вам следует установить «sudo» или «pkexec» (или системный пакет, который их предоставляет)
uz: Tegishli ildiz huquqi buyrug'i topilmadi; siz "sudo" yoki "pkexec" ni (yoki uni ta'minlaydigan tizim paketini) o'rnatishingiz kerak.

source: Error: python-gobject package not found.
bg: Грешка: пакетът „python-gobject“ липсва.
el: Σφάλμα: το πακέτο python-gobject δεν βρέθηκε.
eo: Eraro: pako python-gobject ne troviĝis.
hi: त्रुटि: python-gobject पैकेज नहीं मिला।
ru: Ошибка: пакет python-gobject не найден.
uz: Xato: python-gobject paketi topilmadi.

source: Error: dbus-python package not found.
bg: Грешка: пакетът „dbus-python“ липсва.
el: Σφάλμα: το πακέτο dbus-python δεν βρέθηκε.
eo: Eraro: pako dbus-python ne troviĝis.
hi: त्रुटि: dbus-python पैकेज नहीं मिला।
ru: Ошибка: пакет dbus-python не найден.
uz: Xato: dbus-python paketi topilmadi.

source: Computing packages to install. This might be slow. Please wait.
bg: Изчисляване на пакетите за инсталиране. Това може да е бавно. Изчакайте.
el: Υπολογισμός πακέτων προς εγκατάσταση. Αυτό μπορεί να είναι αργό. Παρακαλούμε περιμένετε.
eo: Kalkulante pakojn por instali. Ĉi tio povas esti malrapida. Bonvolu atendi.
hi: स्थापित करने के लिए कंप्यूटिंग पैकेज। यह धीमा हो सकता है। कृपया प्रतीक्षा करें।
ru: Вычисление пакетов для установки. Это может занять некоторое время. Пожалуйста, подождите.
uz: O'rnatish uchun hisoblash paketlari. Bu sekin bo'lishi mumkin. Iltimos kuting.

source: Nothing available to install
bg: Няма нищо за инсталиране
el: Τίποτα διαθέσιμο προς εγκατάσταση
eo: Nenio disponebla por instali
hi: स्थापित करने के लिए कुछ भी उपलब्ध नहीं है
ru: Нечего устанавливать
uz: O'rnatish uchun hech narsa mavjud emas

source: Installing: %s
bg: Инсталиране: %s
eo: Instalante: %s
hi: स्थापित किया जा रहा है: %s
ru: Устанавливаются: %s
uz: O'rnatish: %s

source: This might take a very long time. Do not turn off your computer. You can run 'pkmon' to monitor progress.
bg: Това може да отнеме много дълго време. Не изключвайте компютъра си. Може да изпълните „pkmon“, за да следите напредъка.
el: Αυτό μπορεί να διαρκέσει πολύ. Μην απενεργοποιήσετε τον υπολογιστή σας. Μπορείτε να εκτελέσετε το 'pkmon' για να παρακολουθήσετε την πρόοδο.
eo: Tio povas daŭri tre longe. Ne malŝaltu vian komputilon. Vi povas ruli 'pkmon' por monitori la progreson.
hi: इसमें बहुत लंबा समय लग सकता है। अपना कंप्यूटर बंद न करें। प्रगति की निगरानी के लिए आप 'pkmon' चला सकते हैं।
ru: Это может занять очень много времени. Не выключайте компьютер. Вы можете запустить 'pkmon' для отслеживания прогресса.
uz: Bu juda uzoq vaqt talab qilishi mumkin. Kompyuteringizni o'chirmang. Taraqqiyotni kuzatish uchun "pkmon" ni ishga tushirishingiz mumkin.

source: Complete!
bg: Завършено!
el: Ολοκληρώθηκε!
eo: Komplete!
hi: पूर्ण!
ru: Готово!
uz: Sozlashni tugallash!

source: Using dnf to install packages. Please wait.
bg: Използване на „dnf“ за инсталиране на пакети. Изчакайте.
eo: Uzante dnf por instali pakojn. Bonvolu atendi.
hi: पैकेज स्थापित करने के लिए dnf का उपयोग किया जा रहा है। कृपया प्रतीक्षा करें।
ru: Используется dnf для установки пакетов. Пожалуйста, подождите.
uz: Paketlarni o'rnatish uchun dnf dan foydalaning. Iltimos kuting.

source: Nothing to install
bg: Няма нищо за инсталиране
el: Τίποτα προς εγκατάσταση
eo: Nenio por instali
hi: स्थापित करने के लिए कुछ नहीं
ru: Нечего устанавливать
uz: O'rnatish uchun hech narsa yo'q

source: Install failed
bg: Неуспешно инсталиране
el: Η εγκατάσταση απέτυχε
eo: Instalo malsukcesis
hi: स्थापना विफल
ru: Установка не удалась
uz: O‘rnatish amalga oshmadi

source: Completed!
bg: Завършено!
el: Ολοκληρώθηκε!
eo: Plenumite!
hi: पूर्ण!
ru: Завершено!
uz: Bajarildi!

source: pkgfile not found, automatically installing
bg: „pkgfile“ липсва, инсталира се автоматично
el: το pkgfile δεν βρέθηκε, αυτόματη εγκατάσταση
eo: pkgfile ne troviĝis, aŭtomate instalante
hi: pkgfile नहीं मिला, स्वचालित रूप से स्थापित हो रहा है
ru: pkgfile не найден, автоматическая установка
uz: pkgfile topilmadi, avtomatik o'rnatilmoqda

source: Failed to install pkgfile
bg: Неуспешно инсталиране на „pkgfile“
el: Αποτυχία εγκατάστασης του pkgfile
eo: Malsukcesis instali pkgfile
hi: pkgfile स्थापित करने में विफल
ru: Не удалось установить pkgfile
uz: pkgfile o'rnatib bo'lmadi

source: pkgfile cache is old or doesn't exist, automatically updating
bg: Кешът на „pkgfile“ е стар или не съществува, обновява се автоматично
el: η λανθάνουσα μνήμη του pkgfile είναι παλιά ή ανύπαρκτη, αυτόματη ενημέρωση
eo: La kaŝmemoro de pkgfile estas malnova aŭ ne ekzistas; aŭtomate ĝisdatigante
hi: pkgfile कैशे पुराना है या मौजूद नहीं है, स्वचालित रूप से अद्यतित हो रहा है
ru: кэш pkgfile устарел или не существует, автоматическое обновление
uz: pkgfile keshi eski yoki mavjud emas, avtomatik yangilanadi

source: Failed to create pkgfile cache
bg: Неуспешно създаване на кеша на „pkgfile“
el: Αποτυχία δημιουργίας λανθάνουσας μνήμης pkgfile
eo: Malsukcesis krei kaŝmemoron de pkgfile
hi: pkgfile कैशे बनाने में विफल
ru: Не удалось создать кэш pkgfile
uz: pkgfayl keshini yaratib bo'lmadi

source: Failed to update pkgfile cache
bg: Неуспешно обновяване на кеша на „pkgfile“
el: Αποτυχία ενημέρωσης λανθάνουσας μνήμης pkgfile
eo: Malsukcesis ĝisdatigi la kaŝmemoron de pkgfile
hi: pkgfile कैशे अद्यतन करने में विफल
ru: Не удалось обновить кэш pkgfile
uz: pkgfile keshini yangilab bo‘lmadi

source: Successfully updated pkgfile cache
bg: Кешът на „pkgfile“ е обновен успешно
el: Επιτυχής ενημέρωση λανθάνουσας μνήμης pkgfile
eo: Sukcese ĝisdatigis la kaŝmemoron de pkgfile
hi: pkgfile कैशे सफलतापूर्वक अद्यतित
ru: Кэш pkgfile успешно обновлён
uz: pkgfayl keshi muvaffaqiyatli yangilandi

source: Using pacman to install packages. Please wait.
bg: Използване на „pacman“ за инсталиране на пакети. Изчакайте.
eo: Uzante pacman por instali pakojn. Bonvolu atendi.
hi: पैकेज स्थापित करने के लिए pacman का उपयोग किया जा रहा है। कृपया प्रतीक्षा करें।
ru: Используется pacman для установки пакетов. Пожалуйста, подождите.
uz: Paketlarni o'rnatish uchun pacman dan foydalanish. Iltimos kuting.

source: Provider for "%s" was not found, ignoring
bg: Доставчикът за „%s“ не е намерен, прескачане
el: Δεν βρέθηκε πάροχος για το "%s", παράβλεψη
eo: Provizanto por "%s" ne troviĝis; ignorante
hi: "%s" के लिए प्रदाता नहीं मिला, अनदेखा किया गया
ru: Поставщик для «%s» не найден, игнорируется
uz: “%s” uchun provayder topilmadi, eʼtiborga olinmadi

source: No native package found for %(id)s (%(filename)s)
bg: Липсва системен пакет за %(id)s (%(filename)s)
el: Δεν βρέθηκε εγγενές πακέτο για το %(id)s (%(filename)s)
eo: Neniu indiĝena pako trovita por %(id)s (%(filename)s)
hi: %(id)s (%(filename)s) के लिए कोई मूल पैकेज नहीं मिला
ru: Не найден нативный пакет для %(id)s (%(filename)s)
uz: %(id)s (%(filename)s) uchun mahalliy paket topilmadi

source: Installing: %(pkgs)s
bg: Инсталиране: %(pkgs)s
el: Εγκατάσταση: %(pkgs)s
eo: Instalante: %(pkgs)s
hi: स्थापित हो रहा है: %(pkgs)s
ru: Установка: %(pkgs)s
uz: Oʻrnatilmoqda: %(pkgs)s

source: Please install apt-file first.
bg: Първо инсталирайте „apt-file“.
el: Παρακαλούμε εγκαταστήστε πρώτα το apt-file.
eo: Bonvolu unue instali apt-file.
hi: कृपया पहले apt-file स्थापित करें।
ru: Пожалуйста, сначала установите apt-file.
uz: Iltimos, avval apt-faylni o'rnating.

source: Using apt-file to search for providers; this may be extremely slow. Please wait. Patience!
bg: Използване на „apt-file“ за търсене на доставчици. Това може да е много бавно. Изчакайте.
el: Χρήση του apt-file για αναζήτηση παρόχων· αυτό μπορεί να είναι εξαιρετικά αργό. Παρακαλούμε περιμένετε. Υπομονή!
eo: Uzante apt-file por serĉi provizantojn; tio povas esti tre malrapida. Bonvolu atendi. Paciencon!
hi: प्रदाताओं की खोज के लिए apt-file का उपयोग करना; यह अत्यंत धीमा हो सकता है। कृपया प्रतीक्षा करें। धैर्य रखें!
ru: Используется apt-file для поиска поставщиков; это может быть очень медленно. Пожалуйста, подождите. Терпение!
uz: Provayderlarni qidirish uchun apt-fayldan foydalanish; bu juda sekin bo'lishi mumkin. Iltimos kuting. Sabr!

source: No keys specified in trigger script %r
bg: Няма зададени ключове в спусъчния команден файл %r
el: Δεν καθορίστηκαν κλειδιά στη δέσμη ενεργειών εναύσματος %r
eo: Neniuj ŝlosiloj specifitaj en la ekigila skripto %r
hi: ट्रिगर स्क्रिप्ट %r में कोई कुंजियां निर्दिष्ट नहीं हैं
ru: В скрипте-триггере %r не указаны ключи
uz: %r trigger skriptida hech qanday kalit belgilanmagan

source: Failed to unpack %s (unknown archive type)
bg: Неуспешно разархивиране на „%s“ (неизвестен вид архив)
el: Αποτυχία αποσυμπίεσης του %s (άγνωστος τύπος αρχειοθήκης)
eo: Malsukcesis malpaki %s (nekonata arkiv-tipo)
hi: %s (अज्ञात संग्रह प्रकार) को अनपैक करने में विफल
ru: Не удалось распаковать %s (неизвестный тип архива)
uz: %s (arxiv turi noma'lum) paketdan chiqarilmadi

source: Failed to unpack %s
bg: Неуспешно разархивиране на „%s“
el: Αποτυχία αποσυμπίεσης του %s
eo: Malsukcesis malpaki %s
hi: %s को अनपैक करने में विफल
ru: Не удалось распаковать %s
uz: %s paketdan chiqarilmadi

source: Failed to unpack %s (empty file?)
bg: Неуспешно разархивиране на „%s“ (да не е празен файла?)
el: Αποτυχία αποσυμπίεσης του %s (κενό αρχείο;)
eo: Malsukcesis malpaki %s (malplena dosiero?)
hi: %s को अनपैक करने में विफल (खाली फाइल?)
ru: Не удалось распаковать %s (пустой файл?)
uz: %s (boʻsh faylmi?)

source: branch for %(name)s has wrong override, check your %(filename)s
bg: клонът за „%(name)s“ има грешна промяна, проверете „%(filename)s“
el: ο κλάδος για το %(name)s έχει λάθος παράκαμψη, ελέγξτε το %(filename)s σας
eo: branĉo por %(name)s havas malĝustan transregulon; kontrolu vian %(filename)s
hi: %(name)s की शाखा में गलत ओवरराइड है, अपने %(filename)s की जांच करें
ru: ветка для %(name)s имеет неверное переопределение, проверьте ваш %(filename)s
uz: %(name)s filiali notoʻgʻri bekor qilingan, %(filename)s-ni tekshiring

source: attribute is deprecated. Use revspec instead.
bg: атрибутът е изоставен. Използвайте „revspec“.
el: η ιδιότητα είναι παρωχημένη. Χρησιμοποιήστε το revspec στη θέση της.
eo: atributo estas evitinda. Uzu anstataŭe revspec.
hi: विशेषता बहिष्कृत है। इसके बजाय revspec का उपयोग करें।
ru: атрибут устарел. Используйте вместо него revspec.
uz: atribut eskirgan. Buning o'rniga revspec dan foydalaning.

source: Path %s does not seem to be a checkout from dvcs_mirror_dir. Remove it or change your dvcs_mirror_dir settings.
bg: Пътят „%s“ не изглежда да е изтегляне от „dvcs_mirror_dir“. Премахнете го или променете настройките .
el: Η διαδρομή %s δεν φαίνεται να είναι εξαγωγή (checkout) από το dvcs_mirror_dir. Αφαιρέστε το ή αλλάξτε τις ρυθμίσεις του dvcs_mirror_dir.
eo: Ŝajnas, ke la vojo %s ne estas elpreno el dvcs_mirror_dir. Forigu ĝin aŭ ŝanĝu viajn agordojn de dvcs_mirror_dir.
hi: पथ %s dvcs_mirror_dir से चेकआउट प्रतीत नहीं होता है। इसे हटाएं या अपनी dvcs_mirror_dir सेटिंग्स बदलें।
ru: Путь %s, по-видимому, не является извлечением из dvcs_mirror_dir. Удалите его или измените настройки dvcs_mirror_dir.
uz: %s-yoʻl dvcs_mirror_dir-dan toʻlov emas. Uni olib tashlang yoki dvcs_mirror_dir sozlamalarini o'zgartiring.

source: could not log into %s
bg: неуспешно вписване в „%s“
el: αδυναμία σύνδεσης στο %s
eo: ne eblis ensaluti en %s
hi: %s में लॉग इन नहीं किया जा सका
ru: не удалось войти в %s
uz: %s ga kira olmadi

source: %s is not managed by CVS
bg: „%s“ не се управлява от CVS
el: Το %s δεν διαχειρίζεται από το CVS
eo: %s ne estas administrata per CVS
hi: %s CVS द्वारा प्रबंधित नहीं है
ru: %s не управляется CVS
uz: %s CVS tomonidan boshqarilmaydi

source: "%s" does not appear to be a CVS working copy
bg: „%s“ не изглежда да е работещо CVS копие
el: Το "%s" δεν φαίνεται να είναι αντίγραφο εργασίας του CVS
eo: "%s" ŝajne ne estas CVS-labortipa kopio
hi: "%s" CVS कार्यशील प्रतिलिपि प्रतीत नहीं होती है
ru: «%s» не является рабочей копией CVS
uz: “%s” CVS ishchi nusxasi emas

source: working copy points at the wrong repository (expected %(root1)s but got %(root2)s).
bg: работното копие сочи към грешното хранилище (очакваше се „%(root1)s“, но полученото е „%(root2)s“).
el: το αντίγραφο εργασίας δείχνει σε λάθος αποθετήριο (αναμενόταν %(root1)s αλλά βρέθηκε %(root2)s).
eo: laborkopio montras al la malĝusta deponejo (atendita %(root1)s sed ricevita %(root2)s).
hi: कार्यशील प्रतिलिपि गलत रिपोजिटरी पर इंगित करती है (अपेक्षित %(root1)s लेकिन प्राप्त %(root2)s)।
ru: рабочая копия указывает на неверный репозиторий (ожидался %(root1)s, но получен %(root2)s)
uz: noto'g'ri omborda ishlaydigan nusxa ko'chirish nuqtalari (kutilgan %(root1)s, lekin %(root2)s ga ega).

source: Consider using the changecvsroot.py script to fix this.
bg: Помислете дали да не използвате командния файл „changecvsroot.py“, за да коригирате това.
el: Σκεφτείτε να χρησιμοποιήσετε τη δέσμη ενεργειών changecvsroot.py για να το διορθώσετε.
eo: Konsideru uzi la skripton changecvsroot.py por ripari tion.
hi: इसे ठीक करने के लिए changecvsroot.py स्क्रिप्ट का उपयोग करने पर विचार करें।
ru: Рассмотрите возможность использования скрипта changecvsroot.py для исправления.
uz: Buni tuzatish uchun changecvsroot.py skriptidan foydalanishni o'ylab ko'ring.

source: date based checkout not yet supported
bg: изтегляне на база на дата все още не се поддържа
el: η εξαγωγή με βάση την ημερομηνία δεν υποστηρίζεται ακόμη
eo: dato-bazita elpreno ankoraŭ ne subtenata
hi: तिथि आधारित चेकआउट अभी तक समर्थित नहीं है
ru: извлечение по дате пока не поддерживается
uz: sanaga asoslangan to'lov hali qo'llab-quvvatlanmaydi

source: ignored bad branch redefinition for module:
bg: игнорирано е лошо предефиниране на клон за модул:
el: αγνοήθηκε εσφαλμένος επαναορισμός κλάδου για το άρθρωμα:
eo: ignorita malbona branĉ-redifino por modulo:
hi: मॉड्यूल के लिए खराब शाखा पुनर्परिभाषा को नजरअंदाज किया गया:
ru: проигнорировано неверное переопределение ветки для модуля:
uz: modul uchun noto'g'ri filialni qayta aniqlash e'tiborga olinmadi:

source: Need at least git-%s to operate
bg: За работа се изисква поне git-%s
el: Χρειάζεται τουλάχιστον το git-%s για να λειτουργήσει
eo: Bezonas almenaŭ git-%s por funkcii
ru: Для работы требуется как минимум git-%s
uz: Ishlash uchun kamida git-%s kerak

source: Cannot set "version" of a git branch without "tag"
bg: Задаването на версия „version“ на клон изисква етикет „tag“
el: Αδυναμία ορισμού "έκδοσης" σε κλάδο git χωρίς "ετικέτα"
eo: Ne eblas agordi "version" de git-branĉo sen "tag"
ru: Невозможно установить «версию» для ветки git без «метки»
uz: Git filialining "versiyasini" tegsiz o'rnatib bo'lmaydi

source: Unexpected: Checkoutdir is not a git repository:
bg: Неочаквано: директорията за изтегляне не е хранилище на git:
el: Μη αναμενόμενο: Το Checkoutdir δεν είναι αποθετήριο git:
eo: Neatendite: Checkoutdir ne estas git-deponejo:
hi: अप्रत्याशित: Checkoutdir एक git रिपोजिटरी नहीं है:
ru: Неожиданно: каталог извлечения не является репозиторием git:
uz: Kutilmagan: Checkoutdir git ombori emas:

source: The requested branch "%s" is not available. Neither locally, nor remotely in the origin remote.
bg: Заявеният клон „%s“ не е наличен. Нито локално, нито в отдалеченото хранилище.
el: Ο αιτούμενος κλάδος "%s" δεν είναι διαθέσιμος. Ούτε τοπικά, ούτε απομακρυσμένα στο origin remote.
eo: La petita branĉo "%s" ne disponeblas. Nek loke, nek distance en la 'origin' fora deponejo.
hi: अनुरोधित शाखा "%s" उपलब्ध नहीं है। न तो स्थानीय रूप से, न ही मूल रिमोट में दूरस्थ रूप से।
ru: Запрошенная ветка «%s» недоступна. Ни локально, ни на удалённом сервере origin.
uz: Soʻralgan “%s” filiali mavjud emas. Na mahalliy, na masofaviy masofadan turib.

source: Refusing to switch a dirty tree.
bg: Отказване от превключване на променено дърво.
el: Άρνηση αλλαγής σε δέντρο με μη καταχωρημένες αλλαγές (dirty).
eo: Rifuzas ŝalti malpuran arbon.
hi: गंदे ट्री पर जाने से इंकार किया जा रहा है।
ru: Отказ в переключении «грязного» дерева.
uz: Nopok daraxtni almashtirishdan bosh tortish.

source: Command %s returned no output
bg: Командата „%s“ не върна резултат
el: Η εντολή %s δεν επέστρεψε έξοδο
eo: Komando %s ne liveris eligon
hi: कमांड %s ने कोई आउटपुट नहीं दिया
ru: Команда %s ничего не вернула в качестве вывода
uz: %s buyrug'i hech qanday natija bermadi

source: Command %s did not include commit line: %r
bg: Командата „%s“ не включи реда за подаване: %r
el: Η εντολή %s δεν περιελάμβανε γραμμή καταχώρισης (commit): %r
eo: Komando %s ne inkludis ""commit""-linion: %r
hi: कमांड %s में कमिट लाइन शामिल नहीं थी: %r
ru: Вывод команды %s не содержал строку коммита: %r
uz: %s buyrug‘i majburiy qatorni o‘z ichiga olmagan: %r

source: Failed to update module as it switched to git (you should check for changes then remove the directory).
bg: Mодулът не може се обнови, тъй като той премина към git (трябва да проверите за промени и след това да премахнете директорията).
el: Αποτυχία ενημέρωσης του αρθρώματος καθώς άλλαξε σε git (θα πρέπει να ελέγξετε για αλλαγές και μετά να αφαιρέσετε τον κατάλογο).
eo: Malsukcesis ĝisdatigi la modulon dum ŝanĝo al git (vi devus kontroli ŝanĝojn kaj poste forigi la dosierujon).
hi: मॉड्यूल को अद्यतन करने में विफलता हुई क्योंकि यह git पर स्विच हो गया था (आपको परिवर्तनों की जांच करनी चाहिए और फिर निर्देशिका को हटा देना चाहिए)।
ru: Не удалось обновить модуль, так как он переключился на git (вам следует проверить изменения, а затем удалить каталог).
uz: Modulni yangilab bo'lmadi, chunki u git-ga o'tdi (o'zgarishlarni tekshirishingiz kerak, keyin katalogni olib tashlang).

source: Failed to update module (missing .git) (you should check for changes then remove the directory).
bg: Mодулът не може да се обнови (липсва „.git“) (трябва да проверите за промени и след това да премахнете директорията).
el: Αποτυχία ενημέρωσης του αρθρώματος (λείπει το .git) (θα πρέπει να ελέγξετε για αλλαγές και μετά να αφαιρέσετε τον κατάλογο).
eo: Malsukcesis ĝisdatigi modulon (mankas .git) (vi devus kontroli ŝanĝojn kaj poste forigi la dosierujon).
hi: मॉड्यूल अद्यतन करने में विफल (.git अनुपलब्ध) (आपको परिवर्तनों की जांच करनी चाहिए और फिर निर्देशिका को हटा देना चाहिए)।
ru: Не удалось обновить модуль (отсутствует .git) (вам следует проверить изменения, а затем удалить каталог).
uz: Modulni yangilab boʻlmadi (.git yoʻq) (oʻzgarishlarni tekshirib, keyin katalogni olib tashlashingiz kerak).

source: Applying patch
bg: Прилагане на кръпка
el: Εφαρμογή διόρθωσης (patch)
eo: Aplikante flikaĵon
hi: पैच लगा रहे है
ru: Применение патча
uz: Yamoqni qo'llash

source: Skipping patch '%s' (already applied)
bg: Прескачане на кръпка „%s“ (вече е приложена)
el: Παράλειψη διόρθωσης '%s' (έχει ήδη εφαρμοστεί)
eo: Preterpasante flikaĵon '%s' (jam aplikita)
ru: Пропуск патча «%s» (уже применён)
uz: “%s” yamogʻi oʻtkazib yuborilmoqda (allaqachon qoʻllangan)

source: Could not apply patch '%s'
bg: Кръпката „%s“ не може да се приложи
el: Αδυναμία εφαρμογής της διόρθωσης '%s'
eo: Ne eblis apliki flikaĵon '%s'
ru: Не удалось применить патч «%s»
uz: “%s” yamog‘ini qo‘llab bo‘lmadi

source: External handling failed
bg: Неуспешна външна обработка
el: Ο εξωτερικός χειρισμός απέτυχε
eo: Ekstera pritrakto malsukcesis
ru: Обработка внешних зависимостей не удалась
uz: Tashqi ishlov berish amalga oshmadi

source: Cannot get last revision from %s. Check the module location.
bg: Версията от „%s“ не може да се получи. Проверете местоположението на модула.
el: Αδυναμία λήψης της τελευταίας αναθεώρησης από το %s. Ελέγξτε την τοποθεσία του αρθρώματος.
eo: Ne eblas akiri lastan revizion el %s. Kontrolu la modullokon.
hi: %s से अंतिम संशोधन प्राप्त नहीं किया जा सका। मॉड्यूल स्थान की जांच करें।
ru: Не удалось получить последнюю правку из %s. Проверьте местоположение модуля.
uz: %s dan oxirgi tahrirni olib boʻlmadi. Modulning joylashishini tekshiring.

source: could not download patch (error: %s)
bg: кръпката не може да бъде изтеглена (грешка: %s)
el: αδυναμία λήψης της διόρθωσης (σφάλμα: %s)
eo: ne eblis elŝuti flikaĵon (eraro: %s)
hi: पैच डाउनलोड नहीं किया जा सका (त्रुटि: %s)
ru: не удалось загрузить патч (ошибка: %s)
uz: yamoqni yuklab bo'lmadi (xato: %s)

source: could not download patch
bg: кръпката не може да се изтегли
el: αδυναμία λήψης της διόρθωσης
eo: ne eblis elŝuti flikaĵon
hi: पैच डाउनलोड नहीं किया जा सका
ru: не удалось загрузить патч
uz: yamoqni yuklab bo'lmadi

source: Failed to find patch: %s
bg: Кръпката липсва: %s
el: Αποτυχία εύρεσης της διόρθωσης: %s
eo: Malsukcesis trovi flikaĵon: %s
hi: पैच खोजने में विफल: %s
ru: Не удалось найти патч: %s
uz: Yamoq topilmadi: %s

source: unknown repository type %s
bg: непознат вид хранилище „%s“
el: άγνωστος τύπος αποθετηρίου %s
eo: nekonata deponej-tipo %s
hi: अज्ञात रिपोजिटरी प्रकार %s
ru: неизвестный тип репозитория %s
uz: noma'lum ombor turi %s

source: Initializing %s
bg: Инициализиране на „%s“
el: Αρχικοποίηση %s
eo: Pravalorante %s
hi: %s प्रारंभ किया जा रहा है
ru: Инициализация %s
uz: %s ishga tushirilmoqda

source: Pulling branch %(branch)s from %(server)s
bg: Издърпване на клон „%(branch)s“ от „%(server)s“
el: Λήψη κλάδου %(branch)s από %(server)s
eo: Elŝutante branĉon %(branch)s el %(server)s
hi: %(server)s से शाखा %(branch)s खींची जा रही है
ru: Загрузка ветки «%(branch)s» с сервера «%(server)s»
uz: %(server)s dan %(branch)s novdasi tortilmoqda
