Repository: GNOME/jhbuild
Catalog: po/*.po
Languages: bg, el, eo, hi, ru, uz

source: No uninstalled system dependencies to install for modules: %r
bg: Няма деинсталирани системни зависимости, които да се инсталират за модулите: %r
el: Δεν υπάρχουν απεγκατεστημένες εξαρτήσεις συστήματος προς εγκατάσταση για τα αρθρώματα: %r
eo: Neniuj neinstalitaj sistemdependaĵoj por instali por moduloj: %r
hi: मॉड्यूल के लिए स्थापना करने हेतु कोई अस्थापित सिस्टम निर्भरता नहीं: %r
ru: Нет неустановленных системных зависимостей для установки для модулей: %r
uz: Modullar uchun oʻrnatilmagan tizimga bogʻliqlik yoʻq: %r

source: Installing dependencies on system: %s
bg: Инсталиране на зависимости в системата: %s
el: Εγκατάσταση εξαρτήσεων στο σύστημα: %s
eo: Instalante dependecojn en sistemo: %s
hi: सिस्टम पर निर्भरताएं स्थापित करना: %s
ru: Установка зависимостей в систему: %s
uz: Tizimga bog'liqliklar o'rnatilmoqda: %s

source: Build modules non-interactively and store build logs
bg: Изграждане на модули неинтерактивно и съхраняване на журнали при изграждане
el: Μη διαδραστική δόμηση αρθρωμάτων και αποθήκευση καταγραφών δόμησης
hi: मॉड्यूल को गैर-इंटरैक्टिव रूप से बनाएं और बिल्ड लॉग को संग्रहीत करें
ru: Собрать модули неинтерактивно и сохранить журналы сборки
uz: Modullarni interaktiv bo'lmagan holda yarating va qurish jurnallarini saqlang

source: directory to store build logs in
bg: директория, в която да се съхраняват журналите за изграждане
el: κατάλογος για την αποθήκευση των καταγραφών δόμησης
eo: dosierujo por konservi konstru-protokolojn
hi: बिल्ड लॉग को संग्रहीत करने के लिए निर्देशिका
ru: каталог для хранения журналов по сборке
uz: tizim jurnallarini saqlash uchun katalog

source: output directory for tinderbox build not specified
bg: не е зададена директория за изход за изграждането на „tinderbox“
el: δεν καθορίστηκε κατάλογος εξόδου για τη δόμηση tinderbox
eo: elig-dosierujo por tinderbox-konstruo ne specifita
hi: टिंडरबॉक्स बिल्ड के लिए आउटपुट निर्देशिका निर्दिष्ट नहीं है
ru: не указан выходной каталог для сборки tinderbox
uz: tinderbox qurish uchun chiqish katalogi ko'rsatilmagan

source: Uninstall all modules
bg: Деинсталиране на всички модули
el: Απεγκατάσταση όλων των αρθρωμάτων
eo: Malinstali ĉiujn modulojn
hi: सभी मॉड्यूल अस्थापित करें
ru: Удалить все модули
uz: Barcha modullarni olib tashlang

source: unknown module %s and no default repository to try an automatic module
bg: неизвестен модул „%s“ и няма стандартно хранилище, за да се опита автоматичен модул
el: άγνωστο άρθρωμα %s και χωρίς προεπιλεγμένο αποθετήριο για δοκιμή αυτόματου αρθρώματος
eo: nekonata modulo %s kaj neniu defaŭlta deponejo por provi aŭtomatan modulon
hi: अज्ञात मॉड्यूल %s और स्वचालित मॉड्यूल आज़माने के लिए कोई तयशुदा रिपॉजिटरी नहीं
ru: неизвестный модуль %s, и нет репозитория по умолчанию для попытки автоматического создания модуля
uz: noma'lum modul %s va avtomatik modulni sinab ko'rish uchun standart ombor yo'q

source: Module %(mod)r is not installed
bg: Модулът %(mod)r не е инсталиран
el: Το άρθρωμα %(mod)r δεν είναι εγκατεστημένο
eo: La modulo %(mod)r ne estas instalita
hi: मॉड्यूल %(mod)r स्थापित नहीं है
ru: Модуль %(mod)r не установлен
uz: %(mod)r moduli oʻrnatilmagan

source: Invalid condition set modifier: '%s'. Must start with '+' or '-'.
bg: Неправилен модификатор на набора от условия: „%s“. Трябва да започва с „+“ или „-“.
eo: Nevalida modifilo de kondiĉaro: '%s'. Devas komenciĝi per '+' aŭ '-'.
hi: अमान्य स्थिति सेट संशोधक: '%s'। '+' या '-' से प्रारंभ होना चाहिए।
ru: Недопустимый модификатор набора условий: «%s». Должен начинаться с «+» или «-».
uz: Shartlar to‘plami o‘zgartiruvchisi noto‘g‘ri: “%s”. "+" yoki "-" bilan boshlanishi kerak.

source: could not load config defaults
bg: стандартните настройки не може да може да се заредят
el: αδυναμία φόρτωσης προεπιλογών ρύθμισης
eo: ne eblis ŝargi apriorajn agordojn
hi: विन्यास तयशुदा लोड नहीं कर सका
ru: невозможно загрузить настройки по умолчанию
uz: konfiguratsiya standartlarini yuklay olmadi

source: could not load system config %s
bg: системният файл с настройки „%s“ не може да се зареди
el: αδυναμία φόρτωσης ρύθμισης συστήματος %s
eo: ne eblis ŝargi la sisteman agordon %s
hi: सिस्टम विन्यास %s लोड नहीं किया जा सका
ru: не удалось загрузить системную конфигурацию %s
uz: %s tizim konfiguratsiyasi yuklanmadi

source: could not load config file, %s is missing
bg: файлът с настройки не може да се зареди, липсва „%s“
el: αδυναμία φόρτωσης αρχείου ρυθμίσεων, λείπει το %s
eo: ne eblis ŝargi agordan dosieron, %s mankas
hi: विन्यास फाइल लोड नहीं हो सकी, %s गुम है
ru: невозможно загрузить конфигурационный файл, отсутствует %s
uz: konfiguratsiya faylini yuklab boʻlmadi, %s yoʻq

source: The default location of the configuration file has changed. Please move %(old_path)s to %(new_path)s.
bg: Стандартното местоположението на файла с настройки е променено. Преместете %(old_path)s на %(new_path)s.
el: Η προεπιλεγμένη θέση του αρχείου ρυθμίσεων άλλαξε. Παρακαλούμε μετακινήστε το %(old_path)s στο %(new_path)s.
eo: La defaŭlta loko de la agorda dosiero ŝanĝiĝis. Bonvolu movi %(old_path)s al %(new_path)s.
hi: विन्यास फाइल का तयशुदा स्थान बदल गया है। कृपया %(old_path)s को %(new_path)s पर ले जाएं।
ru: Расположение файла конфигурации по умолчанию изменилось. Пожалуйста, переместите %(old_path)s в %(new_path)s.
uz: Konfiguratsiya faylining standart joylashuvi o'zgardi. %(old_path)s ni %(new_path)s ga koʻchiring.

source: Could not include config file (%s)
bg: Файлът с настройките (%s) не може да се включи
el: Αδυναμία συμπερίληψης αρχείου ρυθμίσεων (%s)
eo: Ne eblis inkluzivi agordan dosieron (%s)
hi: विन्यास फाइल (%s) शामिल नहीं की जा सकी
ru: Не удалось включить конфигурационный файл (%s)
uz: Konfiguratsiya fayli kiritilmadi (%s)

source: could not load config file
bg: файлът с настройките не може да се зареди
el: αδυναμία φόρτωσης αρχείου ρυθμίσεων
eo: ne eblis ŝargi agordan dosieron
hi: विन्यास फाइल लोड नहीं की जा सकी
ru: невозможно загрузить конфигурационный файл
uz: konfiguratsiya faylini yuklab bo'lmadi

source: unknown keys defined in configuration file: %s
bg: неизвестни ключове, дефинирани в файла с настройки: %s
el: άγνωστα κλειδιά ορίστηκαν στο αρχείο ρυθμίσεων: %s
eo: nekonataj ŝlosiloj difinitaj en agorda dosiero: %s
hi: विन्यास फाइल में परिभाषित अज्ञात कुंजियां: %s
ru: в файле конфигурации определены неизвестные ключи: %s
uz: konfiguratsiya faylida aniqlangan noma'lum kalitlar: %s

source: the "%s" configuration variable is deprecated, you should use "repos['gnome.org']".
bg: настройката „%s“ е изоставена, трябва да използвате „repos['gnome.org']“.
el: η μεταβλητή ρύθμισης "%s" είναι παρωχημένη, θα πρέπει να χρησιμοποιήσετε το "repos['gnome.org']".
eo: La agorda variablo "%s" estas evitinda; uzu "repos['gnome.org']".
hi: "%s" विन्यास वैरिएबल अप्रचलित है, आपको "repos['gnome.org']" का उपयोग करना चाहिए।
ru: переменная конфигурации «%s» устарела, следует использовать «repos['gnome.org']».
uz: "%s" konfiguratsiya o'zgaruvchisi eskirgan, siz "repos['gnome.org']" dan foydalanishingiz kerak.

source: the "%s" configuration variable is deprecated, you should use "repos".
bg: настройката „%s“ е изоставена, трябва да използвате „repos“.
el: η μεταβλητή ρύθμισης "%s" είναι παρωχημένη, θα πρέπει να χρησιμοποιήσετε το "repos".
eo: La agorda variablo "%s" estas evitinda; uzu "repos".
hi: "%s" विन्यास वैरिएबल अप्रचलित है, आपको "repos" का उपयोग करना चाहिए।
ru: переменная конфигурации «%s» устарела, следует использовать «repos».
uz: "%s" konfiguratsiya o'zgaruvchisi eskirgan, siz "repos" dan foydalanishingiz kerak.

source: invalid checkout mode
bg: неправилен режим на изтегляне
el: μη έγκυρη λειτουργία εξαγωγής (checkout)
eo: nevalida elprena reĝimo
hi: अमान्य चेकआउट मोड
ru: неверный режим извлечения
uz: noto'g'ri to'lov rejimi

source: invalid checkout mode (module: %s)
bg: неправилен режим на изтегляне (модул: %s)
el: μη έγκυρη λειτουργία εξαγωγής (checkout) (άρθρωμα: %s)
eo: nevalida elprena reĝimo (modulo: %s)
hi: अमान्य चेकआउट मोड (मॉड्यूल: %s)
ru: неверный режим извлечения (модуль: %s)
uz: yaroqsiz hisob-kitob rejimi (modul: %s)

source: copy mode requires copy_dir to be set
bg: режимът на копиране изисква задаване на „copy_dir“
el: η λειτουργία αντιγραφής απαιτεί τον ορισμό του copy_dir
eo: kopi-reĝimo postulas, ke copy_dir estu agordita
hi: कॉपी मोड के लिए copy_dir निर्धारित करना आवश्यक है
ru: режим копирования требует, чтобы был задан параметр copy_dir
uz: nusxa ko'chirish rejimi copy_dir ni o'rnatishni talab qiladi

source: modulesets directory (%s) not found, disabling use_local_modulesets
bg: директорията „modulesets“ (%s) не е намерена, „use_local_modulesets“ се изключват
el: ο κατάλογος συνόλων αρθρωμάτων (%s) δεν βρέθηκε, απενεργοποίηση του use_local_modulesets
eo: dosierujo modulesets (%s) ne troviĝis, malebligante use_local_modulesets
hi: मॉड्यूलसेट निर्देशिका (%s) नहीं मिली, use_local_modulesets अक्षम किया जा रहा है
ru: каталог наборов модулей (%s) не найден, отключается use_local_modulesets
uz: modulesets katalogi (%s) topilmadi, use_local_modulesets o‘chirib qo‘yildi

source: %s must be an absolute path
bg: „%s“ трябва да е абсолютен път
el: το %s πρέπει να είναι απόλυτη διαδρομή
eo: %s devas esti absoluta vojo
hi: %s एक निरपेक्ष पथ होना चाहिए
ru: %s должен быть абсолютным путём
uz: %s mutlaq yoʻl boʻlishi kerak

source: install prefix (%s) can not be created
bg: префиксът за инсталиране (%s) не може да се създаде
el: το πρόθεμα εγκατάστασης (%s) δεν μπορεί να δημιουργηθεί
eo: ne eblas krei la instalan prefikson (%s)
hi: स्थापना उपसर्ग (%s) नहीं बनाया जा सकता
ru: не удалось создать префикс установки (%s)
uz: o'rnatish prefiksini (%s) yaratib bo'lmaydi

source: working directory (%s) can not be created
bg: работната директория (%s) не може да се създаде
el: ο κατάλογος εργασίας (%s) δεν μπορεί να δημιουργηθεί
eo: ne eblas krei la labordosierujon (%s)
hi: कार्यशील निर्देशिका (%s) नहीं बनाई जा सकती
ru: не удалось создать рабочий каталог (%s)
uz: ishchi katalogni (%s) yaratib bo'lmaydi

source: Your install prefix contains a 'lib64' directory, which is no longer supported by jhbuild. This is likely the result of a previous build with an older version of jhbuild or of a broken package. Please consider removing your install and checkout directories and starting fresh.
bg: Префиксът за инсталиране съдържа директорията „lib64“, което не се поддържа от jhbuild вече. Това вероятно е резултат от предишна компилация с по-стара версия на jhbuild или от счупен пакет. Помислете дали да не премахнете директориите си за инсталиране и изтегляне и да започнете наново.
eo: Via instala prefikso enhavas dosierujon 'lib64', kiu ne plu estas subtenata de jhbuild. Tio verŝajne estas rezulto de antaŭa konstruo per pli malnova versio de jhbuild aŭ de difekta pako. Bonvolu konsideri forigi viajn instala kaj elprenajn dosierujojn kaj komenci freŝe.
hi: आपके स्थापना उपसर्ग में 'lib64' निर्देशिका है, जो अब jhbuild द्वारा समर्थित नहीं है। यह संभवतः jhbuild के पुराने संस्करण वाले पिछले निर्माण या टूटे हुए पैकेज का परिणाम है। कृपया अपनी स्थापना और चेकआउट निर्देशिकाओं को हटाने और नए सिरे से शुरू करने पर विचार करें।
ru: Ваш префикс установки содержит каталог 'lib64', который больше не поддерживается jhbuild. Вероятно, это результат предыдущей сборки с более старой версией jhbuild или повреждённого пакета. Пожалуйста, рассмотрите возможность удаления ваших каталогов установки и извлечения и начните всё заново.
uz: O'rnatish prefiksingizda jhbuild tomonidan qo'llab-quvvatlanmaydigan "lib64" katalogi mavjud. Bu, ehtimol, jhbuild ning eski versiyasi yoki buzilgan paket bilan oldingi tuzilish natijasidir. Iltimos, o'rnatish va tekshirish kataloglarini olib tashlang va yangisini boshlang.

source: Failed to parse 'min_age' relative time
bg: Неуспешно разчитането на относителното време „min_age“
el: Αποτυχία ανάλυσης του σχετικού χρόνου 'min_age'
eo: Malsukcesis analizi la relativan tempon 'min_age'
hi: 'min_age' सापेक्ष समय पार्स करने में विफल
ru: Не удалось разобрать относительное время «min_age»
uz: “min_age” nisbiy vaqtini tahlil qilib bo‘lmadi

source: quiet mode has been disabled because the Python curses module is missing.
bg: тихият режим е изключен, тъй като модулът Python curses липсва.
el: η αθόρυβη λειτουργία απενεργοποιήθηκε επειδή λείπει το άρθρωμα curses της Python.
eo: silenta reĝimo estis malŝaltita ĉar mankas la Python-modulo 'curses'.
hi: शांत मोड को अक्षम कर दिया गया है क्योंकि Python curses मॉड्यूल गायब है।
ru: тихий режим был отключён, так как отсутствует модуль Python curses.
uz: Python qarg'ish moduli yo'qligi sababli jim rejim o'chirildi.

source: GNOME Build Tool
bg: Инструмент за изграждане на GNOME
el: Εργαλείο Δόμησης GNOME
eo: GNOMO-Konstruilo
hi: गनोम बिल्ड टूल
ru: Инструмент для сборки GNOME
uz: GNOME qurish vositasi

source: Build GNOME modules
bg: Изграждане на модули на GNOME
el: Δόμηση αρθρωμάτων GNOME
eo: Konstruu modulojn de GNOMO
hi: गनोम मॉड्यूल बनाएं
ru: Собрать модули GNOME
uz: GNOME modullarini yarating

source: Server Error, retrying in %d seconds
bg: Грешка на сървъра, опитване отново след %d секунди
el: Σφάλμα Διακομιστή, επανάληψη σε %d δευτερόλεπτα
eo: Servila eraro, reprovos post %d sekundoj
hi: सर्वर त्रुटि, %d सेकंड में पुनः प्रयास किया जाएगा
ru: Ошибка сервера, повторное обращение через %d сек
uz: Server xatosi, %d soniyadan keyin qayta uriniladi

source: Server Error, aborting
bg: Грешка на сървъра, прекратяване
el: Σφάλμα Διακομιστή, ματαίωση
eo: Servila eraro, ĉesigante
hi: सर्वर त्रुटि, निरस्त किया जा रहा है
ru: Ошибка сервера, прервано
uz: Server xatosi, bekor qilinmoqda

source: Error: %s
bg: Грешка: %s
el: Σφάλμα: %s
eo: Eraro: %s
hi: त्रुटि: %s
ru: Ошибка: %s
uz: Xato: %s

source: Error running %s
bg: Грешка при изпълняване на „%s“
el: Σφάλμα κατά την εκτέλεση του %s
eo: Eraro dum ruligo de %s
hi: %s चलाने में त्रुटि
ru: Ошибка выполнения %s
uz: %s ishga tushdi

source: ERROR: Wrong credentials, please check username/password
bg: ГРЕШКА: Грешни данни за идентификация, проверете потребителското име/парола
el: ΣΦΑΛΜΑ: Λανθασμένα διαπιστευτήρια, παρακαλούμε ελέγξτε το όνομα χρήστη/κωδικό πρόσβασης
eo: ERARO: Malĝustaj identigiloj; bonvolu kontroli uzantnomon/pasvorton
hi: त्रुटि: गलत क्रेडेंशियल, कृपया उपयोक्ता नाम/पासवर्ड जांचें
ru: ОШИБКА: Неверные учётные данные, пожалуйста, проверьте имя пользователя/пароль
uz: XATO: Hisob maʼlumotlari notoʻgʻri, foydalanuvchi nomi/parolni tekshiring

source: Starting Build #%s
bg: Стартиране на изграждане #%s
el: Έναρξη Δόμησης #%s
eo: Komencante konstruon #%s
hi: बिल्ड #%s प्रारंभ हो रहा है
ru: Запуск сборки #%s
uz: №%s-qurilish boshlanmoqda

source: **** Starting module %s ****
bg: •••• Стартиране на модул %s ••••
el: **** Έναρξη αρθρώματος %s ****
eo: **** Komencante modulon %s ****
hi: **** मॉड्यूल %s प्रारंभ किया जा रहा है ****
ru: **** Запуск модуля %s ****
uz: **** Boshlang'ich modul %s ****

source: install prefix (%s) must be writable
bg: трябва да имате права̀ за запис в префикса за инсталиране (%s)
el: το πρόθεμα εγκατάστασης (%s) πρέπει να είναι εγγράψιμο
eo: instala prefikso (%s) devas esti skribebla
hi: स्थापना उपसर्ग (%s) लिखने योग्य होना चाहिए
ru: префикс установки (%s) должен быть доступен для записи
uz: o'rnatish prefiksi (%s) yoziladigan bo'lishi kerak

source: checkout root (%s) can not be created
bg: началната директория на изтеглянето (%s) не може да бъде създадена
el: η ρίζα εξαγωγής (%s) δεν μπορεί να δημιουργηθεί
eo: ne eblas krei elprenan radikon (%s)
hi: चेकआउट रूट (%s) नहीं बनाया जा सकता
ru: не удалось создать корневой каталог извлечения (%s)
uz: to'lov ildizini (%s) yaratib bo'lmaydi

source: checkout root (%s) must be writable
bg: трябва да имате права̀ за запис в началната директория на изтеглянето (%s)
el: η ρίζα εξαγωγής (%s) πρέπει να είναι εγγράψιμη
eo: elprena radiko (%s) devas esti skribebla
hi: चेकआउट रूट (%s) लिखने योग्य होना चाहिए
ru: корневой каталог извлечения (%s) должен быть доступен для записи
uz: to'lov ildizi (%s) yoziladigan bo'lishi kerak

source: checkout copy dir (%s) can not be created
bg: копието на директорията за изтеглянето (%s) не може да се създаде
el: ο κατάλογος αντιγραφής εξαγωγής (%s) δεν μπορεί να δημιουργηθεί
eo: ne eblas krei elprenan kopiodosierujon (%s)
hi: चेकआउट कॉपी निर्देशिका (%s) नहीं बनाई जा सकती
ru: не удалось создать каталог для копирования извлечённых данных (%s)
uz: to'lov nusxasi katalogini (%s) yaratib bo'lmaydi

source: checkout copy dir (%s) must be writable
bg: трябва да имате права̀ за запис в копието на директорията за изтеглянето (%s)
el: ο κατάλογος αντιγραφής εξαγωγής (%s) πρέπει να είναι εγγράψιμος
eo: elprena kopiodosierujo (%s) devas esti skribebla
hi: चेकआउट कॉपी निर्देशिका (%s) लिखने योग्य होनी चाहिए
ru: каталог для копирования извлечённых данных (%s) должен быть доступен для записи
uz: to'lov nusxasi katalogi (%s) yoziladigan bo'lishi kerak

source: checkout export dir (%s) can not be created
bg: директорията за изнасянето на изтеглянето (%s) не може да се създаде
el: ο κατάλογος εξαγωγής export (%s) δεν μπορεί να δημιουργηθεί
eo: ne eblas krei elprenan eksportdosierujon (%s)
hi: चेकआउट निर्यात निर्देशिका (%s) नहीं बनाई जा सकती
ru: не удалось создать каталог для экспорта извлечённых данных (%s)
uz: to'lovni eksport qilish dirijyorini (%s) yaratib bo'lmaydi

source: checkout export dir (%s) must be writable
bg: трябва да имате права̀ за запис в директорията за изнасянето на изтеглянето (%s)
el: ο κατάλογος εξαγωγής export (%s) πρέπει να είναι εγγράψιμος
eo: elprena eksportdosierujo (%s) devas esti skribebla
hi: चेकआउट निर्यात निर्देशिका (%s) लिखने योग्य होनी चाहिए
ru: каталог для экспорта извлечённых данных (%s) должен быть доступен для записи
uz: to'lov eksporti direktori (%s) yozilishi kerak

source: Skipping %s (installed recently)
bg: Пропускане на %s (инсталирано наскоро)
el: Παράλειψη %s (εγκαταστάθηκε πρόσφατα)
eo: Preterpasante %s (lastatempe instalita)
hi: %s छोड़ा जा रहा है (हाल ही में स्थापित)
ru: Пропуск %s (недавно установлен)
uz: %s oʻtkazib yuborilmoqda (yaqinda oʻrnatilgan)

source: module %(mod)s will be built even though %(dep)s failed
bg: модулът %(mod)s ще се изгради въпреки неуспешното изграждане на %(dep)s
el: το άρθρωμα %(mod)s θα δομηθεί παρόλο που το %(dep)s απέτυχε
eo: modulo %(mod)s estos konstruita kvankam %(dep)s malsukcesis
hi: मॉड्यूल %(mod)s का निर्माण किया जाएगा भले ही %(dep)s विफल हो गया हो
ru: модуль %(mod)s будет собран, несмотря на сбой в %(dep)s
uz: %(mod)s moduli %(dep)s bajarilmasa ham quriladi

source: module %(mod)s not built due to non buildable %(dep)s
bg: модулът %(mod)s не бе изграден поради неуспешното изграждане на %(dep)s
el: το άρθρωμα %(mod)s δεν δομήθηκε λόγω μη δομήσιμου %(dep)s
eo: modulo %(mod)s ne konstruita pro nekonstruiebla %(dep)s
hi: मॉड्यूल %(mod)s गैर निर्माण योग्य %(dep)s के कारण निर्मित नहीं हुआ
ru: модуль %(mod)s не будет собран из-за невозможности собрать %(dep)s
uz: %(mod)s moduli qurib boʻlmaydiganligi sababli qurilmagan %(dep)s

source: Ignoring uninstalled package: %s
bg: Прескачане на деинсталирания пакет: %s
el: Αγνόηση μη εγκατεστημένου πακέτου: %s
eo: Ignorante malinstalitan pakon: %s
hi: अस्थापित पैकेज को अनदेखा किया जा रहा है: %s
ru: Игнорирование неустановленного пакета: %s
uz: Oʻchirib tashlangan paketga eʼtibor bermaslik: %s

source: Running post-installation trigger script: %r
bg: Изпълняване на спусъците след инсталацията: %r
el: Εκτέλεση δέσμης ενεργειών εναύσματος μετά την εγκατάσταση: %r
eo: Rulante postinstalan ekigilan skripton: %r
hi: स्थापना-पश्चात ट्रिगर स्क्रिप्ट चलाई जा रही है: %r
ru: Выполнение скрипта-триггера после установки: %r
uz: O‘rnatishdan keyingi ishga tushirish skripti: %r

source: %(command)s returned with an error code (%(rc)s)
bg: %(command)s завърши с код за грешка (%(rc)s)
el: το %(command)s επέστρεψε με κωδικό σφάλματος (%(rc)s)
eo: %(command)s revenis kun erarkodo (%(rc)s)
hi: %(command)s त्रुटि कोड (%(rc)s) के साथ लौटा
ru: %(command)s вернула код ошибки (%(rc)s)
uz: %(command)s xato kodi bilan qaytdi (%(rc)s)

source: Others...
bg: Други…
el: Άλλα...
eo: Aliaj...
hi: अन्य...
ru: Другие...
uz: Boshqalar...

source: Choose Module:
bg: Избор на модул:
el: Επιλογή Αρθρώματος:
eo: Elekti modulon:
hi: मॉड्यूल चुनें:
ru: Выберите модуль:
uz: Modulni tanlang:

source: Build Progress
bg: Напредък в изграждането
el: Πρόοδος Δόμησης
eo: Konstrua progreso
hi: निर्माण प्रगति
ru: Ход сборки
uz: Qurilish taraqqiyoti

source: Terminal
bg: Терминал
el: Τερματικό
eo: Terminalo
hi: टर्मिनल
ru: Терминал
uz: Virtual terminal to'xtatildi

source: Start
bg: Начало
el: Έναρξη
eo: Komenco
hi: प्रारंभ
ru: Начать
uz: Boshlash

source: Build Completed
bg: Изграждането завърши
el: Ολοκληρώθηκε η δόμηση
eo: Konstruo finita
hi: निर्माण पूरा हुआ
ru: Сборка завершена
uz: Qurilish tugallandi

source: Error during phase %(phase)s of %(module)s
bg: Грешка по време на етап %(phase)s на %(module)s
el: Σφάλμα κατά τη φάση %(phase)s του %(module)s
eo: Eraro dum fazo %(phase)s de %(module)s
hi: %(module)s के चरण %(phase)s के दौरान त्रुटि
ru: Ошибка на этапе %(phase)s в %(module)s
uz: %(module)s/%(phase)s-bosqichda xatolik

source: Pick an Action
bg: Избор на действие
el: Επιλογή ενέργειας
eo: Elektu agon
hi: कोई कार्रवाई चुनें
ru: Выберите действие
uz: Harakatni tanlang

source: Rerun phase %s
bg: Повторно изпълняване на етап %s
el: Επανεκτέλεση φάσης %s
eo: Relanĉi fazon %s
hi: चरण %s पुनः चलाएं
ru: Перезапустить этап %s
uz: %s-bosqichni qayta ishga tushirish

source: Ignore error and continue to %s
bg: Прескачане на грешката и продължаване към %s
el: Αγνόηση σφάλματος και συνέχεια σε %s
eo: Ignori eraron kaj daŭrigi al %s
hi: त्रुटि पर ध्यान न दें और %s पर जारी रखें
ru: Игнорировать ошибку и продолжить %s
uz: Xatoga e'tibor bermang va %s ga o'ting

source: Ignore error and continue to next module
bg: Игнориране на грешката и продължаване към следващия модул
el: Αγνόηση σφάλματος και συνέχεια στο επόμενο άρθρωμα
eo: Ignori eraron kaj daŭrigi al la sekva modulo
hi: त्रुटि को अनदेखा करें और अगले मॉड्यूल पर जाएं
ru: Игнорировать ошибку и продолжить со следующего модуля
uz: Xatoga e'tibor bermang va keyingi modulga o'ting

source: Give up on module
bg: Отказване от модула
el: Εγκατάλειψη αρθρώματος
eo: Rezigni pri modulo
hi: मॉड्यूल छोड़ दें
ru: Отказаться от модуля
uz: Moduldan voz keching

source: Go to phase "%s"
bg: Към етап „%s“
el: Μετάβαση στη φάση "%s"
eo: Iri al fazo "%s"
hi: चरण "%s" पर जाएं
ru: Перейти к этапу «%s»
uz: “%s” bosqichiga o‘tish

source: Open Terminal
bg: Отваряне на терминал
el: Άνοιγμα τερματικού
eo: Malfermi terminalon
hi: टर्मिनल खोलें
ru: Открыть терминал
uz: Terminalni oching

source: %(command)s died with signal %(rc)s
bg: %(command)s умря със сигнал %(rc)s
el: Η εντολή %(command)s τερματίστηκε με σήμα %(rc)s
eo: %(command)s mortis pro signalo %(rc)s
hi: %(command)s संकेत %(rc)s के साथ समाप्त हो गया
ru: %(command)s завершилась с сигналом %(rc)s
uz: %(command)s %(rc)s signali bilan vafot etdi

source: Module
bg: Модул
el: Άρθρωμα
eo: Modulo
hi: माड्यूल
ru: Модуль
uz: Modul

source: Start At
bg: Стартиране от
el: Έναρξη από
eo: Komenci je
hi: इस पर प्रारंभ करें
ru: Начать с
uz: Boshlash

source: Preferences
bg: Настройки
el: Προτιμήσεις
eo: Agordoj
hi: प्राथमिकताएं
ru: Параметры
uz: Afzalliklar

source: Disable network access
bg: Изключване на достъпа до мрежата
el: Απενεργοποίηση πρόσβασης δικτύου
eo: Malebligi retaliron
hi: नेटवर्क पहुंच अक्षम करें
ru: Запретить доступ к сети
uz: Tarmoqqa kirishni o'chirib qo'ying

source: Always run autogen.sh
bg: Винаги да се изпълнява „autogen.sh“
el: Εκτέλεση του autogen.sh πάντα
eo: Ĉiam ruli autogen.sh
hi: हमेशा autogen.sh चलाएं
ru: Всегда запускать autogen.sh
uz: Har doim autogen.sh ni ishga tushiring

source: Don't poison modules on failure
bg: Без отравяне на модулите при неуспех
el: Να μην αλλοιώνονται τα αρθρώματα σε περίπτωση αποτυχίας
eo: Ne "venenigi" modulojn ĉe malsukceso
hi: विफलता पर मॉड्यूल को विषाक्त न करें
ru: Не помечать модули как сбойные при ошибке
uz: Muvaffaqiyatsiz modullarni zaharlamang
