Repository: GNOME/jhbuild
Catalog: po/*.po
Languages: bg, el, eo, hi, ru, uz

source: Configuring $PKG_NAME without autotools
bg: Настройване на „$PKG_NAME“ без „autotools“
el: Ρύθμιση του $PKG_NAME χωρίς αυτόματα εργαλεία
eo: Agordante $PKG_NAME sen autotools
hi: autotools के बिना $PKG_NAME को विन्यस्त किया जा रहा है
ru: Конфигурирование $PKG_NAME без autotools
uz: $PKG_NAME avtomatik asboblarsiz sozlanmoqda

source: Unable to create file $srcdir/Makefile.inc
bg: Файлът „$srcdir/Makefile.inc“ не може да се създаде
el: Αδυναμία δημιουργίας του αρχείου $srcdir/Makefile.inc
eo: Ne eblas krei dosieron $srcdir/Makefile.inc
hi: $srcdir/Makefile.inc फाइल बनाने में असमर्थ
ru: Невозможно создать файл $srcdir/Makefile.inc
uz: $srcdir/Makefile.inc faylini yaratib bo‘lmadi

source: Unable to read file $makefile
bg: Файлът „$makefile“ не може да се прочете
el: Αδυναμία ανάγνωσης του αρχείου $makefile
eo: Ne eblas legi dosieron $makefile
hi: $makefile फाइल पढ़ने में असमर्थ
ru: Невозможно прочитать файл $makefile
uz: $makefile faylini oʻqib boʻlmadi

source: Unable to copy $makefile to $srcdir/Makefile
bg: „$makefile“ не може да се копира като „$srcdir/Makefile“
el: Αδυναμία αντιγραφής του $makefile στο $srcdir/Makefile
eo: Ne eblas kopii na $makefile al $srcdir/Makefile
hi: $makefile को $srcdir/Makefile में कॉपी करने में असमर्थ
ru: Не удалось скопировать $makefile в $srcdir/Makefile
uz: $makefile faylini $srcdir/Makefile-ga nusxalab bo‘lmadi

source: Now type `make' to compile $PKG_NAME
bg: Сега въведете „make“, за да компилирате „$PKG_NAME“
el: Πληκτρολογήστε τώρα `make' για τη μεταγλώττιση του $PKG_NAME
eo: Nun entajpu `make' por kompili na $PKG_NAME
hi: अब $PKG_NAME को संकलित करने के लिए `make' टाइप करें
ru: Введите «make» чтобы скомпилировать $PKG_NAME
uz: Endi $PKG_NAME kompilyatsiya qilish uchun “make” deb yozing

source: **Error**: Directory `$srcdir' does not look like the top-level $PKG_NAME directory
bg: ••Грешка••: Директорията „$srcdir“ не изглежда да е най-горната директория в „$PKG_NAME“
el: **Σφάλμα**: Ο κατάλογος `$srcdir' δεν μοιάζει με τον καταλόγο ανωτέρου επιπέδου του $PKG_NAME
eo: **Eraro**: Dosierujo `$srcdir' ne ŝajnas esti la plej-supra $PKG_NAME-dosierujo
hi: **त्रुटि**: निर्देशिका `$srcdir' शीर्ष-स्तरीय $PKG_NAME निर्देशिका की तरह नहीं दिखती
ru: **Ошибка**: каталог «$srcdir» не похож на каталог верхнего уровня $PKG_NAME
uz: **Xato**: “$srcdir” katalogi yuqori darajadagi $PKG_NAME katalogiga o‘xshamaydi

source: WARNING: aclocal not available (usually part of package 'autoconf')
bg: ПРЕДУПРЕЖДЕНИЕ: „aclocal“ липсва (обикновено е част от пакета „autoconf“)
el: ΠΡΟΣΟΧΗ: Το aclocal δεν είναι διαθέσιμο (συνήθως μέρος του πακέτου 'autoconf')
eo: AVERTO: aclocal ne disponebla (kutime parto de la pako 'autoconf')
hi: चेतावनी: aclocal उपलब्ध नहीं है (आमतौर पर पैकेज 'autoconf' का हिस्सा)
ru: ВНИМАНИЕ: aclocal недоступен (обычно является частью пакета 'autoconf')
uz: OGOHLANTIRISH: aclocal mavjud emas (odatda "autoconf" paketining bir qismi)

source: WARNING: automake not available (usually part of package 'automake')
bg: ПРЕДУПРЕЖДЕНИЕ: „automake“ липсва (обикновено е част от пакета „automake“)
el: ΠΡΟΣΟΧΗ: Το automake δεν είναι διαθέσιμο (συνήθως μέρος του πακέτου 'automake')
eo: AVERTO: automake ne disponebla (kutime parto de la pako 'automake')
hi: चेतावनी: automake उपलब्ध नहीं है (आमतौर पर पैकेज 'automake' का हिस्सा)
ru: ВНИМАНИЕ: automake недоступен (обычно является частью пакета 'automake')
uz: OGOHLANTIRISH: automake mavjud emas (odatda “avtomake” paketining bir qismi)

source: WARNING: autopoint not available (usually part of package 'gettext')
bg: ПРЕДУПРЕЖДЕНИЕ: „autopoint“ липсва (обикновено е част от пакета „gettext“)
el: ΠΡΟΣΟΧΗ: Το autopoint δεν είναι διαθέσιμο (συνήθως μέρος του πακέτου 'gettext')
eo: AVERTO: autopoint ne disponebla (kutime parto de la pako 'gettext')
hi: चेतावनी: autopoint उपलब्ध नहीं है (आमतौर पर पैकेज 'gettext' का हिस्सा)
ru: ВНИМАНИЕ: autopoint недоступен (обычно является частью пакета 'gettext')
uz: OGOHLANTIRISH: avtomatik nuqta mavjud emas (odatda "getext" paketining bir qismi)

source: WARNING: pkg-config not available (usually part of package 'pkgconfig')
bg: ПРЕДУПРЕЖДЕНИЕ: „pkg-config“ липсва (обикновено е част от пакета „pkgconfig“)
el: ΠΡΟΣΟΧΗ: Το pkg-config δεν είναι διαθέσιμο (συνήθως μέρος του πακέτου 'pkgconfig')
eo: AVERTO: pkg-config ne disponebla (kutime parto de la pako 'pkgconfig')
hi: चेतावनी: pkg-config उपलब्ध नहीं है (आमतौर पर पैकेज 'pkgconfig' का हिस्सा)
ru: ВНИМАНИЕ: pkg-config недоступен (обычно является частью пакета 'pkgconfig')
uz: OGOHLANTIRISH: pkg-config mavjud emas (odatda "pkgconfig" paketining bir qismi)

source: Update all modules from version control
bg: Обновяване на всички модули от системата за контрол на версиите
el: Ενημέρωση όλων των αρθρωμάτων από το σύστημα ελέγχου εκδόσεων
hi: संस्करण नियंत्रण से सभी मॉड्यूल को अद्यतन करें
ru: Обновить все модули из системы контроля версий
uz: Versiya boshqaruvidan barcha modullarni yangilang

source: [ options ... ] [ modules ... ]
bg: [ОПЦИЯ…] [МОДУЛ…]
el: [ επιλογές ... ] [ αρθρώματα ... ]
hi: [ विकल्प ... ] [ मॉड्यूल ... ]
ru: [ параметры ... ] [ модули ... ]
uz: [ variantlar ... ] [ modullar ... ]

source: treat the given modules as up to date
bg: приемане на дадените модули за актуални
el: αντιμετώπιση των δοσμένων αρθρωμάτων ως ενημερωμένα
eo: trakti la donitajn modulojn kiel ĝisdatajn
hi: दिए गए मॉड्यूल को अद्यतित मानें
ru: считать указанные модули актуальными
uz: berilgan modullarni eng yangi deb hisoblang

source: start updating at the given module
bg: стартиране на обновяване от дадения модул
el: έναρξη ενημέρωσης στο δοσμένο άρθρωμα
eo: komenci ĝisdatigon ĉe la donita modulo
hi: दिए गए मॉड्यूल पर अद्यतन करना प्रारंभ करें
ru: начать обновление с указанного модуля
uz: berilgan modulda yangilashni boshlang

source: update only modules with the given tags
bg: обновяване само на модулите със зададените етикети
el: ενημέρωση μόνο των αρθρωμάτων με τις δοσμένες ετικέτες
eo: ĝisdatigi nur modulojn kun la donitaj etikedoj
hi: केवल दिए गए टैग वाले मॉड्यूल को अद्यतन करें
ru: обновить модули только с указанными метками
uz: faqat berilgan teglar bilan modullarni yangilang

source: set a sticky date when checking out modules
bg: задаване на дата при изтегляне на модули
el: ορισμός σταθερής ημερομηνίας κατά την εξαγωγή (checkout) των αρθρωμάτων
eo: agordi fiksitan daton dum elpreno de moduloj
hi: मॉड्यूल की जांच करते समय एक स्थिर तिथि निर्धारित करें
ru: установить фиксированную дату при извлечении модулей
uz: modullarni tekshirishda yopishqoq sanani belgilang

source: ignore all soft-dependencies
bg: прескачане на всички незадължителни зависимости
el: αγνόηση όλων των χαλαρών εξαρτήσεων
eo: ignori ĉiujn malfortajn dependecojn
hi: सभी नरम-निर्भरताओं को अनदेखा करें
ru: игнорировать все нежёсткие зависимости
uz: barcha yumshoq bog'liqliklarni e'tiborsiz qoldiring

source: %s not in module list
bg: %s не е в списъка с модули
el: το %s δεν είναι στη λίστα αρθρωμάτων
eo: %s ne estas en la modulo-listo
hi: %s मॉड्यूल सूची में नहीं है
ru: %s отсутствует в списке модулей
uz: %s modullar roʻyxatida yoʻq

source: Update one or more modules from version control
bg: Обновяване на един или повече модули от системата за контрол на версиите
el: Ενημέρωση ενός ή περισσοτέρων αρθρωμάτων από το σύστημα έλεγχου εκδόσεων
hi: संस्करण नियंत्रण से एक या अधिक मॉड्यूल अद्यतन करें
ru: Обновить один или несколько модулей из системы контроля версий
uz: Versiya boshqaruvidan bir yoki bir nechta modulni yangilang

source: A module called '%s' could not be found.
bg: Липсва модул с име „%s“.
el: Δεν βρέθηκε άρθρωμα με το όνομα '%s'.
eo: Ne eblis trovi modulon nomatan '%s'.
hi: '%s' नामक मॉड्यूल नहीं मिला।
ru: Модуль «%s» не найден.
uz: “%s” nomli modul topilmadi.

source: This command requires a module parameter.
bg: Тази команда изисква параметър за модул.
el: Αυτή η εντολή απαιτεί μια παράμετρο αρθρώματος.
eo: Ĉi tiu komando postulas modul-parametron.
hi: इस कमांड के लिए मॉड्यूल पैरामीटर की आवश्यकता होती है।
ru: Эта команда требует параметр модуля.
uz: Bu buyruq modul parametrini talab qiladi.

source: Clean one or more modules
bg: Изчистване на един или повече модули
el: Καθαρισμός ενός η περισσοτέρων αρθρωμάτων
hi: एक या अधिक मॉड्यूल साफ करें
ru: Очистить один или несколько модулей
uz: Bir yoki bir nechta modulni tozalang

source: honour the makeclean setting in config file
bg: следване на настройката „makeclean“ във файла с настройки
el: τήρηση της ρύθμισης makeclean στο αρχείο ρυθμίσεων
eo: respekti la agordon makeclean en la agorda dosiero
hi: विन्यास फाइल में makeclean सेटिंग का सम्मान करें
ru: учитывать параметр makeclean в файле конфигурации
uz: konfiguratsiya faylidagi makeclean sozlamalarini hurmat qiling

source: completely clean source tree
bg: пълно изчистване на дървото на кода
el: πλήρης καθαρισμός του δέντρου πηγαίου κώδικα
eo: tute purigi la font-arbon
hi: पूरी तरह से साफ स्रोत ट्री
ru: полностью очистить дерево исходного кода
uz: butunlay toza manba daraxti

source: clean command called while makeclean is set to False, skipped.
bg: командата за изчистване е извикана, но „makeclean“ е False, прескачане.
el: κλήθηκε η εντολή clean ενώ το makeclean έχει οριστεί σε False, παραλείπεται.
eo: clean-komando vokita kiam makeclean estas False; preterlasite.
hi: जब makeclean को False पर निर्धारित किया जाता है, तो clean कमांड को बुलाया किया जाता है, छोड़ दिया जाता है।
ru: команда очистки вызвала makeclean, которая возвратила False, пропущено.
uz: makeclean False ga o'rnatilganda chaqirilgan clean buyrug'i o'tkazib yuborilgan.

source: Update and compile all modules (the default)
bg: Обновяване и компилиране на всички модули (стандартно)
el: Ενημέρωση και μεταγλώττιση όλων των αρθρωμάτων (η προεπιλογή)
hi: सभी मॉड्यूल (तयशुदा) को अद्यतन और संकलित करें
ru: Обновить и скомпилировать все модули (по умолчанию)
uz: Barcha modullarni yangilang va kompilyatsiya qiling (standart)

source: always run autogen.sh
bg: винаги да се изпълнява „autogen.sh“
el: εκτέλεση του autogen.sh πάντα
eo: ĉiam ruli autogen.sh
hi: हमेशा autogen.sh चलाएं
ru: всегда запускать autogen.sh
uz: har doim autogen.sh ni ishga tushiring

source: run make clean before make
bg: изпълняване на „make clean“ преди „make“
el: εκτέλεση make clean πριν το make
eo: ruli 'make clean' antaŭ 'make'
hi: make से पहले make clean चलाएं
ru: выполнить make clean перед make
uz: qilishdan oldin tozalang

source: run make check after building
bg: изпълняване на „make check“ след изграждането
el: εκτέλεση make check μετά τη δόμηση
eo: ruli 'make check' post konstruo
hi: निर्माण के बाद make check चलाएं
ru: выполнить make check после сборки
uz: qurgandan keyin tekshirishni ishga tushiring

source: run make dist after building
bg: изпълняване на „make dist“ след изграждането
el: εκτέλεση make dist μετά τη δόμηση
eo: ruli 'make dist' post konstruo
hi: निर्माण के बाद make dist चलाएं
ru: выполнить make dist после сборки
uz: qurishdan keyin make dist-ni ishga tushiring

source: run make distcheck after building
bg: изпълняване на „make distcheck“ след изграждането
el: εκτέλεση make distcheck μετά τη δόμηση
eo: ruli 'make distcheck' post konstruo
hi: निर्माण के बाद make distcheck चलाएं
ru: выполнить make distcheck после сборки
uz: qurgandan keyin make distche-ni ishga tushiring

source: skip version control update
bg: прескачане на обновяването на системата за контрол на версиите
el: παράλειψη ενημέρωσης από το σύστημα ελέγχου εκδόσεων
eo: preterlasi ĝisdatigon de versikontrolo
hi: संस्करण नियंत्रण अद्यतन छोड़ें
ru: пропустить обновление из системы контроля версий
uz: versiyani boshqarish yangilanishini o'tkazib yuboring

source: quiet (no output)
bg: тихо (по-малко подробности)
el: σιωπηλά (χωρίς έξοδο)
eo: silenta (neniu eligo)
hi: शांत (कोई आउटपुट नहीं)
ru: тихий режим (без вывода)
uz: jim (chiqish yo'q)

source: start building at the given module
bg: стартиране на изграждането от дадения модул
el: έναρξη δόμησης στο δοσμένο άρθρωμα
eo: komenci konstrui ĉe la donita modulo
hi: दिए गए मॉड्यूल पर निर्माण शुरू करें
ru: начать сборку с данного модуля
uz: berilgan modulda qurishni boshlang

source: build only modules with the given tags
bg: изграждане само на модулите със зададените етикети
el: δόμηση μόνο των αρθρωμάτων με τις δοσμένες ετικέτες
eo: konstrui nur modulojn kun la donitaj etikedoj
hi: केवल दिए गए टैग के साथ मॉड्यूल बनाएं
ru: собрать модули только с данными метками
uz: faqat berilgan teglar bilan modullarni yaratish

source: run tests in real X and not in Xvfb
bg: пускане на тестове в истинския X, а не в Xvfb
el: εκτέλεση δοκιμών σε πραγματικό X και όχι σε Xvfb
eo: ruli testojn en vera X kaj ne en Xvfb
hi: परीक्षण वास्तविक X में चलाएं, Xvfb में नहीं
ru: протестировать на настоящем сервере X, а не в Xvfb
uz: testlarni Xvfb-da emas, balki haqiqiy X-da bajaring

source: try to force checkout and autogen on failure
bg: опитване на принудително изтегляне и „autogen“ при неуспех
el: προσπάθεια εξαναγκασμού checkout και autogen σε περίπτωση αποτυχίας
eo: provi devigi elprenon kaj autogen ĉe malsukceso
hi: विफलता पर चेकआउट और ऑटोजेन को बाध्य करने का प्रयास करें
ru: попытаться принудительно выполнить извлечение и autogen при сбое
uz: to'lovni va autogenni muvaffaqiyatsizlikka majburlashga harakat qiling

source: don't poison modules on failure
bg: без отравяне на модулите при неуспех
el: να μην μολυνθούν τα αρθρώματα σε περίπτωση αποτυχίας
eo: ne venenigi modulojn ĉe malsukceso
hi: विफलता पर मॉड्यूल को विषाक्त न करें
ru: не помечать модули как сбойные при ошибке
uz: modullarni ishlamay qolganda zaharlamang

source: build even if policy says not to
bg: изграждане, дори ако политиката казва, че няма нужда
el: δόμηση ακόμη και εάν η πολιτική το απαγορεύει
eo: konstrui eĉ se la politiko diras male
hi: भले ही नीति ऐसा न करने को कहती हो, निर्माण करें
ru: сборать, даже если политика говорит об обратном
uz: agar siyosat yo'q desa ham qurish

source: also build soft-dependencies that could be skipped
bg: също така да се изградят незадължителните зависимости, които може да се пропуснат
el: δόμηση και των χαλαρών εξαρτήσεων που θα μπορούσαν να παραλειφθούν
eo: ankaŭ konstrui malfortajn dependecojn kiuj povus esti preterlasitaj
hi: नरम-निर्भरताएं भी बनाएं जिन्हें छोड़ा जा सके
ru: собрать также нежёсткие зависимости, которые могут быть пропущены
uz: shuningdek, o'tkazib yuborilishi mumkin bo'lgan yumshoq bog'liqliklarni yarating

source: skip modules installed less than the given time ago
bg: пропускане на модулите, инсталирани преди по-малко от зададеното време
el: παράλειψη αρθρωμάτων που εγκαταστάθηκαν νωρίτερα από τον δοσμένο χρόνο
eo: preterlasi modulojn instalitajn antaŭ malpli ol la donita tempo
hi: दिए गए समय से कम समय पहले स्थापित मॉड्यूल को छोड़ें
ru: пропускать модули, установленные менее указанного времени назад
uz: belgilangan vaqtdan kamroq o'rnatilgan modullarni o'tkazib yuborish

source: ignore missing system dependencies
bg: прескачане на липсващите системни зависимости
el: αγνόηση εξαρτήσεων συστήματος που λείπουν
eo: ignori mankantajn sistemdependaĵojn
hi: अनुपलब्ध सिस्टम निर्भरताओं को अनदेखा करें
ru: модуль «%(modname)s» не существует, создаётся автоматически с помощью репозитория «%(reponame)s»
uz: etishmayotgan tizim bog'liqliklariga e'tibor bermang

source: requested module is in the ignore list, nothing to do.
bg: заявеният модул е в списъка за прескачане, няма нищо за правене.
el: το αιτούμενο άρθρωμα είναι στη λίστα αγνόησης, καμία ενέργεια.
eo: petita modulo estas en la ignor-listo; nenio farenda.
hi: अनुरोधित मॉड्यूल अनदेखा सूची में है, कुछ भी नहीं किया जा सकता।
ru: запрошенный модуль находится в списке игнорируемых, нечего выполнять.
uz: so'ralgan modul e'tibor bermaslik ro'yxatida, hech narsa qilish kerak emas.

source: Required system dependencies not installed. Install using the command %(cmd)s or to ignore system dependencies use command-line option %(opt)s
bg: Необходимите системни зависимости не са инсталирани. Инсталирайте с помощта на командата „%(cmd)s“ или използвайте опцията „%(opt)s“ на командния ред, за да игнорирате системните зависимости
el: Δεν εγκαταστάθηκαν οι απαιτούμενες εξαρτήσεις του συστήματος. Εγκαταστήστε τις με την εντολή %(cmd)s ή για να τις αγνοήσετε, χρησιμοποιήστε την επιλογή της γραμμής εντολών %(opt)s
eo: Bezonataj sistemdependaĵoj ne estas instalitaj. Instalu per la komando %(cmd)s aŭ por ignori sistemdependaĵojn uzu la komandlinian opcion %(opt)s
hi: आवश्यक सिस्टम निर्भरताएं स्थापित नहीं हैं। %(cmd)s कमांड का उपयोग करके स्थापित करें या सिस्टम निर्भरताओं को अनदेखा करने के लिए कमांड-लाइन विकल्प %(opt)s का उपयोग करें
ru: Требуемые системные зависимости не установлены. Установите их с помощью команды %(cmd)s или используйте параметр командной строки %(opt)s, чтобы их проигнорировать
uz: Kerakli tizim bog'liqliklari o'rnatilmagan. %(cmd)s buyrug'i yordamida o'rnating yoki tizimga bog'liqliklarni e'tiborsiz qoldirish uchun %(opt)s buyruq qatoridan foydalaning

source: Update and compile one or more modules
bg: Обновяване и компилиране на един или повече модули
el: Ενημέρωση και μεταγλώττιση ενός ή περισσοτέρων αρθρωμάτων
hi: एक या अधिक मॉड्यूल को अद्यतन और संकलित करें
ru: Обновить или скомпилировать один или несколько модулей
uz: Bir yoki bir nechta modullarni yangilang va kompilyatsiya qiling

source: module "%(modname)s" does not exist, created automatically using repository "%(reponame)s"
bg: модулът „%(modname)s“ не съществува, създаден е автоматично с помощта на хранилището „%(reponame)s“
el: το άρθρωμα "%(modname)s" δεν υπάρχει, δημιουργήθηκε αυτόματα χρησιμοποιώντας το αποθετήριο "%(reponame)s"
eo: modulo "%(modname)s" ne ekzistas; kreita aŭtomate uzante la deponejon "%(reponame)s"
hi: मॉड्यूल "%(modname)s" मौजूद नहीं है, रिपॉजिटरी "%(reponame)s" का उपयोग करके स्वचालित रूप से बनाया गया है
ru: модуль «%(modname)s» не существует, создаётся автоматически с помощью репозитория «%(reponame)s»
uz: “%(modname)s” moduli mavjud emas, “%(reponame)s” ombori yordamida avtomatik yaratilgan

source: Run a command under the JHBuild environment
bg: Изпълняване на команда в JHBuild средата
el: Εκτέλεση εντολής υπό το περιβάλλον JHBuild
hi: JHBuild वातावरण के अंतर्गत कमांड चलाएं
ru: Выполнить команду в окружении JHBuild
uz: JHBuild muhiti ostida buyruqni ishga tushiring

source: [ options ... ] program [ arguments ... ]
bg: [ОПЦИЯ…] ПРОГРАМА [АРГУМЕНТ…]
el: [ επιλογές ... ] πρόγραμμα [ ορίσματα ... ]
hi: [ विकल्प ... ] प्रोग्राम [ तर्क ... ]
ru: [ параметры ... ] программа [ аргументы ... ]
uz: [variantlar ...] dastur [argumentlar ...]

source: run command in build dir of the given module
bg: изпълняване на командата в директорията за изграждане в дадения модул
el: εκτέλεση εντολής στον κατάλογο δόμησης του δοσμένου αρθρώματος
eo: ruli komandon en la konstr-dosierujo de la donita modulo
hi: दिए गए मॉड्यूल की निर्माण निर्देशिका में कमांड चलाएं
ru: выполнить команду в каталоге сборки данного модуля
uz: berilgan modulning qurish direktorida buyruqni ishga tushiring

source: run command in checkout dir of the given module
bg: изпълняване на командата в директорията за изтегляне в дадения модул
el: εκτέλεση εντολής στον κατάλογο εξαγωγής (checkout) του δοσμένου αρθρώματος
eo: ruli komandon en la elpren-dosierujo de la donita modulo
hi: दिए गए मॉड्यूल की चेकआउट निर्देशिका में कमांड चलाएं
ru: выполнить команду в каталоге извлечения указанного модуля
uz: berilgan modulning chiqish direksiyasida buyruqni ishga tushiring

source: Unable to execute the command '%(command)s': %(err)s
bg: Командата „%(command)s“ не може да се изпълни: %(err)s
el: Αδυναμία εκτέλεσης της εντολής '%(command)s': %(err)s
eo: Ne eblas ruli la komandon '%(command)s': %(err)s
hi: '%(command)s' आदेश निष्पादित करने में असमर्थ: %(err)s
ru: Невозможно выполнить команду «%(command)s»: %(err)s
uz: “%(command)s” buyrug‘ini bajarib bo‘lmadi: %(err)s

source: Unable to execute the command '%s'
bg: Командата „%s“ не може да се изпълни
el: Αδυναμία εκτέλεσης της εντολής '%s'
eo: Ne eblas ruli la komandon '%s'
hi: '%s' आदेश निष्पादित करने में असमर्थ
ru: Невозможно выполнить команду «%s»
uz: “%s” buyrug‘ini bajarib bo‘lmadi

source: No command given
bg: Не е дадена команда
el: Δε δόθηκε εντολή
eo: Neniu komando donita
hi: कोई कमांड निर्दिष्ट नहीं
ru: Не указана команда
uz: Hech qanday buyruq berilmagan

source: Start a shell under the JHBuild environment
bg: Стартиране на обвивка в средата на JHBuild
el: Εκκίνηση κελύφους υπό το περιβάλλον JHBuild
hi: JHBuild वातावरण के अंतर्गत शैल प्रारंभ करें
ru: Запустить оболочку в окружении JHBuild
uz: JHBuild muhiti ostida qobiqni ishga tushiring

source: List the modules that would be built
bg: Изброяване на модулите, които ще се изградят
el: Λίστα των αρθρωμάτων που θα δομούνταν
hi: बनाए जाने वाले मॉड्यूल की सूची बनाएं
ru: Список модулей, которые могут быть собраны
uz: Quriladigan modullarni sanab o'ting

source: show which revision will be built
bg: показване на версията, която ще се изгради
el: εμφάνιση της αναθεώρησης που θα δομηθεί
eo: montri kiun revizion oni konstruos
hi: दिखाएं कि कौन सा संशोधन बनाया जाएगा
ru: показать, какая редакция будет собрана
uz: qaysi reviziya tuzilishini ko'rsating

source: start list at the given module
bg: започване на списъка от дадения модул
el: έναρξη λίστας στο δοσμένο άρθρωμα
eo: komenci liston ĉe la donita modulo
hi: दिए गए मॉड्यूल पर सूची प्रारंभ करें
ru: начать список с указанного модуля
uz: berilgan modulda boshlang'ich ro'yxati

source: also list soft-dependencies that could be skipped
bg: също така да се изброят незадължителните зависимости, които може да се пропуснат
el: να εμφανίζονται και οι χαλαρές εξαρτήσεις που θα μπορούσαν να παραλειφθούν
eo: ankaŭ listigi malfortajn dependecojn kiuj povus esti preterlasitaj
hi: उन नरम-निर्भरताओं की भी सूची बनाएं जिन्हें छोड़ा जा सकता है
ru: вывести список нежёстких зависимостей, которые могут пропущены
uz: shuningdek, o'tkazib yuborilishi mumkin bo'lgan yumshoq bog'liqliklarni sanab o'ting

source: list all modules, not only those that would be built
bg: изброяване на всички модули, а не само на тези, които ще бъдат изградени.
el: λίστα όλων των αρθρωμάτων, όχι μόνο αυτών που θα δομούνταν
eo: listigi ĉiujn modulojn, ne nur tiujn kiuj estus konstruitaj
hi: सभी मॉड्यूल की सूची बनाएं, न कि केवल उन मॉड्यूल की जिन्हें बनाया जाएगा
ru: список всех модулей, не только тех, которые могут быть собраны
uz: faqat quriladigan modullarni emas, balki barcha modullarni sanab o'ting

source: Conflicting options specified ('--start-at' and '--all-modules')
bg: Зададени са противоречащи опции („--start-at“ и „--all-modules“)
el: Καθορίστηκαν συγκρουόμενες επιλογές ('--start-at' και '--all-modules')
eo: Konfliktaj opcioj specifitaj ('--start-at' kaj '--all-modules')
hi: विरोधाभासी विकल्प निर्दिष्ट ('--start-at' और '--all-modules')
ru: Указаны конфликтующие параметры ('--start-at' и '--all-modules')
uz: Ko'rsatilgan qarama-qarshi variantlar ('--start-at' va '--all-modules')

source: Output a Graphviz dependency graph for one or more modules
bg: Извеждане на гра̀фа за Graphviz на зависимостите за един или повече модули
el: Έξοδος γραφήματος εξαρτήσεων Graphviz για ένα ή περισσότερα αρθρώματα
hi: एक या अधिक मॉड्यूल के लिए Graphviz निर्भरता ग्राफ आउटपुट करें
ru: Вывести граф зависимостей Graphviz для одного или нескольких модулей
uz: Bir yoki bir nechta modul uchun Graphviz qaramlik grafigini chiqaring

source: [ modules ... ]
bg: [МОДУЛ…]
el: [ αρθρώματα ... ]
hi: [ मॉड्यूल ... ]
ru: [ модули ... ]
uz: [ modullar ... ]

source: add dotted lines to soft dependencies
bg: добавяне на пунктирани линии към незадължителните зависимости
el: προσθήκη διάστικτων γραμμών στις χαλαρές εξαρτήσεις
eo: aldoni punktitajn liniojn al malfortaj dependecoj
hi: नरम निर्भरताओं में बिंदीदार रेखाएं जोड़ें
ru: добавлять пунктирные линии для нежёстких зависимостей
uz: yumshoq bog'liqliklarga nuqtali chiziqlar qo'shing
