Repository: GNOME/jhbuild
Catalog: po/*.po
Languages: bg, el, eo, hi, ru, uz

source: group modules from metamodule together
bg: групиране на модули от metamodule заедно
el: ομαδοποίηση αρθρωμάτων από το μετα-άρθρωμα
eo: grupi modulojn el metamodulo kune
hi: मेटामॉड्यूल से मॉड्यूल को एक साथ समूहित करें
ru: добавлять пунктирные линии для нежёстких зависимостей
uz: metamoduldan modullarni birgalikda guruhlash

source: Run post-install triggers for named modules (or all)
bg: Изпълняване на спусъците след инсталацията за посочените модули (или всички)
el: Εκτέλεση εναυσμάτων μετά την εγκατάσταση για τα ονοματισμένα αρθρώματα (ή όλα)
hi: नामित मॉड्यूल (या सभी) के लिए पोस्ट-स्थापना ट्रिगर्स चलाएं
ru: Запустить триггеры после установки для указанных модулей (или для всех)
uz: Nomlangan modullar (yoki barchasi) uchun o'rnatishdan keyingi triggerlarni ishga tushiring

source: Build support tools
bg: Помощни инструменти за изграждане
el: Δόμηση εργαλείων υποστήριξης
hi: समर्थन उपकरण बनाएं
ru: Собрать вспомогательные инструменты
uz: Qo'llab-quvvatlash vositalarini yarating

source: Check modules in GNOME Git repository have the correct branch definition
bg: Проверяване дали модулите в хранилището на GNOME в Git имат правилна дефиниция на клона
el: Έλεγχος αν τα αρθρώματα στο αποθετήριο Git του GNOME έχουν τον σωστό ορισμό κλάδου
hi: जांच करें कि गनोम गिट रिपॉजिटरी में मॉड्यूल में सही शाखा परिभाषा है
ru: Проверить, что модули в репозитории GNOME Git имеют правильное определение ветви
uz: GNOME Git omboridagi modullar to'g'ri filial ta'rifiga ega ekanligini tekshiring

source: %(module)s is missing branch definition for %(branch)s
bg: в „%(module)s“ липсва дефиницията на клона „%(branch)s“
el: Λείπει ο ορισμός κλάδου του %(module)s για το %(branch)s
eo: Mankas branĉa difino por %(branch)s en %(module)s
hi: %(module)s में %(branch)s के लिए शाखा परिभाषा गुम है
ru: У модуля %(module)s отсутствует определение ветви для %(branch)s
uz: %(module)sda %(branch)s uchun filial taʼrifi yoʻq

source: Check if modules in JHBuild have the correct definition
bg: Проверяване дали модулите в JHBuild имат правилна дефиниция
el: Έλεγχος αν τα αρθρώματα στο JHBuild έχουν τον σωστό ορισμό
hi: जांच करें कि क्या JHBuild में मॉड्यूल की परिभाषा सही है
ru: Проверить, имеют ли модули в JHBuild правильное определение
uz: JHBuild modullari to'g'ri ta'rifga ega ekanligini tekshiring

source: %(module)s is unreachable (%(href)s)
bg: „%(module)s“ е недостъпен (%(href)s)
el: το %(module)s είναι μη προσπελάσιμο (%(href)s)
eo: %(module)s estas neatingebla (%(href)s)
hi: %(module)s पहुंच योग्य नहीं है (%(href)s)
ru: Модуль %(module)s недоступен (%(href)s)
uz: %(module)s bilan bog‘lanib bo‘lmaydi (%(href)s)

source: Cannot check %(module)s (%(href)s)
bg: „%(module)s“ не може да се провери (%(href)s)
el: Αδυναμία ελέγχου του %(module)s (%(href)s)
eo: Ne povas kontroli %(module)s (%(href)s)
hi: %(module)s (%(href)s) की जांच नहीं की जा सकती
ru: Невозможно проверить %(module)s (%(href)s)
uz: %(module)s (%(href)s) tekshirilmadi

source: Clean all modules
bg: Изчистване на всички модули
el: Καθαρισμός όλων των αρθρωμάτων
eo: Purigi ĉiujn modulojn
hi: सभी मॉड्यूल साफ करें
ru: Очистить все модули
uz: Barcha modullarni tozalang

source: Build targets from a GUI app
bg: Цѐли за изграждане от програми с графичен интерфейс
el: Δόμηση στόχων από εφαρμογή GUI
hi: GUI ऐप से लक्ष्य बनाएं
ru: Собрать цели из графического приложения
uz: GUI ilovasidan maqsadlarni yarating

source: Display information about one or more modules
bg: Показване на информация за един или повече модули
el: Εμφάνιση πληροφοριών για ένα ή περισσότερα αρθρώματα
hi: एक या अधिक मॉड्यूल के बारे में जानकारी प्रदर्शित करें
ru: Показать информацию об одном или нескольких модулях
uz: Bir yoki bir nechta modullar haqidagi ma'lumotlarni ko'rsatish

source: only display information for installed modules. This will not list system dependencies. If one or more module names are specified and at least one module is not installed, then the command will return 1.
bg: показване на информация само за инсталираните модули. Не се изписват системните зависимости. Ако са указани едно или повече имена на модули и поне един модул не се инсталира, командата връща 1.
el: εμφάνιση πληροφοριών μόνο για εγκατεστημένα αρθρώματα. Αυτό δεν θα εμφανίσει εξαρτήσεις συστήματος. Εάν καθοριστούν ένα ή περισσότερα ονόματα αρθρωμάτων και τουλάχιστον ένα άρθρωμα δεν είναι εγκατεστημένο, τότε η εντολή θα επιστρέψει 1.
eo: montri nur informojn por instalitaj moduloj. Tio ne listigos sistemdependecojn. Se unu aŭ pli da moduloj estas specifitaj kaj almenaŭ unu modulo ne estas instalita, tiam la komando liveros 1.
hi: केवल स्थापित मॉड्यूल के लिए जानकारी प्रदर्शित करें। इससे सिस्टम निर्भरताओं की सूची नहीं बनेगी। यदि एक या अधिक मॉड्यूल नाम निर्दिष्ट हैं और कम से कम एक मॉड्यूल स्थापित नहीं है, तो कमांड 1 लौटाएगा।
ru: отображать информацию только для установленных модулей. Это не покажет системные зависимости. Если указано одно или несколько имён модулей и хотя бы один из них не установлен, команда вернёт 1.
uz: faqat o'rnatilgan modullar uchun ma'lumotlarni ko'rsatish. Bu tizimga bog'liqliklarni ro'yxatga kiritmaydi. Agar bir yoki bir nechta modul nomi ko'rsatilgan bo'lsa va kamida bitta modul o'rnatilmagan bo'lsa, buyruq 1 ni qaytaradi.

source: unknown module %s
bg: неизвестен модул %s
el: άγνωστο άρθρωμα %s
eo: nekonata modulo %s
hi: अज्ञात मॉड्यूल %s
ru: неизвестный модуль %s
uz: noma'lum modul %s

source: Name:
bg: Име:
el: Όνομα:
eo: Nomo:
hi: नाम:
ru: Имя:
uz: Ism:

source: Module Set:
bg: Набор от модули:
el: Σύνολο αρθρωμάτων:
eo: Modularo:
hi: मॉड्यूल सेट:
ru: Набор модулей:
uz: Modullar to'plami:

source: Type:
bg: Вид:
el: Τύπος:
eo: Tipo:
hi: प्रकार:
ru: Тип:
uz: Turi:

source: Install version:
bg: Версия за инсталиране:
el: Έκδοση εγκατάστασης:
eo: Instala versio:
hi: स्थापना संस्करण:
ru: Установленная версия:
uz: O'rnatish versiyasi:

source: Install date:
bg: Дата на инсталиране:
el: Ημερομηνία εγκατάστασης:
eo: Instala dato:
hi: स्थापना तिथि:
ru: Дата установки:
uz: O'rnatish sanasi:

source: not installed
bg: не е инсталирано
el: μη εγκατεστημένο
eo: ne instalita
hi: स्थापित नहीं है
ru: не установлен
uz: o'rnatilmagan

source: CVS Root:
bg: Начална директория на CVS:
el: Ρίζα CVS:
eo: CVS-Radiko:
hi: CVS रूट:
ru: Корень CVS:
uz: CVS ildizi:

source: CVS Module:
bg: Модул на CVS:
el: Άρθρωμα CVS:
eo: CVS-Modulo:
hi: CVS मॉड्यूल:
ru: Модуль CVS:
uz: CVS moduli:

source: CVS Revision:
bg: Версия на CVS:
el: Αναθεώρηση CVS:
eo: CVS-Revizio:
hi: CVS संशोधन:
ru: Правка CVS:
uz: CVS tahriri:

source: Subversion Module:
bg: Модул на Subversion:
el: Άρθρωμα Subversion:
eo: Subversion-Modulo:
hi: उप-संस्करण मॉड्यूल:
ru: Модуль subversion:
uz: Subversion moduli:

source: Darcs Archive:
bg: Архив на Darcs:
el: Αρχειοθήκη Darcs:
eo: Darcs-Arkivo:
hi: Darcs पुरालेख:
ru: Архив darcs:
uz: Darcs arxivi:

source: Git Module:
bg: Модул на Git:
el: Άρθρωμα Git:
eo: Git-Modulo:
hi: गिट मॉड्यूल:
ru: Модуль Git:
uz: Git moduli:

source: Git Origin Module:
bg: Първоначален модул на Git:
el: Αρχικό άρθρωμα Git:
eo: Git-Origin-Modulo:
hi: गिट उत्पत्ति मॉड्यूल:
ru: Исходный модуль Git:
uz: Git Origin moduli:

source: Git Branch:
bg: Клон на Git:
el: Κλάδος Git:
eo: Git-Branĉo:
hi: गिट शाखा:
ru: Ветвь Git:
uz: Git filiali:

source: Git Tag:
bg: Етикет на Git:
el: Ετικέτα Git:
eo: Git-Etikedilo:
hi: गिट टैग:
ru: Метка Git:
uz: Git tegi:

source: URL:
bg: Адрес:
eo: Retadreso:

source: Version:
bg: Версия:
el: Έκδοση:
eo: Versio:
hi: संस्करण:
ru: Версия:
uz: Versiya:

source: Tree-ID:
bg: Идентификатор на дървото:
eo: Arb-ID:
hi: ट्री-आईडी:
ru: ID дерева:
uz: Daraxt ID:

source: Sourcedir:
bg: Директория за изходния код:
el: Πηγαίος κατάλογος:
eo: Font-dosierujo:
hi: स्रोत निर्देशिका:
uz: Rejissyor:

source: Requires:
bg: Изисква:
el: Απαιτεί:
eo: Bezonate:
hi: आवश्यक:
ru: Требует:
uz: Talab qiladi:

source: Required by:
bg: Изисква се от:
el: Απαιτείται από:
eo: Bezontate de:
hi: इसके लिए आवश्यक:
ru: Требуется для:
uz: Talab qilingan:

source: Suggests:
bg: Предлага:
el: Προτείνει:
eo: Sugestas:
hi: सुझाव:
ru: Предлагает:
uz: Taklif qiladi:

source: After:
bg: След:
el: Μετά:
eo: Post:
hi: उपरांत:
ru: До:
uz: Keyin:

source: Before:
bg: Преди:
el: Πριν:
eo: Antaŭ:
hi: पहले:
ru: После:
uz: Oldin:

source: [ options ... ]
bg: [ОПЦИЯ…]
el: [ επιλογές ... ]
hi: [ विकल्प ... ]
ru: [ параметры ... ]
uz: Printer opsiyalari

source: required=%s
bg: изисквано=%s
el: απαιτούμενο=%s
eo: bezonate=%s
hi: आवश्यक=%s
ru: требуется=%s
uz: zarur=%s

source: installed=%s
bg: инсталирано=%s
el: εγκατεστημένο=%s
eo: instalite=%s
hi: स्थापित=%s
ru: установлено=%s
uz: o'rnatilgan=%s

source: Required packages:
bg: Допълнително необходими пакети:
el: Απαιτούμενα πακέτα:
eo: Bezontataj pakaĵoj:
hi: आवश्यक पैकेज:
ru: Требуемые пакеты:
uz: Kerakli paketlar:

source: System installed packages which are too old:
bg: Инсталирани системни пакети, които са твърде стари:
eo: Sistem-instalitaj pakaĵoj kiuj estas tro malnovaj:
hi: सिस्टम में स्थापित पैकेज जो बहुत पुराने हैं:
ru: Установленные в системе пакеты, которые слишком старые:
uz: Tizimda o'rnatilgan paketlar juda eski:

source: (none)
bg: (без)
eo: (neniu)
hi: (कोई नहीं)
ru: (нет)
uz: (yo'q)

source: No matching system package installed:
bg: Не е инсталиран съвпадащ системен пакет:
eo: Neniu kongrua sistempakaĵo instalita:
hi: कोई मेल खाता सिस्टम पैकेज स्थापित नहीं है:
ru: Не найдено подходящих системных пакетов:
uz: Mos keladigan tizim paketi oʻrnatilmagan:

source: JHBuild commands are:
bg: Командите на JHBuild са:
el: Οι εντολές του JHBuild είναι:
eo: JHBuild-komandoj estas:
hi: JHBuild कमांड हैं:
ru: Команды JHBuild:
uz: JHBuild buyruqlari:

source: For more information run "jhbuild <command> --help"
bg: За повече информация изпълнете „jhbuild КОМАНДА --help“
el: Για περισσότερες πληροφορίες εκτελέστε "jhbuild <command> --help"
eo: Por pliaj informoj rulu "jhbuild <komando> --help"
hi: अधिक जानकारी के लिए "jhbuild <command> --help" चलाएं
ru: Для получения дополнительной информации выполните «jhbuild <command> --help»
uz: Qo'shimcha ma'lumot olish uchun "jhbuild<command> --yordam"

source: Information about available JHBuild commands
bg: Информация за наличните команди на JHBuild
el: Πληροφορίες για τις διαθέσιμες εντολές του JHBuild
hi: उपलब्ध JHBuild कमांड के बारे में जानकारी
ru: Информация о доступных командах JHBuild
uz: Mavjud JHBuild buyruqlari haqida ma'lumot

source: no such command (did you mean "jhbuild build %s"?)
bg: няма такава команда (да нямате предвид „jhbuild build %s“?)
el: δεν υπάρχει τέτοια εντολή (μήπως εννοούσατε "jhbuild build %s";)
eo: ne ekzistas tia komando (ĉu vi celis "jhbuild build %s"?)
hi: ऐसा कोई कमांड नहीं (क्या आपका मतलब "jhbuild build %s" था?)
ru: нет такой команды (вы имели ввиду «jhbuild build %s»?)
uz: bunday buyruq yo'q (siz "jhbuild build %s" ni nazarda tutdingizmi?)

source: no such command (did you mean "jhbuild run %s"?)
bg: няма такава команда (да нямате предвид „jhbuild run %s“?)
el: δεν υπάρχει τέτοια εντολή (μήπως εννοούσατε "jhbuild run %s";)
eo: ne ekzistas tia komando (ĉu vi celis "jhbuild run %s"?)
hi: ऐसा कोई कमांड नहीं (क्या आपका मतलब "jhbuild run %s" था?)
ru: нет такой команды (вы имели ввиду «jhbuild run %s»?)
uz: bunday buyruq yo'q (siz "jhbuild run %s" ni nazarda tutdingizmi?)

source: Compile and install the module for the current directory
bg: Компилиране и инсталиране на модула за текущата директория
el: Μεταγλώττιση και εγκατάσταση του αρθρώματος για τον τρέχοντα κατάλογο
hi: वर्तमान निर्देशिका के लिए मॉड्यूल संकलित और स्थापित करें
ru: Скомпилировать и установить модуль для текущего каталога
uz: Joriy katalog uchun modulni kompilyatsiya qiling va o'rnating

source: The current directory is not in the checkout root %r
bg: Текущата директория не е в началната директория на изтегления клон %r
el: Ο τρέχων κατάλογος δεν βρίσκεται στη ρίζα εξαγωγής (checkout root) %r
eo: La nuna dosierujo ne estas en la elprena radiko %r
hi: वर्तमान निर्देशिका चेकआउट रूट %r में नहीं है
ru: Текущий каталог не находится в корне извлечения %r
uz: Joriy katalog %r hisob-kitob ildizida emas

source: No module matching current directory %r in the moduleset
bg: Няма модул, съответстващ на текущата директория %r, в набора от модули
el: Κανένα άρθρωμα δεν ταιριάζει με τον τρέχοντα κατάλογο %r στο σύνολο αρθρωμάτων
eo: Neniu modulo kongrua kun la nuna dosierujo %r en la modularo
hi: मॉड्यूलसेट में वर्तमान निर्देशिका %r से मेल खाता कोई मॉड्यूल नहीं है
ru: В наборе модулей нет модуля, соответствующего текущему каталогу %r
uz: Modullar toʻplamida joriy katalogga mos keladigan modul yoʻq %r

source: Display reverse-dependencies of a module
bg: Показване на обратните зависимости на даден модул
el: Εμφάνιση αντίστροφων εξαρτήσεων ενός αρθρώματος
hi: किसी मॉड्यूल की रिवर्स-निर्भरताएं प्रदर्शित करें
ru: Показать обратные зависимости модуля
uz: Modulning teskari bog'liqliklarini ko'rsatish

source: [ module ]
bg: [МОДУЛ]
el: [ άρθρωμα ]
hi: [ मॉड्यूल ]
ru: [ модуль ]
uz: %s plagin moduli mavjud emas

source: display dependency path next to modules
bg: показване на пътя на зависимостите до модулите
el: εμφάνιση διαδρομής εξάρτησης δίπλα στα αρθρώματα
eo: montri dependaĵ-vojon apud moduloj
hi: मॉड्यूल के आगे निर्भरता पथ प्रदर्शित करें
ru: отображать путь зависимости рядом с модулями
uz: modullar yonida qaramlik yo'lini ko'rsatish

source: limit display to modules directly depending on given module
bg: ограничаване на показването до модули до пряко зависещите от дадения модул
el: περιορισμός εμφάνισης στα αρθρώματα που εξαρτώνται άμεσα από το δοσμένο άρθρωμα
eo: limigi montradon al moduloj rekte dependaj de la donita modulo
hi: दिए गए मॉड्यूल के आधार पर सीधे मॉड्यूल तक प्रदर्शन को सीमित करें
ru: ограничить отображение модулями, непосредственно зависящими от указанного модуля
uz: to'g'ridan-to'g'ri berilgan modulga qarab modullarga ko'rsatishni cheklash

source: Check that required support tools are available
bg: Проверяване за наличност на необходимите помощни инструменти
el: Έλεγχος διαθεσιμότητας των απαιτούμενων εργαλείων υποστήριξης
hi: जांचें कि आवश्यक सहायता उपकरण उपलब्ध हैं
ru: Проверить доступность необходимых инструментов поддержки
uz: Kerakli qo'llab-quvvatlash vositalari mavjudligini tekshiring

source: no extra arguments expected
bg: не се очакват допълнителни аргументи
el: δεν αναμένονται επιπλέον ορίσματα
eo: neniuj kromaj argumentoj atendataj
hi: कोई अतिरिक्त तर्क अपेक्षित नहीं
ru: дополнительные аргументы не ожидаются
uz: qo'shimcha dalillar kutilmaydi

source: checkout root (%s) is not writable
bg: няма права̀ за запис в началната директория на изтеглянето (%s)
el: η ρίζα εξαγωγής (%s) δεν είναι εγγράψιμη
eo: elprena radiko (%s) ne estas skribebla
hi: चेकआउट रूट (%s) लिखने योग्य नहीं है
ru: корневой каталог извлечения (%s) не доступен для записи
uz: to'lov ildizi (%s) yozish mumkin emas

source: install prefix (%s) is not writable
bg: няма права̀ за запис в в префикса за инсталиране (%s)
el: το πρόθεμα εγκατάστασης (%s) δεν είναι εγγράψιμο
eo: instala prefikso (%s) ne estas skribebla
hi: स्थापना उपसर्ग (%s) लिखने योग्य नहीं है
ru: префикс установки (%s) не доступен для записи
uz: o'rnatish prefiksi (%s) yozilmaydi

source: %s not found
bg: %s липсва
el: το %s δεν βρέθηκε
eo: %s ne trovita
hi: %s नहीं मिला
ru: %s не найдено
uz: %s topilmadi

source: Could not find XML catalog (usually part of the package 'libxml2-utils')
bg: Каталогът на XML липсва (обикновено е част от пакета „libxml2-utils“)
el: Αδυναμία εύρεσης καταλόγου XML (συνήθως μέρος του πακέτου 'libxml2-utils')
eo: Ne eblis trovi XML-katalogon (kutime parto de la pako 'libxml2-utils')
hi: XML कैटलॉग नहीं मिल सका (आमतौर पर पैकेज 'libxml2-utils' का हिस्सा)
ru: Не удалось найти XML-каталог (обычно является частью пакета 'libxml2-utils')
uz: XML katalogini topib bo'lmadi (odatda "libxml2-utils" paketining bir qismi)

source: Could not find %s in XML catalog (usually part of package 'docbook-xsl')
bg: „%s“ липсва в каталога на XML (обикновено е част от пакета „docbook-xsl“)
el: Αδυναμία εύρεσης του %s στον κατάλογο XML (συνήθως μέρος του πακέτου 'docbook-xsl')
eo: Ne eblis trovi %s en la XML-katalogo (kutime parto de la pako 'docbook-xsl')
hi: XML कैटलॉग में %s नहीं मिला (आमतौर पर पैकेज 'docbook-xsl' का हिस्सा)
ru: Не удалось найти %s в XML-каталоге (обычно является частью пакета 'docbook-xsl')
uz: XML katalogida %s topilmadi (odatda "docbook-xsl" paketining bir qismi)

source: Could not find the Perl module %s (usually part of package 'libxml-parser-perl' or 'perl-XML-Parser')
bg: Модулът на Perl „%s“ липсва (обикновено е част от пакета „libxml-parser-perl“ или „perl-XML-Parser“)
el: Αδυναμία εύρεσης του αρθρώματος Perl %s (συνήθως μέρος του πακέτου 'libxml-parser-perl' ή 'perl-XML-Parser')
eo: Ne eblis trovi la Perl-modulon %s (kutime parto de la pako 'libxml-parser-perl' aŭ 'perl-XML-Parser')
hi: Perl मॉड्यूल %s (आमतौर पर 'libxml-parser-perl' या 'perl-XML-Parser' पैकेज का हिस्सा) नहीं मिल सका
ru: Не удалось найти модуль Perl %s (обычно является частью пакета 'libxml-parser-perl' или 'perl-XML-Parser')
uz: Perl moduli %s topilmadi (odatda "libxml-parser-perl" yoki "perl-XML-Parser" paketining bir qismi)

source: curl or wget not found
bg: „curl“ или „wget“ липсват
el: Δεν βρέθηκε το curl ή το wget
eo: curl aŭ wget ne troviĝis
hi: curl या wget नहीं मिला
ru: не найдены curl или wget
uz: curl yoki wget topilmadi

source: Installed git program is not the right git
bg: Инсталираната програма на git не е правилната
el: Το εγκατεστημένο πρόγραμμα git δεν είναι το σωστό git
eo: La instalita git-programo ne estas la ĝusta git
hi: स्थापित git प्रोग्राम सही git नहीं है
ru: Установленная программа git не является верной
uz: O'rnatilgan git dasturi to'g'ri git emas

source: Could not check git program
bg: Програмата на Git не може да се провери
el: Αδυναμία ελέγχου του προγράμματος git
eo: Ne eblis kontroli la programon git
hi: git प्रोग्राम की जांच नहीं की जा सकी
ru: Не удалось проверить программу git
uz: Git dasturini tekshirib bo'lmadi

source: aclocal can't see %s macros
bg: „aclocal“ не вижда макросите %s
el: το aclocal δεν μπορεί να δει τις μακροεντολές %s
eo: aclocal ne vidas la makroojn %s
hi: aclocal %s मैक्रो नहीं देख सके
ru: aclocal не видит макросы %s
uz: aclocal %s ta makrosni koʻra olmaydi

source: Please copy the lacking macros (%(macros)s) in one of the following paths: %(path)s
bg: Копирайте липсващите макроси (%(macros)s) в един от следните пътища: %(path)s
el: Παρακαλούμε αντιγράψτε τις μακροεντολές που λείπουν (%(macros)s) σε μία από τις ακόλουθες διαδρομές: %(path)s
eo: Bonvolu kopii la mankantajn makroojn (%(macros)s) en unu el la sekvaj vojoj: %(path)s
hi: कृपया लुप्त मैक्रो (%(macros)s) को निम्न में से किसी एक पथ में कॉपी करें: %(path)s
ru: Пожалуйста, скопируйте недостающие макросы (%(macros)s) в один из следующих путей: %(path)s
uz: Iltimos, etishmayotgan makroslarni (%(macros)s) quyidagi yoʻllardan biriga nusxalang: %(path)s

source: Print out a moduleset for the exact versions that are checked out
bg: Извеждане на набор от модули за точните версии, които са изтеглени
el: Εκτύπωση ενός συνόλου αρθρωμάτων για τις ακριβείς εκδόσεις που έχουν εξαχθεί
hi: चेक आउट किए गए सटीक संस्करणों के लिए मॉड्यूलसेट प्रिंट करें
ru: Вывести набор модулей для точных версий, которые были извлечены
uz: Tekshirilgan aniq versiyalar uchun modul to'plamini chop eting

source: Check and install tarball dependencies using system packages
bg: Проверяване и инсталиране на зависимостите, които са архиви на tar, с помощта на системни пакети
el: Έλεγχος και εγκατάσταση εξαρτήσεων tarball χρησιμοποιώντας πακέτα συστήματος
hi: सिस्टम पैकेज का उपयोग करके टारबॉल निर्भरता की जांच करें और उसे स्थापित करें
ru: Проверить и установить зависимости из архивов с помощью системных пакетов
uz: Tizim paketlari yordamida tarball bog'liqliklarini tekshiring va o'rnating

source: Machine readable list of missing sysdeps
bg: Машинно четим списък на липсващите системни зависимости
el: Λίστα ελλειπουσών εξαρτήσεων συστήματος αναγνώσιμη από μηχανή
eo: Maŝinlegebla listo de mankantaj sistemdependaĵoj
hi: गुम सिस्टम विकास परियोजनाओं की मशीन पठनीय सूची
ru: Машиночитаемый список отсутствующих системных зависимостей
uz: Mashina tomonidan o'qilishi mumkin bo'lgan etishmayotgan tizimlar ro'yxati

source: Machine readable list of all sysdeps
bg: Машинно четим списък на всички системни зависимости
el: Λίστα όλων των εξαρτήσεων συστήματος αναγνώσιμη από μηχανή
eo: Maŝinlegebla listo de ĉiuj sistemdependaĵoj
hi: सभी सिस्टम विकास विभागों की मशीन पठनीय सूची
ru: Машиночитаемый список всех системных зависимостей
uz: Mashina tomonidan o'qiladigan barcha tizimlar ro'yxati

source: Install pkg-config modules via system
bg: Инсталиране на модули за „pkg-config“ чрез системата
el: Εγκατάσταση αρθρωμάτων pkg-config μέσω συστήματος
eo: Instali pkg-config-modulojn per la sistemo
hi: सिस्टम के माध्यम से pkg-config मॉड्यूल स्थापित करें
ru: Установить модули pkg-config через системный менеджер пакетов
uz: Tizim orqali pkg-config modullarini o'rnating

source: assume yes/the default answer to interactive questions during installation of system dependencies
bg: приемане на да/стандартен отговор на интерактивни въпроси при инсталиране на системни зависимости
el: υπόθεση ναι/της προεπιλεγμένης απάντησης σε διαδραστικές ερωτήσεις κατά την εγκατάσταση εξαρτήσεων συστήματος
eo: supozi jes/la defaŭltan respondon al interagaj demandoj dum instalado de sistemdependaĵoj
hi: सिस्टम निर्भरता की स्थापना के दौरान अंतर्क्रियात्मक प्रश्नों के लिए हाँ/तयशुदा उत्तर मान लें
ru: принимать ответ «да»/ответ по умолчанию на интерактивные вопросы во время установки системных зависимостей
uz: Tizimga bog'liqliklarni o'rnatish vaqtida interaktiv savollarga ha/birlamchi bo'yicha javob bering1

source: System installed packages which are new enough:
bg: Инсталирани от системата пакети, които са достатъчно нови:
el: Εγκατεστημένα πακέτα συστήματος που είναι αρκετά νέα:
eo: Sisteminstalitaj pakoj kiuj estas sufiĉe novaj:
hi: सिस्टम में स्थापित पैकेज जो काफी नए हैं:
ru: Установленные в системе пакеты, которые достаточно новые:
uz: Tizimda o'rnatilgan paketlar etarlicha yangi:

source: (none)
bg: (без)
eo: (neniu)
hi: (कोई नहीं)
ru: нет)
uz: (yo'q)

source: Optional packages: (JHBuild will build the missing packages)
bg: Незадължителни пакети: (JHBuild ще изгради липсващите пакети)
el: Προαιρετικά πακέτα: (Το JHBuild θα δομήσει τα πακέτα που λείπουν)
eo: Laŭvolaj pakoj: (JHBuild konstruos la mankantajn pakojn)
hi: वैकल्पिक पैकेज: (JHBuild अनुपलब्ध पैकेजों का निर्माण करेगा)
ru: Необязательные пакеты: (JHBuild соберёт недостающие пакеты)
uz: Ixtiyoriy paketlar: (JHBuild etishmayotgan paketlarni yaratadi)

source: %(cmd)s is required to install packages on this system. Please install %(cmd)s.
bg: „%(cmd)s“ е необходима за инсталиране на пакети в тази система. Инсталирайте „%(cmd)s“.
el: το %(cmd)s απαιτείται για την εγκατάσταση πακέτων σε αυτό το σύστημα. Παρακαλούμε εγκαταστήστε το %(cmd)s.
eo: Por instali pakojn en ĉi tiu sistemo necesas %(cmd)s. Bonvolu instali %(cmd)s.
hi: इस सिस्टम पर पैकेज स्थापित करने के लिए %(cmd)s की आवश्यकता है। कृपया %(cmd)s स्थापित करें।
ru: Для установки пакетов в этой системе требуется %(cmd)s. Пожалуйста, установите %(cmd)s.
uz: Ushbu tizimga paketlarni oʻrnatish uchun %(cmd)s talab qilinadi. Iltimos, %(cmd)s ilovasini oʻrnating.

source: Don't know how to install packages on this system
bg: Не е ясно как се инсталират пакети на тази система
el: Άγνωστος τρόπος εγκατάστασης πακέτων σε αυτό το σύστημα
eo: Ne scias kiel instali pakojn en ĉi tiu sistemo
hi: इस सिस्टम पर पैकेज स्थापित करने का तरीका नहीं पता
ru: Неизвестно, как устанавливать пакеты в этой системе
uz: Ushbu tizimda paketlarni qanday o'rnatishni bilmayman
