Repository: GNOME/jhbuild
Catalog: po/*.po
Languages: bg, el, eo, hi, ru, uz

source: branch %(branch)s has %(num)d heads
bg: клон „%(branch)s“ има %(num)d върха
el: ο κλάδος %(branch)s έχει %(num)d κεφαλές
eo: branĉo %(branch)s havas %(num)d kapojn
hi: शाखा %(branch)s में %(num)d प्रमुख हैं
ru: ветка %(branch)s имеет %(num)d голов
uz: %(branch)s filialida %(num)d ta bosh bor

source: Checking out branch '%(branch)s' to directory '%(dir)s'
bg: Изтегляне на клон „%(branch)s“ в директория „%(dir)s“
el: Εξαγωγή κλάδου '%(branch)s' στον κατάλογο '%(dir)s'
eo: Elprenante branĉon '%(branch)s' al dosierujo '%(dir)s'
hi: शाखा '%(branch)s' को निर्देशिका '%(dir)s' में चेक आउट किया जा रहा है
ru: Извлечение ветки «%(branch)s» в каталог «%(dir)s»
uz: “%(branch)s” filiali “%(dir)s” katalogiga tekshirilmoqda

source: Updating working copy %s
bg: Обновяване на работното копие %s
el: Ενημέρωση αντιγράφου εργασίας %s
eo: Ĝisdatigante laborkopion %s
hi: कार्यशील प्रतिलिपि %s अद्यतन की जा रही है
ru: Обновление рабочей копии %s
uz: Ishchi nusxa yangilanmoqda %s

source: Getting SVN subdirs: this operation might be long...
bg: Получаване на поддиректориите на SVN: тази операция може да отнеме много време…
el: Λήψη υποκαταλόγων SVN: αυτή η λειτουργία μπορεί να διαρκέσει αρκετά...
eo: Akiro de SVN-subdosierujoj: ĉi tiu operacio povas esti longa...
hi: SVN उप-निर्देशिकाएं प्राप्त करना: यह कार्य लम्बा हो सकता है...
ru: Получение подкаталогов SVN: эта операция может быть долгой...
uz: SVN pastki kataloglarini olish: bu operatsiya uzoq davom etishi mumkin...

source: could not get Subversion URI for %s
bg: Адресът на subversion за %s не може да си получи
el: αδυναμία λήψης του Subversion URI για το %s
eo: ne eblis akiri Subversion-URI por %s
hi: %s के लिए सबवर्सन URI प्राप्त नहीं किया जा सका
ru: не удалось получить URI Subversion для %s
uz: %s uchun Subversion URI ni ololmadi

source: could not parse "svn info" output for %s
bg: Изходът от „svn info“ за „%s“ не може да се разчете
el: αδυναμία ανάλυσης της εξόδου του "svn info" για το %s
eo: ne eblis analizi eligon de "svn info" por %s
hi: %s के लिए "svn info" आउटपुट पार्स नहीं किया जा सका
ru: не удалось разобрать вывод «svn info» для %s
uz: %s uchun "svn info" chiqishini tahlil qilib boʻlmadi

source: Error checking for conflicts
bg: Грешка при проверяването за конфликти
el: Σφάλμα ελέγχου για συγκρούσεις
eo: Eraro kontrolante konfliktojn
hi: विरोधों की जांच करने में त्रुटि
ru: Ошибка проверки на конфликты
uz: Mojarolarni tekshirishda xatolik yuz berdi

source: URL has no filename component: %s
bg: Адресът няма компонент за име на файл: %s
el: Το URL δεν περιέχει όνομα αρχείου: %s
eo: URL ne havas dosiernoman komponanton: %s
hi: URL में कोई फाइल नाम घटक नहीं है: %s
ru: URL-адрес не содержит компонента имени файла: %s
uz: URLda fayl nomi komponenti yoʻq: %s

source: file not downloaded
bg: файлът не е изтеглен
el: το αρχείο δεν λήφθηκε
eo: dosiero ne elŝutita
hi: फाइल डाउनलोड नहीं हुई
ru: файл не загружен
uz: fayl yuklab olinmagan

source: downloaded file size is incorrect (expected %(size1)d, got %(size2)d)
bg: размерът на изтегления файл е неправилен (очакваше се %(size1)d, но полученото е %(size2)d)
el: το μέγεθος του ληφθέντος αρχείου είναι εσφαλμένο (αναμενόταν %(size1)d, βρέθηκε %(size2)d)
eo: elŝutita dosiergrando estas malĝusta (atendita %(size1)d, ricevita %(size2)d)
hi: डाउनलोड की गई फाइल का आकार गलत है (अपेक्षित %(size1)d, प्राप्त %(size2)d)
ru: размер загруженного файла неверный (ожидался %(size1)d, получен %(size2)d)
uz: yuklab olingan fayl hajmi notoʻgʻri (kutilayotgan %(size1)d, olingan: %(size2)d)

source: invalid hash attribute on module %s
bg: неправилен атрибут за контролна сума на модул „%s“
el: μη έγκυρη ιδιότητα hash στο άρθρωμα %s
eo: nevalida haketo-atributo ĉe modulo %s
hi: मॉड्यूल %s पर अमान्य हैश विशेषता
ru: неверный атрибут хэша у модуля %s
uz: %s modulidagi yaroqsiz xesh atributi

source: file hash is incorrect (expected %(sum1)s, got %(sum2)s)
bg: неправилна контролна сума на файла (очакваше се %(sum1)s, но полученото е %(sum2)s)
el: το hash του αρχείου είναι εσφαλμένο (αναμενόταν %(sum1)s, βρέθηκε %(sum2)s)
eo: dosiera haketo estas malĝusta (atendita %(sum1)s, ricevita %(sum2)s)
hi: फाइल हैश गलत है (अपेक्षित %(sum1)s, प्राप्त %(sum2)s)
ru: некорректный хэш-файл (ожидалось — %(sum1)s, получено — %(sum2)s)
uz: fayl xeshi noto'g'ri (kutilgan %(sum1)s, %(sum2)s bor)

source: skipped hash check (missing support for %s)
bg: пропусната е проверката на контролна сума (липсва поддръжка на „%s“)
el: παραλείφθηκε ο έλεγχος hash (λείπει η υποστήριξη για %s)
eo: preterlasita haketo-kontrolo (mankas subteno por %s)
hi: हैश जांच छोड़ दी गई (%s के लिए समर्थन अनुपलब्ध)
ru: проверка хэша пропущена (отсутствует поддержка %s)
uz: xesh tekshiruvi oʻtkazib yuborildi (%s uchun qoʻllab-quvvatlash yoʻq)

source: tarball dir (%s) must be writable
bg: трябва да имате права̀ за запис в директорията за архива tar („%s“)
el: ο κατάλογος tarball (%s) πρέπει να είναι εγγράψιμος
eo: tarball-dosierujo (%s) devas esti skribebla
hi: टारबॉल निर्देशिका (%s) लिखने योग्य होनी चाहिए
ru: каталог архивов (%s) должен быть доступен для записи
uz: tarball dir (%s) yozilishi kerak

source: unable to find wget or curl
bg: „wget“ и „curl“ липсват
el: αδυναμία εύρεσης του wget ή του curl
eo: ne eblas trovi wget aŭ curl
hi: wget या curl खोजने में असमर्थ
ru: не удалось найти wget или curl
uz: wget yoki curl topilmadi

source: tarball dir (%s) can not be created
bg: директорията за архива tar („%s“) не може да се създаде
el: δεν μπορεί να δημιουργηθεί ο κατάλογος tarball (%s)
eo: ne eblas krei tarball-dosierujon (%s)
hi: टारबॉल निर्देशिका (%s) नहीं बनाई जा सकती
ru: каталог tar-архива (%s) не может быть создан
uz: tarball dir (%s) yaratib boʻlmaydi

source: failed to unpack %s
bg: неуспешно разархивиране на „%s“
el: αποτυχία αποσυμπίεσης του %s
eo: malsukcesis malpaki %s
hi: %s को अनपैक करने में विफल
ru: не удалось распаковать %s
uz: %s paketdan chiqarilmadi

source: could not unpack tarball (expected %s dir)
bg: неуспешно разархивиране на архив tar (очакваше се директория „%s“)
el: αδυναμία αποσυμπίεσης του tarball (αναμενόταν κατάλογος %s)
eo: ne eblis malpaki tarball (atendita dosierujo %s)
hi: टारबॉल को अनपैक नहीं किया जा सका (अपेक्षित %s निर्देशिका)
ru: не удалось распаковать tar-архив (ожидался каталог %s)
uz: tarballni ochib bo'lmadi (kutilgan %s dir)

source: unable to find quilt
bg: „quilt“ липсва
el: αδυναμία εύρεσης του quilt
eo: ne eblas trovi quilt
hi: quilt नहीं मिल पाई
ru: не удалось найти quilt
uz: yorgan topa olmadi

source: could not checkout quilt patch set
bg: неуспешно изтегляне на кръпка на „quilt“
el: αδυναμία εξαγωγής του συνόλου διορθώσεων quilt
eo: ne eblis elpreni aron de quilt-flikaĵoj
hi: quilt पैच सेट चेकआउट नहीं कर सका
ru: не удалось извлечь набор патчей quilt
uz: yorgan patch to'plamini tekshirib bo'lmadi

source: make mrproper
uz: mr mos qiling

source: System installed packages which are too old:
el: Εγκατεστημένα πακέτα συστήματος που είναι πολύ παλιά:

source: (none)
el: (κανένα)

source: No matching system package installed:
el: Δεν εγκαταστάθηκε αντίστοιχο πακέτο συστήματος:

source: (none)
el: (κανένα)

source: Invalid condition set modifier: '%s'. Must start with '+' or '-'.
el: Μη έγκυρος τροποποιητής συνόλου συνθηκών: '%s'. Πρέπει να ξεκινά με '+' ή '-'.

source: Your install prefix contains a 'lib64' directory, which is no longer supported by jhbuild. This is likely the result of a previous build with an older version of jhbuild or of a broken package. Please consider removing your install and checkout directories and starting fresh.
el: Το πρόθεμα εγκατάστασής σας περιέχει έναν κατάλογο 'lib64', ο οποίος δεν υποστηρίζεται πλέον από το jhbuild. Αυτό είναι πιθανώς αποτέλεσμα προηγούμενης δόμησης με παλαιότερη έκδοση του jhbuild ή σπασμένου πακέτου. Παρακαλούμε εξετάστε την αφαίρεση των καταλόγων εγκατάστασης και εξαγωγής και ξεκινήστε από την αρχή.

source: EOF
el: Τέλος αρχείου (EOF)

source: Install encountered errors: %(num)d errors raised, %(files)d files copied. The errors are: %(err)s
el: Η εγκατάσταση συνάντησε σφάλματα: προέκυψαν %(num)d σφάλματα, αντιγράφηκαν %(files)d αρχεία. Τα σφάλματα είναι: %(err)s

source: no manifest for '%s', can't uninstall. Try building again, then uninstalling.
el: δεν υπάρχει διακήρυξη (manifest) για το '%s', αδυναμία απεγκατάστασης. Δοκιμάστε να το δομήσετε ξανά και μετά να το απεγκαταστήσετε.

source: Installing: %s
el: Εγκατάσταση: %s

source: Using dnf to install packages. Please wait.
el: Χρήση του dnf για την εγκατάσταση πακέτων. Παρακαλούμε περιμένετε.

source: Using pacman to install packages. Please wait.
el: Χρήση του pacman για την εγκατάσταση πακέτων. Παρακαλούμε περιμένετε.

source: Need at least git-1.5.6 from June/08 to operate
hi: इसे चलाने के लिए कम से कम जून/08 से git-1.5.6 की आवश्यकता है

source: External handling failed If you are running git version < 1.5.6 it is recommended you update.
hi: बाहरी प्रबंधन विफल रहा यदि आप git संस्करण < 1.5.6 चला रहे हैं तो यह अनुशंसित है कि आप इसे अद्यतन करें।

source: branch for %s is not correct, check the moduleset file.
hi: %s के लिए शाखा सही नहीं है, moduleset फाइल की जांच करें।
