Repository: GNOME/jhbuild
Catalog: po/*.po
Languages: bg, el, eo, hi, ru, uz

source: %(configuration_variable)s invalid key %(key)s
bg: %(configuration_variable)s неправилен ключ %(key)s
el: μη έγκυρο κλειδί %(key)s για τη μεταβλητή %(configuration_variable)s
eo: %(configuration_variable)s nevalida ŝlosilo %(key)s
hi: %(configuration_variable)s अमान्य कुंजी %(key)s
ru: %(configuration_variable)s неверный ключ %(key)s
uz: %(configuration_variable)s yaroqsiz kalit %(key)s

source: Conflicts during checkout:
bg: Конфликти по време на изтеглянето:
el: Συγκρούσεις κατά την εξαγωγή (checkout):
eo: Konfliktoj dum elpreno:
hi: चेकआउट के दौरान टकराव:
ru: Конфликты во время извлечения:
uz: Hisob-kitob paytidagi nizolar:

source: ########## Error running %s
bg: •••••••••• Грешка при изпълнение на %s
el: ########## Σφάλμα κατά την εκτέλεση του %s
eo: ########## Eraro dum ruligo de %s
hi: ########## %s चलाने में त्रुटि
ru: ########## Ошибка выполнения %s
uz: ########## %s ishga tushirishda xatolik yuz berdi

source: success
bg: успех
el: επιτυχία
eo: sukceso
hi: सफलता
ru: успешно
uz: muvaffaqiyat

source: the following modules were not built
bg: следните модули не бяха изградени
el: τα ακόλουθα αρθρώματα δεν δομήθηκαν
eo: la jenaj moduloj ne estis konstruitaj
hi: निम्नलिखित मॉड्यूल नहीं बनाए गए
ru: следующие модули не были собраны
uz: quyidagi modullar qurilmagan

source: automatically retrying configure
bg: автоматично повтаряне на опита за настройване
el: αυτόματη προσπάθεια ρύθμισης ξανά
eo: aŭtomate reprovas agordi
hi: स्वचालित रूप से विन्यास का पुनः प्रयास किया जा रहा है
ru: автоматически перезапускать configure
uz: konfiguratsiyani avtomatik ravishda qaytadan urinish

source: automatically forcing a fresh checkout
bg: автоматично принуждаване на чисто изтегляне
el: αυτόματος εξαναγκασμός νέας εξαγωγής (checkout)
eo: aŭtomate trudante freŝan elprenon
hi: स्वचालित रूप से नए चेकआउट के लिए बाध्य किया जा रहा है
ru: автоматическое принудительное новое извлечение
uz: avtomatik ravishda yangi to'lovni majburlash

source: Start shell
bg: Стартиране на обвивката
el: Εκκίνηση κελύφους
eo: Startigi ŝelon
hi: शैल प्रारंभ करें
ru: Запустить командную оболочку
uz: Shellni boshlang

source: Reload configuration
bg: Презареждане на настройките
el: Επαναφόρτωση ρυθμίσεων
eo: Reŝargi agordon
hi: विन्यास पुनः लोड करें
ru: Перезагрузить конфигурацию
uz: Konfiguratsiyani qayta yuklash

source: choice:
bg: избор:
el: επιλογή:
eo: elekto:
hi: विकल्प:
ru: выбор:
uz: tanlov:

source: exit shell to continue with build
bg: изход от обвивката, за да продължи изграждането
el: έξοδος από το κέλυφος για συνέχιση της δόμησης
eo: eliru el la ŝelo por daŭrigi la konstruon
hi: निर्माण जारी रखने के लिए शैल से बाहर निकलें
ru: выход в оболочку для продолжения сборки
uz: qurishni davom ettirish uchun qobiqdan chiqing

source: invalid choice
bg: неправилен избор
el: μη έγκυρη επιλογή
eo: nevalida elekto
hi: अमान्य विकल्प
ru: некорректный выбор
uz: noto'g'ri tanlov

source: Type "yes" to confirm the action:
bg: Въведете „да“, за да потвърдите действието:
el: Πληκτρολογήστε "yes" για επιβεβαίωση της ενέργειας:
eo: Tajpu "jes" por konfirmi la agon:
hi: कार्रवाई की पुष्टि करने के लिए "yes" टाइप करें:
ru: Введите «да» для подтверждения действия:
uz: Amalni tasdiqlash uchun "ha" ni kiriting:

source: yes
bg: да
el: ναι
eo: jes
ru: да
uz: ha

source: You should not run jhbuild as root.
bg: Не трябва да изпълнявате jhbuild като системен потребител.
el: Δεν πρέπει να εκτελείτε το jhbuild ως υπερχρήστης (root).
eo: Vi ne devus ruli jhbuild kiel radikuzanto.
hi: आपको jhbuild को रूट के रूप में नहीं चलाना चाहिए।
ru: Внимание: jhbuild не должен запускаться от имени root.
uz: Siz jhbuild dasturini root sifatida ishga tushirmasligingiz kerak.

source: %prog [ -f config ] command [ options ... ]
bg: %prog [ -f НАСТРОЙКА] КОМАНДА [ОПЦИЯ…]
el: %prog [ -f ρυθμίσεις ] εντολή [ επιλογές ... ]
eo: %prog [ -f agordo ] komando [ opcioj ... ]
hi: %prog [ -f विन्यास ] कमांड [ विकल्प ... ]
ru: %prog [ -f конфигурационный_файл ] команда [ параметры ... ]
uz: %prog [ -f config ] buyrug'i [ imkoniyatlari ... ]

source: Build a set of modules from diverse repositories in correct dependency order (such as GNOME).
bg: Изграждане на набор от модули от различни хранилища в правилен ред на зависимости (например GNOME).
el: Δόμηση ενός συνόλου αρθρωμάτων από διαφορετικά αποθετήρια με τη σωστή σειρά εξαρτήσεων (όπως το GNOME).
eo: Konstruu aron da moduloj el diversaj deponejoj en ĝusta dependeca ordo (ekz. GNOMO).
hi: विविध रिपॉजिटरी से सही निर्भरता क्रम में मॉड्यूल का एक सेट बनाएं (जैसे कि गनोम)।
ru: Сборка набора модулей из различных репозиториев в правильном порядке зависимостей (например, GNOME).
uz: To'g'ri bog'liqlik tartibida turli xil omborlardan modullar to'plamini yarating (masalan, GNOME).

source: Display this help and exit
bg: Показване на тази помощ и изход
el: Εμφάνιση αυτής της βοήθειας και έξοδος
eo: Montri ĉi tiun helpon kaj eliri
hi: यह सहायता प्रदर्शित करें और बाहर निकलें
ru: Показать эту справку и выйти
uz: Ushbu yordamni ko'rsating va chiqing

source: use a non default configuration file
bg: използване на нестандартен файл с настройки
el: χρήση ενός μη προεπιλεγμένου αρχείου ρυθμίσεων
eo: uzi nedefaŭltan agordan dosieron
hi: गैर तयशुदा विन्यास फाइल का उपयोग करें
ru: использовать не стандартный конфигурационный файл (файл не по умолчанию)
uz: standart bo'lmagan konfiguratsiya faylidan foydalaning

source: use a non default module set
bg: използване на нестандартен набор от модули
el: χρήση ενός μη προεπιλεγμένου συνόλου αρθρωμάτων
eo: uzi nedefaŭltan modularon
hi: गैर तयशुदा मॉड्यूल सेट का उपयोग करें
ru: использовать не стандартный набор модулей (набор не по умолчанию)
uz: standart bo'lmagan modullar to'plamidan foydalaning

source: do not prompt for input
bg: без питане за вход
el: να μην ζητείται εισαγωγή δεδομένων
eo: ne peti enigon
hi: इनपुट के लिए संकेत न दें
ru: не запрашивать ввод
uz: kiritishni talab qilmang

source: exit immediately when the build fails
bg: незабавен изход при неуспешно изграждане
el: άμεση έξοδος όταν η δόμηση αποτύχει
eo: eliri tuj kiam la konstruo malsukcesas
hi: निर्माण विफल होने पर तुरंत बाहर निकलें
ru: немедленно выйти при сбое сборки
uz: qurish muvaffaqiyatsizlikka uchraganda darhol chiqing

source: modify the condition set
bg: промяна на набора от условия
el: τροποποίηση του συνόλου συνθηκών
eo: modifi la kondiĉaron
hi: निर्धारित शर्त को संशोधित करें
ru: изменить набор условий
uz: shartlar to'plamini o'zgartirish

source: Interrupted
bg: Прекъснат
el: Διακόπηκε
eo: Interrompite
hi: बाधित
ru: Прервано
uz: Uzildi

source: Configuring
bg: Настройване
el: Ρύθμιση
eo: Agordante
hi: विन्यस्त किया जा रहा है
ru: Настройка
uz: Sozlanmoqda

source: Cleaning
bg: Изчистване
el: Εκκαθάριση
eo: Purigante
hi: साफ किया जा रहा है
ru: Очистка
uz: Tozalash

source: Building
bg: Изграждане
el: Δόμηση
eo: Kreante
hi: निर्माण किया जा रहा है
ru: Сборка
uz: Bino

source: Checking
bg: Проверка
el: Έλεγχος
eo: Kontrolante
hi: जांच की जा रहा है
ru: Проверка
uz: Tekshirish

source: Creating tarball for
bg: Създаване на архив tar за
el: Δημιουργία συμπιεσμένου αρχείου (tarball) για
eo: Kreante arkiv-eton por
hi: इसके लिए टारबॉल बनाई जा रहा है
ru: Создание tar-архива для
uz: Tarball yaratilyapti

source: Dist checking
bg: Проверка на дистрибуцията
el: Έλεγχος διανομής (Dist checking)
eo: Distribua kontrolo
hi: Dist जांच की जा रहा है
ru: Проверка дистрибутива
uz: Masofaviy tekshirish

source: Uninstalling old installed version
bg: Деинсталиране на старата инсталирана версия
el: Απεγκατάσταση της παλιάς εγκατεστημένης έκδοσης
eo: Malinstalante malnovan instalitan version
hi: पुराने स्थापित संस्करण को अस्थापित किया जा रहा है
ru: Удаление старой установленной версии
uz: Eski o'rnatilgan versiyani olib tashlash

source: Installing
bg: Инсталиране
el: Εγκατάσταση
eo: Instalante
hi: स्थापित किया जा रहा है
ru: Установка
uz: Oʻrnatilmoqda

source: Distcleaning
bg: Изчистване на дистрибуцията
el: Εκκαθάριση διανομής (Distcleaning)
eo: Profunda purigado
hi: Dist साफ किया जा रहा है
ru: Очистка дистрибутива (Distclean)
uz: Tozalash

source: <%s/> tag must contain value=''
bg: етикетът „<%s/>“ трябва да съдържа „value=''“
el: Η ετικέτα <%s/> πρέπει να περιέχει value=''
eo: Etikedo <%s/> devas enhavi value=''
hi: <%s/> टैग में value='' होना चाहिए
ru: тег <%s/> должен содержать value=''
uz: <%s/> tegida qiymat boʻlishi kerak=''

source: unknown module type %s
bg: неизвестен вид модул „%s“
el: άγνωστος τύπος αρθρώματος %s
eo: nekonata modul-tipo %s
hi: अज्ञात मॉड्यूल प्रकार %s
ru: неизвестный тип модуля %s
uz: noma'lum modul turi %s

source: dep node for module %s is missing package attribute
bg: във възела със зависимости за модул „%s“ липсва атрибут „package“
el: λείπει η ιδιότητα πακέτου από τον κόμβο dep για το άρθρωμα %s
eo: dep-nodo por modulo %s mankas pri atributo 'package'
hi: मॉड्यूल %s के लिए dep नोड में पैकेज विशेषता गुम है
ru: у узла dep для модуля %s отсутствует атрибут package
uz: %s moduli uchun dep tugunida paket atributi yoʻq

source: %(node)s node for %(module)s module is missing %(attribute)s attribute
bg: Във възела „%(node)s“ за модула „%(module)s“ липсва атрибут „%(attribute)s“
el: λείπει η ιδιότητα %(attribute)s από τον κόμβο %(node)s για το άρθρωμα %(module)s
eo: Nodo %(node)s por la modulo %(module)s mankas je atributo %(attribute)s
hi: %(module)s मॉड्यूल के लिए %(node)s नोड में %(attribute)s विशेषता गुम है
ru: у узла %(node)s для модуля %(module)s отсутствует атрибут %(attribute)s
uz: %(module)s moduli uchun %(node)s tugunida %(attribute)s atributi yetishmayapti

source: no <branch> element found for %s
bg: липсва елемент „<branch>“ за „%s“
el: δεν βρέθηκε στοιχείο <branch> για το %s
eo: neniu elemento <branch> trovita por %s
hi: %s के लिए कोई <branch> तत्व नहीं मिला
ru: не найден элемент <branch> для %s
uz: yo'q<branch> %s uchun element topildi

source: Repository=%(missing)s not found for module id=%(module)s. Possible repositories are %(possible)s
bg: „Repository=%(missing)s“ липсва за модул „id=%(module)s“. Възможните хранилища са %(possible)s
el: Δεν βρέθηκε το Repository=%(missing)s για το άρθρωμα id=%(module)s. Πιθανά αποθετήρια είναι τα %(possible)s
eo: Deponejo=%(missing)s ne troviĝis por modulo id=%(module)s. Eblaj deponejoj estas %(possible)s
hi: मॉड्यूल id=%(module)s के लिए रिपॉजिटरी=%(missing)s नहीं मिली। संभावित रिपॉजिटरी %(possible)s हैं
ru: Репозиторий=%(missing)s не найден для модуля id=%(module)s. Возможные репозитории: %(possible)s
uz: Repository=%(missing)s id=%(module)s moduli uchun topilmadi. Mumkin bo'lgan omborlar: %(possible)s

source: No repository for module id=%(module)s. Either set branch/repo or default repository.
bg: Липсва хранилище за модул „id=%(module)s“. Задайте клон/хранилище или стандартно хранилище.
el: Δεν υπάρχει αποθετήριο για το άρθρωμα id=%(module)s. Ορίστε είτε κλάδο/αποθετήριο ή το προεπιλεγμένο αποθετήριο.
eo: Neniu deponejo por modulo id=%(module)s. Aŭ agordu branch/repo aŭ defaŭltan deponejon.
hi: मॉड्यूल id=%(module)s के लिए कोई रिपॉजिटरी नहीं है। या तो ब्रांच/रिपो या तयशुदा रिपॉजिटरी निर्धारित करें।
ru: Нет репозитория для модуля id=%(module)s. Установите ветку/репозиторий или репозиторий по умолчанию.
uz: Id=%(module)s moduli uchun ombor yo‘q. Filial/repo yoki standart omborni o'rnating.

source: Deleting .la file: %r
bg: Изтриване на .la-файл: %r
el: Διαγραφή αρχείου .la: %r
eo: Forigante .la-dosieron: %r
hi: .la फाइल मिटाई जा रही है: %r
ru: Удаление файла .la: %r
uz: .la fayli oʻchirilmoqda: %r

source: Deleting dir file: %r
bg: Изтриване на dir-файл: %r
el: Διαγραφή αρχείου dir: %r
eo: Forigante 'dir'-dosieron: %r
hi: dir फाइल मिटाई जा रही है: %r
ru: Удаление файла dir: %r
uz: Dir fayli oʻchirilmoqda: %r

source: Moving temporary DESTDIR %r into build prefix
bg: Преместване на временната целева директория „%r“ в префикса за изграждане
el: Μετακίνηση προσωρινού DESTDIR %r στο πρόθεμα δόμησης
eo: Movante provizoran DESTDIR %r en la konstruprefikson
hi: अस्थायी गंतव्य निर्देशिका %r को बिल्ड उपसर्ग में ले जाया जा रहा है
ru: Перемещение временного DESTDIR %r в префикс сборки
uz: Vaqtinchalik DESTDIR %r qurilish prefiksiga koʻchirilmoqda

source: Files remaining in buildroot %(dest)r; module may have installed files outside of prefix.
bg: Файлове, останали в директорията на изграждането „%(dest)r“. Модулът може да е инсталирал файлове извън префикса.
el: Παραμένουν αρχεία στο buildroot %(dest)r· το άρθρωμα μπορεί να έχει εγκαταστήσει αρχεία εκτός του προθέματος.
eo: Dosieroj restas en la buildroot %(dest)r; la modulo eble instalis dosierojn ekster la prefikso.
hi: बिल्डरूट %(dest)r में शेष फाइलें; मॉड्यूल में उपसर्ग के बाहर फाइलें स्थापित हो सकती हैं।
ru: Файлы остались в корне сборки %(dest)r; возможно, модуль установил файлы вне префикса.
uz: %(dest)r qurilish ildizida qolgan fayllar; modulda prefiksdan tashqarida o'rnatilgan fayllar bo'lishi mumkin.

source: Module failed to install into DESTDIR %(dest)r
bg: Модулът не успя да се инсталира в целевата директория „%(dest)r“
el: Το άρθρωμα απέτυχε να εγκατασταθεί στο DESTDIR %(dest)r
eo: Malsukcesis instali la modulon en DESTDIR %(dest)r
hi: मॉड्यूल गंतव्य निर्देशिका %(dest)r में स्थापित करने में विफल रहा
ru: Модулю не удалось установиться в DESTDIR %(dest)r
uz: Modulni DESTDIR %(dest)r ichiga oʻrnatib boʻlmadi

source: %d files remaining from previous build
bg: %d останали файлове от предишното изграждане
el: Απομένουν %d αρχεία από προηγούμενη δόμηση
eo: %d dosieroj restas el antaŭa konstruo
hi: पिछले निर्माण से शेष %d फाइलें
ru: Осталось файлов от предыдущей сборки: %d
uz: Oldingi tuzilishdan %d ta fayl qoldi

source: Deleted: %(file)r
bg: Изтрит: %(file)r
el: Διαγράφηκαν: %(file)r
eo: Forigita: %(file)r
hi: मिटाया गया: %(file)r
ru: Удалено: %(file)r
uz: Oʻchirildi: %(file)r

source: Failed to delete no longer installed file %(file)r: %(msg)s
bg: Неуспешно изтриване на файл, който вече не е инсталиран %(file)r: %(msg)s
el: Αποτυχία διαγραφής του αρχείου %(file)r που δεν είναι πλέον εγκατεστημένο: %(msg)s
eo: Malsukcesis forigi jam ne instalitan dosieron %(file)r: %(msg)s
hi: अब स्थापित नहीं की गई फाइल %(file)r को मिटाने में विफल: %(msg)s
ru: Не удалось удалить более не установленный файл %(file)r: %(msg)s
uz: Oʻrnatilmagan %(file)r faylini oʻchirib boʻlmadi: %(msg)s

source: Install encountered errors: %(num)d errors raised, %(files)d files copied. The errors are: %(err)s
bg: Грешки при инсталиране: %(num)d грешки, %(files)d копирани файлове. Грешките са: %(err)s
eo: Dum instalado okazis eraroj: %(num)d eraroj, %(files)d dosieroj kopiitaj. La eraroj estas: %(err)s
hi: स्थापित करने में त्रुटियां आई: %(num)d त्रुटियां उठाई गई, %(files)d फाइलें कॉपी की गई। ये त्रुटियां हैं: %(err)s
ru: При установке возникли ошибки: %(num)d ошибок, %(files)d файлов скопировано. Ошибки: %(err)s
uz: Oʻrnatishda yuzaga kelgan xatolar: %(num)d ta xatolik koʻtarildi, %(files)d ta fayl nusxalandi. Xatolar quyidagilardir: %(err)s

source: Install complete: %d files copied
bg: Инсталирането завърши: %d копирани файлове
el: Η εγκατάσταση ολοκληρώθηκε: αντιγράφηκαν %d αρχεία
eo: Instalado kompleta: %d dosieroj kopiitaj
hi: स्थापना पूर्ण: %d फाइलें कॉपी की गई
ru: Установка завершена: скопировано файлов: %d
uz: Oʻrnatish tugallandi: %d ta fayldan nusxa olindi

source: Skipping %s (not updated)
bg: Пропускане на %s (не е обновено)
el: Παράλειψη %s (δεν ενημερώθηκε)
eo: Preterpasante %s (ne ĝisdatigita)
hi: %s छोड़ा जा रहा है (अद्यतन नहीं किया गया)
ru: Пропуск %s (не обновлён)
uz: %s oʻtkazib yuborilmoqda (yangilanmagan)

source: Skipping %s (package and dependencies not updated)
bg: Пропускане на %s (пакетът и зависимостите не са обновени)
el: Παράλειψη %s (το πακέτο και οι εξαρτήσεις δεν ενημερώθηκαν)
eo: Preterpasante %s (pako kaj dependecoj ne ĝisdatigitaj)
hi: %s छोड़ा जा रहा है (पैकेज और निर्भरताएं अद्यतन नहीं की गई हैं)
ru: Пропуск %s (пакет и зависимости не обновлены)
uz: %s oʻtkazib yuborilmoqda (paket va bogʻliqliklar yangilanmagan)

source: ninja not found; use NINJA to point to a specific ninja binary
bg: „ninja“ липсва. Укажете изпълнимият файл на „ninja“ в променливата „NINJA“
el: το ninja δεν βρέθηκε· χρησιμοποιήστε το NINJA για να ορίσετε ένα συγκεκριμένο εκτελέσιμο ninja
eo: ninja ne troviĝis; uzu NINJA por indiki specifan binaron de ninja
hi: निंजा नहीं मिला; किसी विशिष्ट निंजा बाइनरी को इंगित करने के लिए NINJA का उपयोग करें
ru: ninja не найден; используйте NINJA, чтобы указать на конкретный исполняемый файл ninja
uz: ninja topilmadi; NINJA-dan ma'lum bir ninja binariga ishora qilish uchun foydalaning

source: Checking out
bg: Изтегляне
el: Εξαγωγή (checkout)
eo: Elprenante
hi: चेकआउट किया जा रहा है
ru: Извлечение
uz: Tekshirish

source: source directory %s was not created
bg: директорията за изходния код „%s“ не може да се създаде
el: δεν δημιουργήθηκε ο πηγαίος κατάλογος %s
eo: fonta dosierujo %s ne estis kreita
hi: स्रोत निर्देशिका %s नहीं बनाई गई
ru: каталог с исходным кодом %s не был создан
uz: %s manba katalogi yaratilmagan

source: wipe directory and start over
bg: изтриване на директорията и стартиране отначало
el: καθαρισμός καταλόγου και επανεκκίνηση
hi: निर्देशिका मिटाएं और फिर से शुरू करें
ru: очистить каталог и начать заново
uz: katalogni o'chiring va qaytadan boshlang

source: kconfig file %s was not created
bg: файлът kconfig „%s“ не е създаден
el: δεν δημιουργήθηκε το αρχείο kconfig %s
eo: kconfig-dosiero %s ne estis kreita
hi: kconfig फाइल %s नहीं बनाई गई
ru: файл kconfig %s не был создан
uz: kconfig fayli %s yaratilmagan

source: Installing kernel
bg: Инсталиране на ядро
el: Εγκατάσταση πυρήνα
eo: Instalante kernon
hi: कर्नेल स्थापित किया जा रहा है
ru: Установка ядра
uz: Yadro o'rnatilmoqda

source: Installing modules
bg: Инсталиране на модули
el: Εγκατάσταση αρθρωμάτων
eo: Instalante modulojn
hi: मॉड्यूल स्थापित किया जा रहा है
ru: Установка модулей
uz: Modullarni o'rnatish

source: Installing kernel headers
bg: Инсталиране на заглавните части на ядрото
el: Εγκατάσταση κεφαλίδων πυρήνα
eo: Instalante kernkapojn
hi: कर्नेल हेडर स्थापित किया जा रहा है
ru: Установка заголовков ядра
uz: Yadro sarlavhalarini o'rnatish

source: Repository=%(missing)s not found for kconfig in linux id=%(linux_id)s. Possible repositories are %(possible)s
bg: Repository=%(missing)s липсва за kconfig в linux id=%(linux_id)s. Възможните хранилища са %(possible)s
el: Δεν βρέθηκε το Repository=%(missing)s για το kconfig στο linux id=%(linux_id)s. Πιθανά αποθετήρια είναι τα %(possible)s
eo: Deponejo=%(missing)s ne troviĝis por kconfig en linux id=%(linux_id)s. Eblaj deponejoj estas %(possible)s
hi: Linux में kconfig के लिए रिपॉजिटरी=%(missing)s नहीं मिला id=%(linux_id)s। संभावित रिपॉजिटरी %(possible)s हैं
ru: Репозиторий=%(missing)s не найден для kconfig в linux id=%(linux_id)s. Возможные репозитории: %(possible)s
uz: Repository=%(missing)s Linuxda kconfig uchun topilmadi id=%(linux_id)s. Mumkin bo'lgan omborlar: %(possible)s

source: Default repository=%(missing)s not found for kconfig in linux id=%(linux_id)s. Possible repositories are %(possible)s
bg: Стандартно repository=%(missing)s липсва за kconfig в linux id=%(linux_id)s. Възможните хранилища са %(possible)s
el: Δεν βρέθηκε το προεπιλεγμένο repository=%(missing)s για το kconfig στο linux id=%(linux_id)s. Πιθανά αποθετήρια είναι τα %(possible)s
eo: Defaŭlta deponejo=%(missing)s ne troviĝis por kconfig en linux id=%(linux_id)s. Eblaj deponejoj estas %(possible)s
hi: तयशुदा रिपॉजिटरी=%(missing)s linux में kconfig के लिए नहीं मिला id=%(linux_id)s। संभावित रिपॉजिटरी %(possible)s हैं
ru: Репозиторий по умолчанию=%(missing)s не найден для kconfig в linux id=%(linux_id)s. Возможные репозитории: %(possible)s
uz: Linuxda kconfig uchun standart ombor=%(missing)s topilmadi id=%(linux_id)s. Mumkin bo'lgan omborlar: %(possible)s

source: module '%(module)s' has invalid size attribute ('%(size)s')
bg: модулът „%(module)s“ има неправилен атрибут за размер („%(size)s“)
el: το άρθρωμα '%(module)s' έχει μη έγκυρη ιδιότητα μεγέθους ('%(size)s')
eo: modulo '%(module)s' havas nevalidan atributon 'size' ('%(size)s')
hi: मॉड्यूल '%(module)s' में अमान्य आकार विशेषता है ('%(size)s')
ru: модуль «%(module)s» имеет неверный атрибут size ('%(size)s')
uz: '%(module)s' moduli yaroqsiz o'lcham atributiga ega ('%(size)s')

source: fixed case of module '%(orig)s' to '%(new)s'
bg: поправен е регистъра на модула „%(orig)s“ като „%(new)s“
el: διορθώθηκε η πεζότητα του αρθρώματος '%(orig)s' σε '%(new)s'
eo: fiksite la kazon de modulo '%(orig)s' al '%(new)s'
hi: मॉड्यूल '%(orig)s' से '%(new)s' तक का मामला ठीक किया गया
ru: исправлен регистр в имени модуля «%(orig)s» на «%(new)s»
uz: "%(orig)s" dan "%(new)s" gacha bo'lgan modulning qattiq holati

source: %(module)s has a dependency on unknown "%(invalid)s" module
bg: %(module)s зависи от неизвестен модул „%(invalid)s“
el: Το %(module)s έχει εξάρτηση από το άγνωστο άρθρωμα "%(invalid)s"
eo: %(module)s dependas de nekonata modula "%(invalid)s"
hi: %(module)s की निर्भरता अज्ञात "%(invalid)s" मॉड्यूल पर है
ru: модуль %(module)s имеет зависимость от неизвестного модуля «%(invalid)s»
uz: %(module)s nomaʼlum “%(invalid)s” moduliga bogʻliq

source: Circular dependencies detected: %s
bg: Открити са кръгови зависимости: %s
el: Εντοπίστηκαν κυκλικές εξαρτήσεις: %s
eo: Cirkulaj dependecoj detektitaj: %s
hi: परिपत्र निर्भरता का पता चला: %s
ru: Обнаружены циклические зависимости: %s
uz: Doiraviy bog'liqliklar aniqlandi: %s

source: Unknown module:
bg: Неизвестен модул:
el: Άγνωστο άρθρωμα:
eo: Nekonata modulo:
hi: अज्ञात मॉड्यूल:
ru: Неизвестный модуль:
uz: Noma'lum modul:

source: <if> must have exactly one of condition-set='' or condition-unset=''
bg: „<if>“ трябва да има точно едно от следните: „condition-set=''“ или „condition-unset=''“
el: το <if> πρέπει να έχει ακριβώς ένα από τα condition-set='' ή condition-unset=''
eo: <if> devas havi ĝuste unu el condition-set='' aŭ condition-unset=''
hi: <if> में condition-set='' या condition-unset='' में से कोई एक होना चाहिए
ru: <if> должен иметь ровно один атрибут: condition-set='' или condition-unset=''
uz: <if>condition-set='' yoki condition-unset='' dan bittasi bo'lishi kerak

source: could not download %s: %s
bg: „%s“ не може да се изтегли: %s
el: αδυναμία λήψης του %s: %s
eo: ne eblis elŝuti %s: %s
hi: %s डाउनलोड नहीं किया जा सका: %s
ru: не удалось загрузить %s: %s
uz: %s yuklab olinmadi: %s

source: failed to parse %s: %s
bg: „%s“ не може да се разчете: %s
el: αποτυχία ανάλυσης του %s: %s
eo: malsukcesis analizi %s: %s
hi: %s को पार्स करने में विफल: %s
ru: не удалось разобрать %s: %s
uz: %s tahlil qilinmadi: %s

source: Duplicate repository:
bg: Дублирано хранилище:
el: Διπλότυπο αποθετήριο:
eo: Duobla deponejo:
hi: डुप्लिकेट रिपोजिटरी:
ru: Повторяющийся репозиторий:
uz: Ikki nusxadagi ombor:

source: Modulesets were edited locally but JHBuild is configured to get them from the network, perhaps you need to add use_local_modulesets = True to your %s.
bg: Модулите са редактирани локално, но JHBuild е настроен да ги получава от мрежата, може би трябва да добавите „use_local_modulesets = True“ към вашия „%s“.
el: Τα σύνολα αρθρωμάτων τροποποιήθηκαν τοπικά αλλά το JHBuild έχει ρυθμιστεί να τα λαμβάνει από το δίκτυο, ίσως πρέπει να προσθέσετε use_local_modulesets = True στο %s.
eo: Modularoj estis redaktitaj loke sed JHBuild estas agordita por preni ilin el la reto; eble vi bezonas aldoni use_local_modulesets = True al via %s.
hi: मॉड्यूलसेट्स को स्थानीय रूप से संपादित किया गया था लेकिन JHBuild उन्हें नेटवर्क से प्राप्त करने के लिए विन्यस्त किया गया है, शायद आपको अपने %s में use_local_modulesets = True जोड़ने की आवश्यकता है।
ru: Наборы модулей были отредактированы локально, но JHBuild настроен на их получение из сети. Возможно, вам нужно добавить use_local_modulesets = True в ваш %s.
uz: Modullar toʻplami mahalliy tahrirlangan, ammo JHBuild ularni tarmoqdan olish uchun sozlangan, ehtimol siz %s ga use_local_modulesets = True qoʻshishingiz kerak boʻladi.
